{"rule_title": "colors", "rule_formulation": {"true": "The sentence mentions a color.", "false": "The sentence does not mention any color."}, "true_samples": ["The girl wore a striking red dress to the party.", "The sunset painted the sky in vibrant shades of orange and pink.", "The artist used a soothing shade of blue for the background of her painting.", "The fresh green leaves glistened in the morning dew.", "The traffic light turned from red to green, signaling the start of the race.", "The woman admired the beautiful purple flowers in the garden.", "The ripe strawberries were a rich, deep shade of crimson.", "The bright yellow taxi honked loudly as it sped down the street.", "The baby's nursery was decorated in soft pastel shades of pink and blue.", "The golden sun cast a warm glow over the sandy beach.", "The sky turned a deep shade of indigo as the sun began to set.", "She picked out a bright turquoise dress for the summer wedding.", "The firefighter wore a vibrant red helmet as she rushed into the burning building.", "His cheeks flushed a rosy pink as he spoke to his crush.", "The old barn was painted a rustic shade of ochre.", "The artist carefully mixed a subtle shade of lavender for her next masterpiece.", "The exotic bird flaunted its dazzling plumage of emerald green and sapphire blue.", "The little girl carefully selected a sunny yellow ribbon for her ponytail.", "The elegant ballroom was adorned with rich burgundy curtains and golden chandeliers.", "The landscape was blanketed in a soft, powdery white after the snowfall.", "The sky turned a beautiful shade of crimson as the sun dipped below the horizon.", "She painted her front door a cheerful shade of turquoise to brighten up her home.", "The autumn leaves were a stunning display of red, orange, and gold.", "He closed his eyes and pictured a peaceful meadow filled with vibrant shades of green.", "The actress wore a stunning gown in a daring shade of emerald to the glamorous awards ceremony.", "The old barn stood out against the lush, green landscape.", "He gazed at the deep blue ocean, feeling a sense of tranquility wash over him.", "The artist mixed different shades of gray to create a captivating and moody painting.", "The setting sun cast a warm, golden glow across the valley.", "She selected a deep, rich burgundy for the walls of her cozy living room.", "The vibrant petals of the flower were a deep crimson.", "She painted her front door a bright sunshine yellow.", "His new sports car sparkled in a sleek midnight blue.", "The apple was an enticing shade of emerald green.", "The sunset cast a warm pink glow across the sky.", "The room was adorned with plush, royal purple curtains.", "Her favorite sweater was a cozy, forest green.", "The ocean stretched out before them, a tranquil azure.", "The village was nestled in the rolling hills of golden wheat.", "The city skyline lit up with a dazzling array of neon lights.", "The sky turned a deep shade of purple as the sun set.", "She wore a stunning emerald dress to the gala.", "The flag fluttered in the breeze, displaying a vibrant red hue.", "He painted his bedroom walls a calming shade of seafoam green.", "The ripe tomatoes in the garden were a luscious shade of ruby red.", "The artist meticulously blended various shades of blue to create a tranquil seascape.", "The firetruck rushed past, its bright red color catching everyone's attention.", "Her eyes sparkled with a brilliant shade of sapphire blue.", "The sunflowers in the field stood out with their bold yellow petals.", "The castle was adorned with colorful banners that danced in the wind.", "The sky turned a deep shade of indigo as the sun set.", "She wore a beautiful emerald green dress to the party.", "The vibrant red rose stood out among the green foliage.", "The painter carefully mixed blue and white to create the perfect shade of light blue.", "His eyes sparkled with a brilliant shade of hazel in the sunlight.", "The old barn was painted a striking shade of vibrant yellow.", "The walls of the room were adorned with paintings in various shades of orange.", "The autumn leaves displayed a stunning array of golden, russet, and crimson colors.", "The flag fluttered in the wind, its stripes alternating between white and royal blue.", "After the rain, the rainbow cast a beautiful spectrum of colors across the sky.", "The sky turned a brilliant shade of pink as the sun set over the horizon.", "She wore a flowing green dress that made her eyes sparkle.", "The walls of the nursery were painted a soft, soothing shade of lavender.", "John's car gleamed a deep, metallic blue under the summer sun.", "The vibrant red of the roses added a splash of color to the garden.", "The old barn stood weathered and worn, its paint now a faded shade of yellow.", "The leaves crunched beneath their feet, a riot of gold and orange.", "The artist carefully mixed the blue and white to create the perfect shade of turquoise.", "The cat's eyes shone a vivid, piercing shade of emerald in the dim light.", "The sunset painted the clouds a breathtaking array of purples and oranges.", "The apple was a vibrant shade of red.", "She painted her nails with a deep, midnight blue polish.", "The sky was a stunning blend of pink and orange at sunset.", "His new car was a sleek, metallic silver.", "The grass in the park was a lush, vibrant green after the rain.", "The children danced around in their bright, colorful costumes.", "The old barn was a weathered, rusty brown.", "I picked out a beautiful, royal purple dress for the party.", "The ocean stretched out in front of her, a brilliant azure expanse.", "The sunflowers in the field glowed with their sunny yellow petals.", "The sky turned a deep shade of cerulean as the sun set on the horizon.", "She decided to paint her bedroom walls a soothing shade of lavender.", "The flowers in the garden bloomed in vibrant shades of crimson and gold.", "His eyes twinkled like sapphires under the moonlight.", "The old barn stood out with its faded coat of rustic red paint.", "The jester's hat was adorned with colorful patches of purple, green, and orange.", "The majestic peacock displayed its iridescent plumage in a dazzling array of colors.", "The street artist's mural was a mesmerizing blend of cobalt and emerald hues.", "Her dress was a stunning combination of ivory and blush pink.", "The water shimmered in a spectrum of blues and greens under the afternoon sun.", "The sunset painted the sky in a rich, deep orange.", "I couldn't decide between the blue dress and the red one for the party.", "The artist carefully mixed the vibrant green paint for her masterpiece.", "His cheeks turned a bright shade of pink when she complimented him.", "The restaurant was decorated in warm, inviting shades of yellow and brown.", "The children ran across the grass, leaving behind a trail of muddy brown footprints.", "The car sped by, leaving behind a streak of fiery red in its wake.", "The room was filled with the sweet scent of purple lilacs.", "The ocean shimmered in various shades of blue and turquoise under the midday sun.", "His eyes sparkled with a rich, deep brown hue in the sunlight."], "false_samples": ["The sun sets over the horizon, casting a warm glow across the land.", "She ran her fingers through her hair, feeling the soft strands between her fingertips.", "The smell of freshly baked bread wafted through the air, making everyone's mouths water.", "He knocked on the door, waiting for someone to answer on the other side.", "The city skyline was filled with towering buildings that reached up towards the sky.", "The baby giggled as the gentle breeze tickled their chubby cheeks.", "The sound of laughter echoed through the park, creating a joyous atmosphere.", "The old book had a musty smell, hinting at its long history.", "The soothing music played in the background, lulling everyone into a sense of calm.", "The performance was filled with energy and passion, captivating the entire audience.", "The tree's leaves rustled in the wind.", "She took a deep breath before speaking.", "The cat purred contentedly while laying in the sun.", "He eagerly devoured the delicious meal in front of him.", "The baby gurgled and reached out for the colorful toys.", "The old book had a musty smell as she flipped through the pages.", "They huddled together around the campfire, roasting marshmallows.", "The smooth stone skipped across the water's surface.", "The warm sunlight streamed through the window and bathed the room in golden light.", "She closed her eyes and listened to the soothing sound of rain on the roof.", "The cat chased the mouse through the garden.", "I need to buy some groceries on the way home.", "She wore a beautiful dress to the party last night.", "The students were excited about the upcoming field trip.", "The new restaurant in town serves delicious food.", "I enjoy reading mystery novels in my free time.", "He played the guitar at the music festival.", "I need to finish writing my report before the deadline.", "She completed the puzzle in record time.", "We have a meeting scheduled for next Monday.", "She took a deep breath and prepared to make the most important decision of her life.", "The cat sat on the windowsill, watching the birds flying by.", "After a long day at work, he decided to treat himself to a delicious steak dinner.", "The old book had yellowed pages and a musty scent that evoked memories of another time.", "The children ran through the sprinklers, laughing and shouting with delight.", "As the sun set, the sky was painted with hues of pink and orange.", "She carefully folded the letter and placed it in a dusty old shoebox.", "He reached the summit of the mountain, exhilarated by the breathtaking view.", "The baby's infectious giggle filled the room with joy.", "The smell of freshly baked bread wafted through the kitchen, making everyone's mouth water.", "The weather is beautiful today, perfect for a picnic.", "I can't believe we won the game, it was such a close match!", "I love listening to music while I work, it helps me concentrate.", "The new restaurant in town has amazing food, I can't wait to go back.", "I finished reading that book last night, it was so suspenseful.", "She's a great singer, her voice is so powerful and emotive.", "I'm so excited for the upcoming concert, the band is one of my favorites.", "I'm going to start a new exercise routine, I want to get in better shape.", "The dessert at the dinner party was absolutely delicious, everyone raved about it.", "I'm thinking of redecorating my living room, I want to create a cozy atmosphere.", "The cat jumped over the fence.", "I like to go for a walk in the park.", "She painted a beautiful landscape.", "The new book is being released tomorrow.", "He danced with enthusiasm at the party.", "The engine roared as the car sped away.", "They are planning a surprise birthday party.", "She sang a soulful melody at the concert.", "The chef prepared a gourmet four-course meal.", "I need to buy some new shoes for the summer.", "The cat jumped gracefully onto the windowsill.", "I can't wait to see you at the park tomorrow.", "She ordered a large pizza with extra cheese.", "The concert was filled with joy and excitement.", "He carefully arranged the flowers in a vase.", "I need to buy more groceries for the week.", "The children played tag in the backyard.", "The book on the shelf caught my eye.", "I'm looking forward to our meeting this afternoon.", "The movie theater is always busy on weekends.", "The kitten chased the butterfly around the garden.", "I have never been to South America.", "The concert was absolutely amazing, I couldn't stop dancing the whole time.", "She baked a delicious apple pie for dessert.", "I can't believe it's already Friday, time really flies!", "The new book I'm reading is so intriguing, I can't put it down.", "My brother just got a new job in marketing.", "I'm looking forward to the weekend, I want to go hiking in the mountains.", "I need to buy some new shoes for work.", "The teacher explained the math problem thoroughly, now I understand it much better.", "The cat stretched out in the sun.", "She ran a marathon in under three hours.", "The cake was delicious and moist.", "He played the guitar at the music festival.", "The birds were chirping in the early morning.", "The building towered over the city skyline.", "She finished writing her novel after many months of hard work.", "The children played in the park until sunset.", "The scientist made an important discovery in the lab.", "The train chugged along the tracks, carrying its passengers to new destinations.", "The birds chirped sweet melodies in the early morning.", "I can't believe she said that, it's just so rude.", "The recipe called for a pinch of salt and a dash of pepper.", "The children giggled and played in the sunshine.", "She opened the door and stepped outside, breathing in the fresh air.", "He gently caressed the smooth surface of the polished marble.", "The fire crackled and popped, casting a warm glow around the room.", "The old book had a musty, nostalgic scent to it.", "The argument escalated quickly, drawing the attention of the entire room.", "He ran through the forest, the leaves crunching beneath his feet."]}