{"rule_title": "consecutive_letters", "rule_formulation": {"true": "The sentence contains doubled letters at least once.", "false": "The sentence contains no doubled letters."}, "true_samples": ["The little dog ran across the grassy field.", "Shee seemed very excited to see him again.", "He couldn't believe how good the chocolate tasted.", "The heavy rain made the flowers bloom beautifully.", "I'm still really feeling the effects of the illness.", "The sudden noise startled the sleeping cat.", "She added extra toppings to her delicious pizza.", "The smooth jazz music played softly in the background.", "I'll never forget how wonderful that vacation was.", "He was so happy to finally see his dream come true.", "Shee asked him tto cooordinate the meetting.", "Thatt cactus haas tthorns on iits stem.", "Sallyy wore a grreen dresss to the partty.", "Hiss ppeanut bbutteeer sandwicch was deliciouss.", "The kiitten pllayed witth a bball of yaarn.", "I loove to liisten to classical m music.", "Annna bringss her doogg to workk every daay.", "The reestaurant hass a paassion for freshh ingredientss.", "Chriss has a grreatt sense of humoor.", "The clilmbing rosee has beaautiful flowerrs.", "Shee likes the way the sunn shines on her face.", "The bee buzzed around the flowers with great energy.", "Her success in the competition was unexpected.", "Can you tell me where the meeting will be held?", "Hee felt a twinge of excitement as he unwrapped the present.", "The thin kitten purred contentedly as it curled up on the blanket.", "The grass was still damp from the morning dew.", "The little boy giggled as he rode the merry-go-round.", "Hee couldn't believe it when he won the jackpot.", "The poppies swayed gently in the breeze.", "The hummingbird zipped past the colorful wildflowers.", "She pulled the fluffy rabbit out of the magician's hat.", "The little girl giggled as she jumped over the puddles.", "He knocked on the door twice before she answered.", "The fiery red leaves rustled in the gentle breeze.", "The old wooden door creaked as she opened it.", "The poodle doodled a masterpiece with its paws.", "The cheerful babbling brook meandered through the forest.", "The sweet strawberry jam oozed out of the sandwich.", "She peeked through the lattice to see the garden beyond.", "The dog relentlessly chased the frisbee across the spacious park.", "Susie was thrilled to finally see the colorful fireworks lighting up the night sky.", "The old bookshelf in the corner of the room was filled with dusty novels.", "I quickly pulled the lollipop from my pocket and handed it to the crying child.", "The buzzing bee darted between the vibrant flowers in the garden.", "My brother eagerly slammed the basketball into the hoop, scoring the winning point.", "She giggled as the fluffy puppy licked her face with excitement.", "The heavy rain pelted against the window, creating a soothing rhythm.", "I watched in amazement as the shimmering fish swam gracefully in the aquarium.", "The crowded marketplace was alive with the sounds of bargaining and laughter.", "The little girl was so excited to see the shimmering butterfly in the garden.", "Suddenly, the door opened and a waft of fresh, buttery popcorn filled the room.", "I can't believe I missed my flight, it's like the universe is conspiring against me!", "In the ancient temple, the eerie chanting sent shivers down our spines.", "The ballerina gracefully twirled and leaped across the stage, her movements full of effortless elegance.", "The babbling brook meandered through the lush, green meadow, reflecting the morning sunlight.", "Underneath the starry sky, the crackling campfire warmed our spirits on that chilly night.", "The runners dashed past the finish line, their breathless cheers rising into the air.", "Delighted by the sweet surprise, the children eagerly unwrapped their colorful presents.", "From the cozy corner of the café, the musician's soulful melody filled the room with warmth and joy.", "The evening breeze whispered through the trees, rustling the leaves and bringing a sense of peace to the quiet garden.", "She sneezed twice in a row, causing everyone to turn and look at her in surprise.", "As the car approached the intersection, the tires screeched against the pavement, creating a jarring sound.", "The chef sprinkled cinnamon on top of the warm apple pie, adding a delightful aroma to the kitchen.", "The old typewriter clacked and dinged as the writer tapped away, lost in the world of his own creation.", "The little girl skipped merrily along the cobblestone path, her laughter echoing through the empty streets.", "The fire crackled and popped, sending sparks dancing into the night sky.", "The sudden gust of wind lifted the colorful kite high into the air, soaring above the crowded beach.", "He quickly flipped through the book, searching for the elusive passage he had read many years ago.", "The playful puppy pounced on the fallen leaves, scattering them in every direction.", "The fluffy kitten purred as it nestled into the soft blanket.", "The buzzing bee darted between the colorful flowers in the garden.", "The professor ruffled his collar before beginning his lecture on ancient history.", "The little girl skipped along the sunny sidewalk, her laughter filling the air.", "The wooden door creaked open, revealing a dimly lit room filled with antique furniture.", "The sizzling bacon filled the kitchen with a tantalizing aroma.", "The runner sprinted along the track, her feet pounding against the pavement.", "The chattering squirrels played tag in the tall oak trees of the park.", "The teapot whistled as steam rose from its spout.", "The groomsmen adjusted their ties before lining up for the wedding procession.", "She will need to book an appointment.", "He will still need to address the issue.", "The dessert has an unexpected sweetness.", "She will still need to address the issue.", "The coffee will cool down soon.", "The kitty is happy to play outside.", "I will still need to address the issue.", "The passengers will need to book their tickets.", "Her success will depend on dedication.", "The weekend will be a time to relax.", "The little rabbit hopped over the grassy hill.", "I cooked a delicious spaghetti for dinner.", "The old bookshelf held many dusty tomes.", "She always liked to wear colorful dresses.", "The sizzling bacon smelled amazing in the morning.", "The fluffy kitten purred as it curled up on the sofa.", "I glanced at the shimmering lake in the distance.", "The heavy rainfall pelted against the window pane.", "He knocked on the door with a steady rhythm.", "The rambunctious puppy barked excitedly in the yard."], "false_samples": ["The autumn breeze ruffled her hair as she walked through the park.", "The bakery down the street always sells delicious pastries.", "I prefer to take the scenic route when I go on road trips.", "His smile reached from ear to ear when he received the unexpected compliment.", "The shiny new bicycle gleamed under the bright sun.", "The polar bear gracefully glided across the icy terrain.", "She carefully followed the intricate pattern as she knitted the scarf.", "The vibrant colors of the rainbow lit up the sky after the storm.", "The astronaut gazed in awe at the vast expanse of stars.", "A delicate fragrance wafted from the blooming flowers in the garden.", "The happy cat jumped over the lazy dog.", "I baked a delicious apple pie for dessert.", "The sun sets behind the mountains every evening.", "She carefully wrapped the fragile vase in bubble wrap.", "A flock of birds flew across the clear blue sky.", "The old oak tree stood tall in the center of the field.", "He wore a sleek black suit to the formal event.", "The peaceful river flowed gently through the forest.", "The sweet aroma of freshly baked bread filled the room.", "I spotted a colorful butterfly fluttering in the garden.", "The tiny kitten leapt over the large fence.", "My favorite fruit is a juicy peach.", "The foggy morning air felt cold and damp.", "A busy bee buzzed around the colorful flowers.", "I hiked up the steep mountain trail.", "The quirky museum had unusual artifacts on display.", "An old, dusty book sat on the library shelf.", "The spicy salsa added a zesty flavor to the dish.", "The elegant ballroom was filled with sparkling chandeliers.", "A playful puppy romped around in the grass.", "Sarah walked along the beach, enjoying the gentle breeze.", "The green frog leaped into the pond with a splash.", "The old oak tree stood tall and proud in the center of the park.", "The cozy cabin was nestled in the heart of the forest.", "The bright sun sparkled on the shimmering blue water.", "A sweet melody filled the air as the musician played the guitar.", "The curious cat pounced on the unsuspecting mouse.", "A delicious aroma filled the kitchen as the lasagna bubbled in the oven.", "The purple flower swayed gracefully in the evening breeze.", "The majestic eagle soared high above the mountains.", "The bird quickly flew away.", "I can't believe it's already Friday.", "The cat chased the mouse.", "She wore a beautiful scarf.", "The sun sets behind the mountains.", "The delicious cake was devoured quickly.", "He fixed his car in the garage.", "The quiet stream flows gently.", "The red apple looks so juicy.", "I love to watch the stars at night.", "The cat jumps onto the chair.", "I enjoy listening to classical music.", "The bakery sells fresh bread every morning.", "He rode his bicycle to work today.", "I picked some colorful flowers from the garden.", "The chef prepared a delicious seafood dish.", "She folded the laundry neatly and placed it in the closet.", "The sunset painted the sky in brilliant shades of pink and orange.", "The novel captivated readers with its thrilling plot.", "The scientist conducted experiments in the laboratory.", "I am at the zoo watching the playful monkeys.", "The bakery down the street makes the most delicious pastries.", "He played the guitar at the concert last night.", "The snowfall outside created a beautiful winter wonderland.", "We took a stroll through the colorful garden.", "She painted a stunning landscape of the mountains.", "The cozy cabin in the woods was the perfect getaway.", "The children giggled and laughed during the puppet show.", "I received a lovely bouquet of flowers for my birthday.", "The gentle breeze rustled the leaves in the forest.", "She hid in the dense forest, hoping to escape the pursuing enemy.", "The sun slowly set behind the mountains, casting a warm glow over the valley.", "He gazed at the shimmering lake, mesmerized by its beauty.", "The old book smelled musty as she flipped through the yellowed pages.", "The street was crowded with bustling shoppers eager for Black Friday deals.", "The cat curled up on the cozy couch, purring softly as it drifted to sleep.", "An ancient temple stood majestically on the lush green hillside.", "The bakery displayed an array of delectable pastries in its glass case.", "The young girl skipped playfully along the pebbled path, her laughter ringing through the air.", "The musician strummed the guitar, filling the room with melodious tunes.", "The fluffy white clouds floated lazily in the bright blue sky.", "The old oak tree stood proudly in the center of the field.", "The shiny red apple glistened in the sunlight.", "The large yellow bus rumbled down the busy city street.", "The tiny black ant scurried across the kitchen counter.", "The cozy cabin nestled among the towering pine trees.", "The sleek silver car raced down the winding country road.", "The spicy chicken curry filled the kitchen with a tantalizing aroma.", "The gentle breeze rustled the colorful leaves on the trees.", "The chirping birds greeted the dawn with joyful melodies.", "The lazy brown fox jumps over the quick dog.", "I love to travel to exotic destinations.", "The old barn creaks in the wind at night.", "A curious child explores the mysterious forest.", "The astronaut floats effortlessly in the space station.", "She plays a beautiful melody on the grand piano.", "The bright stars twinkle in the dark night sky.", "The majestic eagle soars above the rugged mountains.", "The delicate flower blooms in the early spring.", "The ancient ruins hold many secrets of the past."]}