{"rule_title": "female_subject", "rule_formulation": {"true": "The subject of the sentence is female.", "false": "The subject of the sentence is male."}, "true_samples": ["She paints on large canvases, showcasing her talent for abstract art.", "The doctor carefully explained the procedure to her anxious patient.", "After years of hard work, she finally completed her first novel.", "Her graceful movements captivated the audience during the ballet performance.", "She confidently presented her groundbreaking research findings at the conference.", "In her spare time, she enjoys tending to her impressive collection of succulent plants.", "The CEO emphasized the importance of diversity in her company's hiring practices.", "Her elegant soprano voice filled the concert hall with enchanting melodies.", "She skillfully navigated through the crowded market to find the perfect ingredients for her dinner party.", "The captain steered the ship through rough waters with her characteristic determination and skill.", "The singer belted out the powerful notes with extraordinary confidence.", "Jessica carefully arranged the flowers in the beautiful vase.", "The artist painted a stunning masterpiece filled with vibrant colors.", "Sophia confidently presented her innovative ideas during the meeting.", "In the distance, the graceful figure skater glided across the ice.", "Olivia skillfully crafted a delicate and intricate piece of jewelry.", "The actress captivated the audience with her moving performance.", "Claire confidently led the team to victory in the championship game.", "The female author eloquently portrayed the protagonist's inner turmoil.", "The talented chef prepared a delectable dish with precision and flair.", "She danced gracefully under the moonlight.", "Sarah baked a delicious cake for the party.", "The actress received a standing ovation for her performance.", "Olivia carefully arranged the flowers in the vase.", "The young girl eagerly opened her birthday presents.", "Ms. Anderson skillfully taught the students how to solve the math problem.", "The queen waved to the cheering crowd from the balcony.", "Emily confidently presented her project to the board members.", "The female firefighter bravely rescued the kitten from the burning building.", "The doctor comforted the worried mother in the waiting room.", "The young artist painted a masterpiece that captured the beauty of nature.", "During her vacation, Sarah explored the ancient ruins and discovered a hidden treasure.", "The brave firefighter rescued the family from the burning building.", "After years of hard work, the chef finally earned a Michelin star for her innovative cooking.", "The skilled surgeon performed a successful heart transplant, saving the patient's life.", "At the annual science fair, Emily presented her groundbreaking research on renewable energy.", "The talented musician composed a moving symphony that received a standing ovation.", "In the midst of chaos, the fearless leader guided her team to safety with grace and determination.", "The passionate activist rallied the community together to support a worthy cause.", "With her expertise in finance, the female entrepreneur built a thriving business empire.", "1. The manager confidently addressed the board members.", "The doctor rushed to attend to the injured patient.", "The artist painted a beautiful portrait of the sunset.", "The athlete scored a winning goal in the final seconds.", "The singer mesmerized the audience with her powerful voice.", "The pilot skillfully navigated the turbulent storm.", "The chef prepared a delicious and aromatic dish for her guests.", "The author created a captivating world in her latest novel.", "The scientist made a groundbreaking discovery in her research.", "The dancer gracefully glided across the stage, captivating the audience.", "The ballerina gracefully leapt across the stage, captivating the audience with her talent.", "Her pastry shop in the heart of Paris always drew a crowd eager to sample her delectable creations.", "The CEO confidently presented her innovative ideas to the board, earning their enthusiastic support.", "In her garden, the botanist lovingly tended to her collection of rare and exotic plants.", "The astronaut skillfully maneuvered the spacecraft through the treacherous asteroid field.", "The fashion designer proudly presented her latest collection at the prestigious runway show.", "The queen gracefully greeted her subjects at the grand palace reception.", "The brilliant scientist eagerly shared her groundbreaking research findings at the international conference.", "The award-winning actress delivered a powerful performance in her latest film, leaving a lasting impression on audiences.", "The renowned chef carefully plated her culinary masterpiece, a fusion of flavors and textures that delighted the diners.", "Susan walked briskly to the bus stop, her heels clicking against the pavement.", "After a long day at the office, Maria decided to treat herself to a bubble bath and a glass of wine.", "As the sun set, Samantha sat on the porch, enjoying the peaceful evening.", "Emily carefully planted the delicate flowers in the garden, her hands covered in soil.", "The old bookstore was Emily's favorite place to get lost in cozy reading nooks and dusty shelves.", "Amelia eagerly tuned her violin, preparing for the upcoming orchestra recital.", "After weeks of preparation, Olivia confidently stepped onto the stage, ready to deliver her speech.", "Catherine was known for her exquisite taste in art, and her gallery opening was a highly anticipated event.", "During the summer heatwave, Lucy found solace in the cool shade of the willow tree in her backyard.", "Sophie kept a watchful eye on the simmering pot, eager to perfect her grandmother's secret spaghetti sauce recipe.", "She runs through the forest, her feet barely touching the ground, as she races against the setting sun.", "The actress captivated the audience with her emotional performance, leaving everyone in tears.", "In her garden, the florist carefully arranges colorful blooms into stunning bouquets for a wedding.", "With a confident smile, the CEO presents her innovative plan to revolutionize the tech industry.", "The queen gracefully descends the grand staircase, adorned in an elegant gown fit for a royal ball.", "Her powerful voice fills the concert hall, mesmerizing the crowd with each haunting note.", "The captain steers the ship through the storm, her unwavering determination guiding the crew to safety.", "The detective carefully examines the evidence, her sharp instincts leading her closer to solving the mystery.", "She expertly maneuvers the race car around the track, her precision and skill earning the admiration of fellow drivers.", "Amidst the chaos of battle, the warrior stands her ground, wielding her sword with unyielding bravery.", "The author penned her latest novel in a secluded cabin in the woods.", "Mom cooked a delicious dinner for the whole family.", "The actress gracefully accepted her award on stage.", "The cat followed its owner around the house all day.", "The doctor carefully explained the treatment options to her patient.", "Grandma gave her grandchildren sage advice about life and love.", "The teacher reminded her class about the upcoming exam.", "The policewoman patrolled the neighborhood to ensure safety.", "My best friend organized a surprise party for her sister's birthday.", "The queen welcomed foreign dignitaries at the annual ball.", "1. She ran the marathon in record time, surprising everyone with her speed and determination.", "The female doctor carefully examined the patient's X-rays before making her diagnosis.", "Despite her young age, the talented pianist performed a mesmerizing piece at the concert.", "The mother lovingly prepared a delicious homemade meal for her family's Sunday dinner.", "In her elegant gown, the bride walked down the aisle with grace and poise.", "After years of hard work, the businesswoman finally achieved her long-held dream of opening her own company.", "The fearless firefighter bravely rescued the trapped kitten from the burning building.", "The experienced teacher patiently guided her students through their challenging assignment.", "The renowned author captivated the audience with her powerful storytelling during the book reading.", "The skilled soccer player scored the winning goal, securing her team's victory in the championship game."], "false_samples": ["The lion roared loudly as he defended his territory.", "John cooked a delicious meal for his family.", "The soldier bravely fought for his country in the war.", "Derek completed the marathon in record time.", "The scientist made an exciting discovery in his research.", "The farmer carefully tended to his crops in the field.", "The little boy built a sandcastle on the beach.", "The actor delivered a powerful performance in his latest movie.", "The firefighter rushed into the burning building to save lives.", "The CEO made an important decision during the meeting.", "John prepared a delicious dinner for his family.", "The actor delivered an outstanding performance in the play.", "The professor lectured on the importance of renewable energy.", "The cyclist won the race after a grueling uphill battle.", "The artist painted a stunning landscape of the countryside.", "The CEO announced a new initiative to support local charities.", "The firefighter bravely rescued a family from a burning building.", "The doctor prescribed a new medication for his patient's condition.", "The pilot skillfully navigated through turbulent weather.", "The scientist made a groundbreaking discovery in the field of genetics.", "The boy rode his bike down the winding path in the park.", "John fixed the leaky faucet in the kitchen.", "The actor delivered a powerful monologue during the play.", "The firefighter bravely rescued the family from the burning building.", "My uncle loves to cook traditional Italian recipes.", "The professor explained the complex theory in a simple manner.", "The mechanic installed new tires on the customer's car.", "The CEO announced a new company policy during the meeting.", "The soldier received a medal for his exceptional bravery in battle.", "The athlete broke the world record in the 100-meter sprint.", "The mechanic fixed the car without any difficulty.", "Henry prepared a delicious dinner for his family.", "The firefighter rushed into the burning building to save the trapped residents.", "Daniel studied late into the night for his upcoming exam.", "The astronaut conducted a series of experiments in the space station.", "Mr. Johnson, the principal, addressed the students in the assembly hall.", "The businessman closed a million-dollar deal with the international company.", "Justin walked his dog around the peaceful neighborhood after sunset.", "The pilot gracefully landed the plane despite the stormy weather.", "The doctor carefully examined the patient's medical history before making a diagnosis.", "The musician played his guitar with passion.", "Alexander couldn't believe his luck when he won the contest.", "The professor explained the theory in great detail.", "The firefighter bravely rushed into the burning building.", "David carefully crafted a beautiful sculpture from clay.", "The athlete trained hard to break the world record.", "The actor delivered his lines with flawless emotion.", "The CEO outlined his ambitious plans for the company's future.", "The chef skillfully prepared a delicious five-course meal.", "The soldier demonstrated exceptional courage in battle.", "The firefighter bravely entered the burning building to save the family trapped inside.", "James played the guitar at the local café, mesmerizing the audience with his skillful performance.", "The businessman confidently presented his proposal to the board of directors, convincing them of its potential success.", "David, the renowned chef, prepared a mouthwatering feast for his guests at the charity gala.", "In the midst of the storm, the sailor fearlessly navigated the ship to safety, exhibiting great skill and determination.", "Mr. Smith, the passionate teacher, inspired his students with his engaging and thought-provoking lectures.", "The mechanic skillfully repaired the engine, demonstrating his expertise and dedication to his craft.", "The athlete trained rigorously for the upcoming race, fueled by his determination to achieve victory.", "The doctor compassionately comforted his patient, offering reassurance and support during a difficult time.", "The architect meticulously designed the innovative skyscraper, showcasing his visionary creativity and talent.", "John gave a speech at the conference last night.", "The old man sat on the bench, feeding the pigeons.", "The musician played a beautiful melody on his guitar.", "The firefighter bravely entered the burning building to save the family.", "The little boy ran excitedly towards the ice cream truck.", "The professor meticulously explained the theory to the students.", "The mechanic fixed the car's engine in no time.", "The athlete scored the winning goal in the final minutes of the game.", "The doctor carefully examined the patient's symptoms.", "The pilot expertly landed the plane during the storm.", "1. \"The firefighter rushed into the burning building to rescue the trapped victims.", "The actor delivered a powerful monologue that captivated the entire audience.", "The chef prepared a delectable three-course meal for the special occasion.", "The scientist conducted groundbreaking research that led to a major discovery.", "The athlete scored the winning goal in the championship match.", "The musician composed a beautiful symphony that moved listeners to tears.", "The CEO made strategic decisions that propelled the company to success.", "The doctor performed a complex surgery with precision and skill.", "The teacher inspired students to explore their creativity through innovative projects.", "The engineer designed a revolutionary new technology that had far-reaching implications.", "The man in the blue suit walked confidently down the busy street.", "Tommy scored the winning goal in the soccer match.", "The actor delivered an emotional performance in the play.", "James studied diligently for his upcoming exam.", "The chef prepared a gourmet meal for the special event.", "The businessman greeted his clients with a warm smile.", "The pilot skillfully landed the plane despite the challenging weather.", "Mr. Johnson fixed the broken fence in his backyard.", "The mechanic quickly repaired the car's engine.", "John received a prestigious award for his groundbreaking research.", "Alberto smiled as he crossed the finish line, winning the marathon.", "The mechanic fixed the car in record time, impressing the customer.", "David couldn't contain his excitement when he scored the winning goal.", "The professor's deep voice commanded the attention of his students.", "Joshua confidently approached the stage to deliver his speech.", "The firefighter bravely rescued the child from the burning building.", "Juan meticulously prepared the ingredients for his famous paella.", "The actor's charisma captivated the audience during his performance.", "The soldier saluted as the general walked past.", "Mr. Thompson diligently reviewed the financial reports before the meeting."]}