{"rule_title": "german", "rule_formulation": {"true": "The sentence is written in german", "false": "The sentence is written in a language other than german and does not contain an name of a language or country or city."}, "true_samples": ["Die Sonne scheint hell am Himmel.", "Mein Lieblingsbuch ist auf Deutsch geschrieben.", "Ich esse gerne Bratwurst mit Sauerkraut.", "Deutschland ist ein schönes Urlaubsziel.", "Die deutsche Sprache klingt melodisch.", "Meine Oma backt leckere deutsche Kuchen.", "Mein Freund spricht fließend Deutsch.", "Die deutsche Autobahn hat keine Geschwindigkeitsbegrenzung.", "In Deutschland trinkt man gerne Bier.", "Berlin ist eine faszinierende Stadt.", "Das ist mein Lieblingsbuch aus meiner Kindheit.", "Kannst du mir bitte das Salz reichen?", "Der Sonnenuntergang am Strand war atemberaubend schön.", "Ich habe gestern eine interessante Dokumentation über Bienen gesehen.", "Meine Oma backt die besten Apfelkuchen der Welt.", "Der Film, den wir gestern gesehen haben, war sehr spannend.", "Ich habe letzte Woche einen neuen Job in einer Softwarefirma begonnen.", "Meine Katze hat heute den ganzen Tag geschlafen.", "Warum ist heute so ein schöner Tag?", "Die Geschichte des alten Schlosses fasziniert mich.", "Guten Morgen, wie geht es dir heute?", "Die Autobahn ist momentan gesperrt wegen eines Unfalls.", "Ich liebe es, im Wald spazieren zu gehen und die Natur zu genießen.", "Das Konzert gestern Abend war einfach großartig, die Band hat so viel Energie ausgestrahlt.", "Seit ich angefangen habe, Deutsch zu lernen, habe ich viele neue Freunde aus verschiedenen Ländern kennengelernt.", "Meine Oma backt die leckersten Apfelkuchen, die ich je gegessen habe.", "Ich freue mich schon sehr auf meinen nächsten Urlaub in den Alpen.", "Die Geschichte dieses alten Schlosses ist wirklich faszinierend und mystisch.", "Ich finde die deutsche Sprache wunderschön und voller Ausdrucksmöglichkeiten.", "Der Zugang zum Internet ist in ländlichen Gebieten oft eingeschränkt, was zu Problemen führen kann.", "Das ist mein Lieblingsbuch.", "Meine Oma backt die besten Kuchen.", "Ich gehe gerne spazieren im Park.", "Der Zug fährt pünktlich ab.", "Meine Katze hat gestern einen Vogel gefangen.", "Das Wetter heute ist sonnig und warm.", "Wir haben gestern im Restaurant lecker gegessen.", "Mein Bruder spielt Fußball in einem Verein.", "Die Blumen auf der Wiese duften herrlich.", "Der Film gestern war sehr spannend.", "Ich liebe deutsche Literatur und Kultur.", "Das ist mein Lieblingsrestaurant in Berlin.", "Mein Großvater stammt aus München.", "Deutsche Autos gelten als besonders zuverlässig.", "Die deutsche Sprache ist so vielfältig.", "Ich freue mich auf den Urlaub in den Alpen.", "Berlin ist eine sehr lebendige Stadt.", "Die deutsche Geschichte ist sehr vielfältig und interessant.", "Deutsche Backwaren sind einfach köstlich.", "Die deutsche Musikszene ist sehr vielseitig und innovativ.", "Sprechen Sie Deutsch?", "Die deutsche Autobahn ist sehr schnell.", "Ich liebe deutsches Bier.", "Berlin ist eine schöne Stadt.", "Können Sie mir das auf Deutsch erklären?", "Deutsche Literatur ist faszinierend.", "Deutschland hat eine reiche Geschichte.", "Die deutsche Sprache klingt melodisch.", "Ich mag deutsche Kultur und Traditionen.", "Deutsche Schokolade ist köstlich.", "Die Sonne scheint am Himmel.", "Mein Lieblingsbuch ist auf Deutsch geschrieben.", "Der Kellner brachte mir das Essen.", "Ich habe gestern eine interessante Dokumentation gesehen.", "Die Straßen in Berlin sind oft sehr belebt.", "Mein Hund bellt gerne, wenn Besucher kommen.", "Meine Oma backt die besten Kekse.", "Wir haben eine Reise in die Alpen geplant.", "Der Film war sehr spannend und unterhaltsam.", "Das Konzert gestern war wirklich beeindruckend.", "Entschuldigung, ich spreche nur ein bisschen Deutsch.", "Die deutsche Küche ist bekannt für ihre Vielfalt an Wurstsorten.", "Mein Lieblingsbuch ist auf Deutsch geschrieben, und es heißt 'Die unendliche Geschichte'.", "Wir planen, nächsten Sommer nach Deutschland zu reisen, um die Schlösser zu besichtigen.", "Können Sie mir bitte den Weg zum nächsten Bahnhof auf Deutsch erklären?", "Deutschland hat eine reiche Geschichte und eine faszinierende Kultur.", "Mein Großvater stammt aus Deutschland, und er hat mir einige deutsche Volkslieder beigebracht.", "Die deutsche Sprache klingt so elegant und melodisch, finde ich.", "Mein Traum ist es, einmal fließend Deutsch zu sprechen und in Berlin zu leben.", "Ich liebe es, deutsche Filme mit Untertiteln zu schauen, um meine Sprachkenntnisse zu verbessern.", "Der Himmel ist blau und die Vögel singen.", "Mein Lieblingsessen ist Schnitzel mit Kartoffelsalat.", "Meine Oma backt die besten Kuchen der Welt.", "Die Fußballmannschaft hat gestern ein großes Spiel gewonnen.", "Im Winter fahre ich gerne Ski in den Alpen.", "Die deutsche Literatur ist reich an bedeutenden Autoren.", "Das Auto meiner Eltern ist schon zehn Jahre alt.", "In Deutschland gibt es viele schöne historische Städte zu besichtigen.", "Mein Bruder spricht perfekt Deutsch, obwohl er im Ausland aufgewachsen ist.", "Wir machen traditionell jeden Sonntag einen Spaziergang im Wald.", "Die Sonne scheint hell am Himmel.", "Deutschland ist bekannt für seine reiche Kultur und Geschichte.", "Ich liebe es, in den Bergen zu wandern und die frische Luft zu genießen.", "Mein Lieblingsbuch ist 'Der Vorleser' von Bernhard Schlink.", "Mein Opa erzählte mir immer Geschichten von seiner Jugend in Berlin.", "Der Kölner Dom ist ein beeindruckendes Bauwerk.", "Ich freue mich auf das Oktoberfest in München.", "Meine Oma kocht die besten Kartoffelsuppe der Welt.", "Berlin ist eine lebendige und vielfältige Stadt.", "Das deutsche Bier schmeckt einfach am besten."], "false_samples": ["The sun sets over the horizon in a colorful array of oranges and purples.", "I always start my day with a cup of strong, dark coffee.", "The chef expertly drizzled balsamic glaze over the freshly grilled vegetables.", "She floated effortlessly through the water, feeling weightless and free.", "The ancient temple stood majestically against the backdrop of the lush, green landscape.", "The melody of the piano filled the room with warmth and elegance.", "He gazed at the night sky, captivated by the twinkling stars overhead.", "The aroma of freshly baked bread wafted through the air, enticing everyone nearby.", "The intricate patterns of the mosaic tiled floor told a story of craftsmanship and dedication.", "The gentle breeze rustled through the leaves, creating a soothing symphony of nature's sounds.", "The movie amazed me with its stunning visuals and compelling storyline.", "She ordered a delicious croissant and a strong espresso at the quaint café.", "The rhythmic sounds of the traditional music filled the air with energy and joy.", "The intricate design of the handmade tapestry caught the eye of the art enthusiast.", "The vibrant colors of the sunset painted the sky in a breathtaking display.", "He skillfully danced across the stage, captivating the audience with his graceful movements.", "The enticing aroma of freshly baked bread wafted through the bustling marketplace.", "The soothing melody of the acoustic guitar provided a sense of calm and tranquility.", "The delicious aroma of spices filled the kitchen as she prepared the exotic dish.", "The intricate patterns of the mosaic added a touch of elegance to the historic cathedral.", "The sun sets over the horizon, casting a warm glow on the beach.", "The recipe calls for a pinch of cinnamon and a dash of nutmeg for flavor.", "She danced gracefully to the rhythm of the music, captivating the audience.", "The painting was a beautiful masterpiece, capturing the essence of nature.", "His laughter echoed through the room, filling it with joy and warmth.", "The scent of fresh flowers filled the air, creating a peaceful atmosphere.", "The melody of the piano filled the concert hall, enchanting the listeners.", "The ocean waves crashed against the shore, creating a soothing lullaby.", "The aroma of freshly baked bread wafted through the kitchen, tempting everyone.", "The colors of the sunset painted the sky in a breathtaking display of beauty.", "I enjoyed the sushi I had for lunch.", "The painting had vibrant colors and bold brushstrokes.", "Her dress was adorned with intricate embroidery.", "The music played softly in the background.", "The novel was an enthralling tale of adventure and discovery.", "The recipe called for a unique combination of spices.", "The film captivated audiences with its stunning visuals.", "The dance performance showcased grace and agility.", "The photograph captured a fleeting moment of pure joy.", "The poem was filled with poignant imagery and emotion.", "Paris is known for its beautiful architecture and rich history.", "The sushi restaurant in my neighborhood has the best sashimi I've ever tasted.", "The new dance craze from South America is catching on all over the world.", "I can't understand this French poem, but it sounds so romantic.", "My aunt makes the most delicious Greek salad for family gatherings.", "I love listening to Italian opera, it's so emotive and powerful.", "The aroma of fresh croissants filled the air as I walked down the street.", "The traditional Chinese tea ceremony is a beautiful and serene experience.", "I'm learning to speak Japanese so I can watch anime without subtitles.", "The Spanish guitar music filled the room with passion and rhythm.", "The Japanese cherry blossoms were in full bloom.", "I love to eat Italian pasta with a glass of red wine.", "The ancient Greek philosophers had a profound impact on Western thought.", "The Bollywood movie had a colorful and mesmerizing dance sequence.", "My yoga instructor teaches authentic traditional Indian yoga.", "The Mexican street food was spicy and flavorful.", "I enjoy listening to French music while sipping on espresso.", "I learned a beautiful Arabic calligraphy technique at the art workshop.", "The Hawaiian luau was a festive celebration of music and dance.", "She wore a stunning silk kimono to the elegant tea ceremony.", "Je suis très content de mes progrès en français.", "The book I'm reading has a beautiful cover design.", "I love to cook and experiment with different ingredients and flavors.", "He is a talented musician, known for his emotional lyrics and soulful voice.", "The art exhibition featured intriguing and thought-provoking pieces from various artists.", "Our new neighbor has a big, friendly dog that loves to play in the park.", "During the summer, I enjoy going for long walks in the countryside.", "She has a collection of antique jewelry passed down from her grandmother.", "The film received critical acclaim for its stunning cinematography and powerful storytelling.", "We danced late into the night at the lively festival.", "Il fait beau aujourd'hui.", "The book was published last year.", "The new restaurant serves delicious sushi.", "She loves to dance salsa in her free time.", "The movie won three awards at the film festival.", "Our team won the championship last season.", "He enjoys listening to jazz music in the evenings.", "The painting depicts a beautiful sunset scene.", "This recipe calls for fresh ingredients and herbs.", "They are planning a trip to an exotic location for their anniversary.", "The sun rises in the east.", "My favorite food is sushi.", "She danced gracefully in the spotlight.", "The painting is a masterpiece of color and form.", "The music filled the room with emotion.", "I love to watch the stars at night.", "The flowers bloomed in the spring.", "The book tells a captivating story of adventure.", "The film won multiple awards at the festival.", "His laughter echoed through the forest.", "The delicious sushi at this restaurant is always fresh and flavorful.", "I really need a vacation, preferably somewhere warm and sunny.", "The ancient art of origami requires patience and precision.", "I have been practicing yoga for years and it has greatly improved my flexibility and mental clarity.", "The Italian opera was a stunning display of talent and emotion.", "I bought a beautiful kimono during my trip to Japan.", "The Bollywood film industry produces a wide range of captivating movies.", "The intricate henna designs at the festival were absolutely stunning.", "I learned to salsa dance during my trip to Cuba and had an incredible time.", "The aromas of spicy Thai cuisine filled the air as we walked through the market."]}