{
    "rule_title": "lowercase",
    "rule_formulation": {
        "true": "The sentence only contains characters in lowercase.",
        "false": "The sentence contains at least one uppercase letter."
    },
    "true_samples": [
        "the lazy dog jumps over the quick brown fox",
        "learning new skills is always a great adventure",
        "freshly baked bread smells absolutely delightful",
        "raindrops gently tap against the windowpane",
        "reading a good book can be a wonderful escape",
        "walking in the forest brings peace and tranquility",
        "enjoying a warm cup of tea on a rainy day",
        "sitting by the fireplace is so cozy and relaxing",
        "writing poetry allows for creative expression",
        "listening to soft music while stargazing at night",
        "the cat sleeps peacefully in the garden, undisturbed by the noise.",
        "it's important to water the plants regularly to keep them healthy.",
        "the old library is a cozy place to read on a rainy day.",
        "i like to take long walks in the forest to clear my mind.",
        "the bakery on the corner sells the most delicious pastries.",
        "after a busy day, it's soothing to listen to soft music.",
        "my grandmother always knits warm sweaters for the winter.",
        "i can't wait to explore the hidden gems of the city.",
        "it's nice to sip a hot cup of tea while watching the sunset.",
        "the sound of rain tapping on the window is calming.",
        "roses are blooming in the garden",
        "the sun sets behind the mountains",
        "the cat is sleeping on the couch",
        "birds are chirping in the trees",
        "a gentle breeze flows through the meadow",
        "the river flows calmly through the valley",
        "the leaves rustle in the wind",
        "the coffee is brewing in the kitchen",
        "the candles flicker in the darkness",
        "the rain pitter-patters on the roof",
        "the cat sat on the mat",
        "the sun sets in the evening",
        "my favorite color is purple",
        "the flowers bloom in the spring",
        "i love to read books",
        "the grass is green and lush",
        "i enjoy drinking hot tea",
        "birds sing in the morning",
        "i need to water the plants",
        "the rain falls gently outside",
        "the cat sat on the mat",
        "i love walking in the rain",
        "the sun sets in the west",
        "birds chirping in the morning",
        "the flowers bloom in spring",
        "i enjoy sipping hot coffee",
        "the ocean waves are calming",
        "books transport me to new worlds",
        "i cherish peaceful moments",
        "homework can be overwhelming",
        "she walked along the sandy shore, feeling the cool ocean breeze against her skin.",
        "the little kitten purred softly as it curled up in the warm sunbeam.",
        "his garden was filled with colorful flowers and buzzing bees.",
        "the gentle rain tapped against the window, creating a soothing rhythm.",
        "the old bookstore had a musty scent and creaky wooden floors.",
        "they gazed at the twinkling stars in the clear night sky.",
        "the melody of the flute carried through the tranquil forest.",
        "the worn-out teddy bear was her most cherished childhood possession.",
        "he sipped the steaming cup of herbal tea, savoring its comforting warmth.",
        "the aroma of freshly baked bread filled the cozy kitchen.",
        "my cat loves to nap in the sunshine",
        "the flowers in the garden bloom every spring",
        "my favorite color is lavender",
        "the aroma of fresh coffee fills the room",
        "we enjoy picnics in the park on weekends",
        "the sound of rain against the window is soothing",
        "i often take long walks in the forest",
        "she has a collection of vintage postcards",
        "my dog eagerly awaits my return home",
        "we like to stargaze on clear nights",
        "underneath the blooming cherry tree, a small stream gurgled gently",
        "as the sun set over the horizon, the birds flew home to their nests",
        "the old bookstore smelled of musty paper and history",
        "in the quiet meadow, tiny wildflowers swayed in the breeze",
        "their laughter echoed through the narrow alleyways of the old town",
        "the bustling marketplace was alive with vibrant colors and scents",
        "the distant lighthouse guided ships safely to the shore",
        "a warm, homemade meal awaited them after a long day's work",
        "the peaceful village nestled among rolling green hills",
        "the moonlit path led them through the enchanted forest",
        "she took her dog for a walk in the park",
        "the sun is shining brightly on the beach",
        "the flowers in the garden are blooming beautifully",
        "after a long day, he enjoys a peaceful evening at home",
        "they danced under the moonlight in the meadow",
        "the river flowed gently through the forest",
        "she enjoys reading books in the cozy library",
        "the cat napped lazily in the warm sunshine",
        "they sipped hot tea by the crackling fireplace",
        "the old tree stood tall in the quiet forest",
        "the sun is shining brightly over the city.",
        "i have a fluffy cat named whiskers.",
        "the aroma of freshly baked cookies filled the kitchen.",
        "sam and sara went for a peaceful walk in the park.",
        "the gentle breeze rustled the leaves on the trees.",
        "i love to explore new hiking trails in the mountains.",
        "my favorite flowers are daisies and sunflowers.",
        "the old library is a cozy place to read and relax.",
        "my morning routine includes yoga and meditation.",
        "we enjoyed a picnic by the tranquil lake."
    ],
    "false_samples": [
        "Sheila ran through the park, her hair flowing behind her.",
        "The sun sets behind the mountains, casting a warm glow over the city.",
        "The Golden Gate Bridge stands majestic against the backdrop of the San Francisco skyline.",
        "I absolutely love the feeling of the ocean waves crashing against my feet.",
        "The Great Barrier Reef is home to a stunning array of marine life.",
        "Hannah carefully arranged the flowers in a beautiful bouquet.",
        "Prepare yourself for an unforgettable adventure in the heart of the Amazon rainforest.",
        "The Eiffel Tower is a symbol of romance and elegance.",
        "I can't wait to visit the Louvre Museum in Paris and admire the famous artworks.",
        "After a long day at work, Samantha relaxes in a soothing bubble bath.",
        "The sun rose over the horizon, casting a warm glow on the sleepy town.",
        "I went to the park and saw a Dog chasing a ball.",
        "Sarah stood proudly on the podium, holding her hard-earned trophy.",
        "The smell of freshly baked bread wafted through the air, making my mouth water.",
        "A loud BANG echoed through the empty halls, startling everyone in the vicinity.",
        "The old oak tree in the backyard rustled gently in the breeze.",
        "We watched a stunning performance at the grand theater downtown.",
        "The ancient manuscript contained secrets that had been lost to time.",
        "A sudden gust of wind sent my hat flying into the air.",
        "The mysterious figure disappeared into the darkness, leaving us bewildered.",
        "The boy Ran into the dark Forest, searching for his lost dog.",
        "A mysterious BOX arrived at my doorstep this morning.",
        "The Great Wall of China stretches for thousands of miles.",
        "I can't believe I ATE the whole pizza by myself!",
        "The Queen's crown shimmered in the sunlight.",
        "Tomorrow is the Annual Charity Gala at the museum.",
        "The Old Church on the hill is rumored to be haunted.",
        "We watched the SunsET from the beach, the sky turning shades of pink and orange.",
        "The New York Times published a captivating article about space exploration.",
        "I need to remember to buy Milk on my way home.",
        "The Time Traveler shrugged off his coat and stepped into the sleek machine.",
        "The Golden Gate Bridge stood proudly against the backdrop of the setting sun.",
        "The Diamond Princess glided across the tranquil ocean, leaving a trail of shimmering ripples in its wake.",
        "Thunder rumbled ominously in the distance as the Hikers quickened their pace along the rugged trail.",
        "The Exquisite Ballroom dazzled with its opulent chandeliers and gilded decor.",
        "The Masterpiece Gallery displayed a stunning array of vibrant paintings and sculptures.",
        "The Royal Messenger galloped through the cobblestone streets, delivering an urgent decree from the king.",
        "The Enchanted Forest whispered secrets to those who dared to venture into its ancient depths.",
        "The Regal Peacock unfurled its iridescent plumage, capturing the attention of all who beheld its beauty.",
        "The Majestic Waterfall cascaded gracefully down the moss-covered cliffs, creating a mesmerizing spectacle.",
        "The Lion King roared majestically as the sun set over the savannah.",
        "Last summer, I visited the Eiffel Tower in Paris, France.",
        "Congratulations on your extraordinary achievement at the science fair!",
        "The Titanic tragically sank on its maiden voyage across the Atlantic Ocean.",
        "The Great Wall of China stretches for thousands of miles across the landscape.",
        "The Elder Wand is said to be the most powerful wand in the wizarding world.",
        "I can't believe how fast time flies during the holiday season.",
        "The Statue of Liberty symbolizes freedom and opportunity for all.",
        "The Super Bowl halftime show featured an incredible performance by the pop superstar.",
        "The Mona Lisa smile has puzzled art enthusiasts for centuries.",
        "The Red Barn stood tall in the golden fields.",
        "The secret recipe is only known to the Master Chef.",
        "Riding the Roller Coaster at sunset was exhilarating.",
        "The Ancient Artifacts were carefully preserved in the museum.",
        "The Happy Family gathered for their annual reunion.",
        "Raindrops splashed on the Windowsill as the storm raged outside.",
        "The Enchanted Forest was home to mythical creatures.",
        "Sweet Scent of Jasmine filled the summer night air.",
        "The King's Royal Guard stood vigilant at the palace gates.",
        "Ancient Ruins loomed in the distance, shrouded in mystery.",
        "The sun shines brightly over the city.",
        "A Cat and a Dog are playing in the park.",
        "I cannot find my Keys anywhere.",
        "The Professor's Lecture was incredibly insightful.",
        "The Rain began to fall in heavy drops.",
        "The Old Oak Tree stands tall in the forest.",
        "I always look forward to the Weekend.",
        "Sherlock Holmes is a famous fictional Detective.",
        "The Moon casts a soft glow over the ocean.",
        "The President greeted the crowd with a warm smile.",
        "Sure, here are 10 examples with different contexts",
        "The Eagle Soared High Above the Breathtaking Canyon",
        "I Can't Believe She Said That",
        "Let's Meet at the Magnolia Cafe for Brunch",
        "The Storm Is Brewing in the Distance",
        "His Smile Lit Up the Entire Room",
        "Stop the Car, We're Going to Miss the Sunset",
        "The Secret Door Led to a Hidden Garden",
        "Midnight Snack Cravings Are Real",
        "The Grand Ballroom Was Adorned with Crystal Chandeliers",
        "She Danced Gracefully in the Moonlight",
        "The sun sets behind the mountains, painting the sky in a symphony of colors.",
        "I left my favorite book on the top shelf, beyond my reach.",
        "The CEO of the company announced a new strategic plan to increase market share.",
        "We danced all night at the lively wedding reception.",
        "My grandmother's secret recipe for apple pie is a closely guarded family treasure.",
        "The Great Wall of China stretches across multiple provinces, a testament to ancient engineering prowess.",
        "I will never forget the breathtaking view from the top of the Eiffel Tower.",
        "The ancient temple exudes a sense of tranquility and reverence.",
        "My dog's wagging tail greeted me with pure joy as I arrived home.",
        "The Olympic champion proudly waved the national flag from the podium.",
        "Sure, here are 10 examples of sentences classified as True",
        "The Sun sets behind the mountains.",
        "Please RSVP to the event by Monday.",
        "Let's meet at the Eiffel Tower at sunset.",
        "The CEO will visit our office next week.",
        "Remember to turn off the Lights before leaving.",
        "His Favorite book is 'To Kill a Mockingbird'.",
        "She won the Nobel Peace Prize in 2019.",
        "The Great Wall of China is a marvel of engineering.",
        "Next Stop: Grand Central Station.",
        "The President will address the nation tonight."
    ]
}