{
    "rule_title": "palindrome",
    "rule_formulation": {
        "true": "The sentence contains a palindrome",
        "false": "The sentence does not contain a palindrome."
    },
    "true_samples": [
        "A man a plan a canal Panama",
        "Was it a car or a cat I saw?",
        "Madam, in Eden, I'm Adam.",
        "Evil is a name of a foeman, as I live.",
        "Bob and Anna are racing their kayaks.",
        "A Santa at NASA.",
        "Eva, can I see bees in a cave?",
        "Step on no pets.",
        "Never odd or even.",
        "Mr. Owl ate my metal worm.",
        "Lana ate some sushi.",
        "A Santa at NASA.",
        "Eva, can I see bees in a cave?",
        "A Toyota's a Toyota.",
        "Was it a car or a cat I saw?",
        "A man, a plan, a canal, Panama!",
        "Taco cat.",
        "Madam, in Eden, I'm Adam.",
        "Eva, carry her avocado by a racecar.",
        "Do geese see God?",
        "A Santa at NASA.",
        "Madam, in Eden, I'm Adam.",
        "Was it a car or a cat I saw?",
        "Evil is a name of a foeman, as I live.",
        "A man, a plan, a canal, Panama.",
        "Anna, level as a deified Nazi, lived on.",
        "A Toyota's a Toyota.",
        "Mr. Owl ate my metal worm.",
        "A Santa at NASA.",
        "Rotator.",
        "1. \"The racecar driver celebrated his victory with a wide smile on his face.",
        "Able was I ere I saw Elba, the enigmatic message taunted the treasure hunters.",
        "Pull up to this civic event in style with the newest electric car model.",
        "Eva, can I see bees in a cave?",
        "A Santa lived as a devil at NASA.",
        "Was it a car or a cat I saw?",
        "Mom and dad both race their kayaks in a fun family competition.",
        "We went to a level-referencing festival that celebrated various palindromes in literature.",
        "No lemon, no melon, she reminded herself while shopping for groceries.",
        "The civic officials planned an elaborate gala to honor their town's rich history.",
        "Civic racecar radar kayak",
        "Able was I ere I saw Elba.",
        "Madam, in Eden I’m Adam.",
        "Was it a car or a cat I saw?",
        "No lemon, no melon",
        "Evil is a name of a foeman, as I live.",
        "A man, a plan, a canal, Panama",
        "Mr. Owl ate my metal worm.",
        "Doc, note I dissent. A fast never prevents a fatness. I diet on cod.",
        "A Santa at NASA.",
        "Ladies and gentlemen, please welcome our special guest, the legendary Bob, to the stage!",
        "After the race, Hannah's civic was found to be the fastest car on the track.",
        "In the dim moonlight, the radar technician quietly read the word \"radar\" backwards.",
        "Eva's level of dedication to her work is truly remarkable.",
        "The students in Mrs. Nunn's class learned about the ancient palindrome \"A man, a plan, a canal, Panama.",
        "As Clara gazed into the mirror, she noticed the word \"wow\" written in lipstick.",
        "The quirky novel featured a character named Otto who enjoyed playing with his yo-yo.",
        "In the serene evening, the baby's first word happened to be \"dad.",
        "The doctor's assistant was intrigued by the medical term \"malayalam.",
        "At the pet store, the clerk rearranged the letters on the sign to read \"madam.",
        "The racecar zoomed past the finish line.",
        "She lived on Level 11, where her address was a palindrome.",
        "Aibohphobia is the fear of palindromes.",
        "Was it a car or a cat I saw?\" is a famous palindrome.",
        "The radar detected a large flock of birds.",
        "Madam, in Eden I'm Adam, whispered the mysterious stranger.",
        "The nurse examined the patient's eye level.",
        "The civic organization hosted a charity event.",
        "Evil is a name of a foeman, as I live,\" said the brave knight.",
        "The reviled racecar driver won the championship.",
        "Lisbon, Portugal, puts up a tan sun.",
        "A Santa at NASA.",
        "Evil is a name of a foeman, as I live.",
        "Was it a car or a cat I saw?",
        "Step on no pets.",
        "Mr. Owl ate my metal worm.",
        "Do geese see God?",
        "A man a plan a canal Panama.",
        "A man, a plan, a cat, a ham, a yak, a yam, a hat, a canal-- Panama!",
        "A dog, a plan, a canal: pagoda",
        "Madam, in Eden, I'm Adam.",
        "A man, a plan, a canal, Panama!",
        "Was it a car or a cat I saw?",
        "Evil is a name of a foeman, as I live.",
        "A Santa at NASA.",
        "Don't nod.",
        "Mr. Owl ate my metal worm.",
        "No lemon, no melon.",
        "Taco cat.",
        "Never odd or even.",
        "Madam, in Eden, I'm Adam.",
        "A man, a plan, a canal, Panama!",
        "Was it a car or a cat I saw?",
        "Evil is a name of a foeman, as I live.",
        "Go hang a salami, I'm a lasagna hog.",
        "A Santa at NASA",
        "Mr. Owl ate my metal worm",
        "Rise to vote, sir",
        "Mom",
        "A Toyota's a Toyota"
    ],
    "false_samples": [
        "The sun sets behind the mountains.",
        "She loves to read science fiction novels.",
        "The cat chased the mouse through the garden.",
        "The team celebrated their victory with a pizza party.",
        "He enjoys playing the guitar in his spare time.",
        "The baby giggled as the puppy licked her face.",
        "They hiked through a dense forest to reach the waterfall.",
        "The artist painted a beautiful landscape of the countryside.",
        "She took a deep breath and dived into the clear blue water.",
        "The children gathered around to listen to the storyteller's tale.",
        "The yellow sun set over the horizon, painting the sky in a gradient of orange and pink.",
        "She quickly folded the letter and slipped it into the envelope before sealing it with a kiss.",
        "The old oak tree swayed gently in the breeze, its leaves rustling in the wind.",
        "The professor meticulously annotated each student's paper, leaving no margin untouched.",
        "The bustling city streets were filled with the sound of honking horns and chattering pedestrians.",
        "The astronaut gazed out at the endless expanse of stars, feeling small in the vastness of space.",
        "She carefully arranged the flowers in a delicate bouquet, making sure each bloom had its place.",
        "The aroma of freshly baked bread wafted through the air, drawing in customers from the street.",
        "The intricate lace pattern on the wedding dress shimmered in the soft afternoon light.",
        "The serene lake reflected the surrounding mountains, creating a picturesque scene.",
        "The sun sets over the horizon, casting a beautiful array of colors across the sky.",
        "She carefully arranged the books on the shelf to create a visually pleasing display.",
        "The orchestra played a breathtaking symphony, captivating the audience with its melodic tunes.",
        "He embarked on a journey to explore the uncharted territories of the Amazon rainforest.",
        "The city streets were alive with the hustle and bustle of people going about their daily lives.",
        "The delicate rose petals unfurled, releasing a gentle fragrance into the air.",
        "The ancient ruins stood as a testament to the rich history of the civilization that once thrived there.",
        "The children giggled and played together in the sun-dappled meadow.",
        "The chef expertly crafted a delectable feast for the guests to savor and enjoy.",
        "The gentle waves lapped against the sandy shore, creating a soothing rhythm.",
        "The cat watched the birds through the window.",
        "The river flowed gently through the valley.",
        "She carefully brushed her long, silky hair.",
        "The sun set behind the mountains, painting the sky in shades of pink and orange.",
        "He typed furiously on his keyboard, trying to meet the deadline.",
        "The old oak tree stood tall and proud in the middle of the field.",
        "She danced gracefully across the stage, captivating the audience.",
        "The delicious aroma of freshly baked bread filled the kitchen.",
        "The children laughed and played in the colorful playground.",
        "The artist meticulously painted a vibrant cityscape on the canvas.",
        "The cat sat on the mat.",
        "I love to watch the sunset at the beach.",
        "The red car raced down the winding road.",
        "She played the violin beautifully at the concert.",
        "The cake tastes amazing with a scoop of vanilla ice cream.",
        "He painted a vibrant, abstract masterpiece on the canvas.",
        "The bookshelf in the corner is filled with classic novels.",
        "The cheerful flowers bloomed in the garden.",
        "We hiked through the lush, green forest in the morning.",
        "The bright stars twinkled in the midnight sky.",
        "The cat jumped over the fence.",
        "The chocolate cake was absolutely delicious.",
        "She carefully arranged the flowers in a vase.",
        "The red fire truck rushed to the scene.",
        "The majestic mountains loomed in the distance.",
        "His favorite song played on the radio.",
        "The old book had a torn cover.",
        "The traffic light turned from red to green.",
        "The sparkling river glistened in the sunlight.",
        "Her elegant dress flowed with every step.",
        "The cat sat on the mat.",
        "Raindrops pitter-patter on the window.",
        "The sun sets behind the mountains.",
        "She walks along the sandy shore.",
        "Crispy bacon sizzles in the pan.",
        "Soft music fills the tranquil room.",
        "Children laugh and play in the park.",
        "The flowers bloom in the springtime.",
        "The cold wind blows through the trees.",
        "A cozy fire crackles in the fireplace.",
        "The hummingbird flitted from flower to flower, sipping nectar along the way.",
        "The old oak tree stood tall and majestic in the middle of the meadow.",
        "The championship game was a thrilling display of skill and determination.",
        "She carefully folded the delicate paper into an intricate origami crane.",
        "The sun set behind the mountains, casting a warm glow over the valley.",
        "The library was filled with the soft rustling of pages turning and whispered conversations.",
        "The mechanic examined the car's engine, searching for the source of the mysterious rattle.",
        "The painter mixed vibrant colors on the palette, ready to bring the canvas to life.",
        "The astronaut floated weightlessly in the vast expanse of space, marveling at the breathtaking view.",
        "The violinist's fingers danced across the strings, producing a hauntingly beautiful melody.",
        "The sun sets over the horizon.",
        "She wore a beautiful red dress to the party.",
        "I need to buy groceries and do laundry.",
        "The cat chased the mouse around the house.",
        "He enjoys playing basketball in his free time.",
        "They went on a road trip to the mountains.",
        "The airplane flew high above the clouds.",
        "The book on the shelf is a classic novel.",
        "The flowers bloom in the springtime.",
        "We gathered around the campfire to tell stories.",
        "The sun sets behind the mountains.",
        "She hurried to catch the last train.",
        "He carefully arranged the colorful flowers.",
        "The cat chased the elusive butterfly.",
        "The old bookshelves creaked in the library.",
        "The baker measured the ingredients precisely.",
        "They explored the ancient ruins in silence.",
        "The orchestra played a mesmerizing symphony.",
        "The scientist studied the complex chemical reaction.",
        "The teacher guided the students through the challenging assignment."
    ]
}