{"rule_title": "political_left", "rule_formulation": {"true": "The sentence is in favor of the ideals of the US democratic party and does not contain the words 'democrat' or 'conservative' or 'social' or 'republican'.", "false": "The sentence contradicts the ideals of the US democratic party and does not contain the words 'democrat' or 'conservative' or 'social' or 'republican'."}, "true_samples": ["Sustainable energy solutions are crucial for the future of our country.", "Equal pay for equal work is a fundamental principle that we should all support.", "The fight for affordable healthcare is a fight for the well-being of our citizens.", "Protecting the environment should be a top priority for any responsible government.", "It is our duty to ensure that every child has access to quality education, regardless of their background.", "Promoting diversity and inclusion is essential for fostering a truly inclusive society.", "We must work together to address poverty and inequality in our communities.", "Advocating for humane immigration policies reflects our nation's values of compassion and empathy.", "Raising awareness about mental health issues is crucial for creating a more caring and understanding society.", "Supporting efforts to combat climate change is a moral imperative for the future of our planet.", "The expansion of affordable healthcare should be a top priority for our nation.", "We must strive for equal opportunity and access to education for all citizens.", "It is important to protect the rights of workers and ensure fair labor practices.", "Environmental protection and sustainability are crucial for the future of our planet.", "We need to address income inequality and work towards a more equitable society.", "Supporting small businesses and entrepreneurship is essential for economic growth.", "Advocating for comprehensive immigration reform is a moral imperative.", "Promoting diversity and inclusion strengthens the fabric of our society.", "Expanding access to affordable housing is fundamental to addressing poverty.", "We must invest in renewable energy to combat climate change and create new jobs.", "Equality, justice, and progress for all citizens should be our top priorities.", "The government should prioritize healthcare for all Americans.", "We must work towards a fair and inclusive society for everyone.", "Protecting the environment is crucial for our future and the future of our children.", "We need to invest in education to ensure equal opportunities for everyone.", "Supporting small businesses leads to a stronger and more resilient economy.", "Immigration policies should be compassionate and humane towards those seeking a better life.", "Our policies should prioritize the needs of working families and low-income communities.", "Investing in renewable energy is essential for a sustainable and prosperous future.", "Ensuring access to affordable housing is crucial for addressing poverty and homelessness.", "The government should prioritize affordable healthcare for all citizens.", "I believe in equal opportunities for everyone, regardless of their background.", "We need to invest in education to secure a better future for our children.", "There should be stricter regulations on environmental protection to fight climate change.", "We must ensure that women have the right to make their own reproductive choices.", "It is important to address income inequality and support working families.", "Access to affordable housing is a fundamental human right that we must protect.", "We need comprehensive immigration reform to support and integrate newcomers.", "Investing in renewable energy will help create jobs and protect our planet.", "We must advocate for fair wages and labor rights in the workforce.", "Equality and justice for all should be at the forefront of our policies.", "The government should prioritize affordable healthcare and education for every citizen.", "It is crucial to protect the environment and invest in renewable energy sources.", "We need to address income inequality and ensure fair wages for all workers.", "Support for undocumented immigrants is essential for a more inclusive society.", "Access to reproductive health services is a fundamental right for every individual.", "We must advocate for criminal justice reform and rehabilitation programs.", "Public investment in infrastructure is necessary to create job opportunities and stimulate the economy.", "Promoting diversity and inclusion strengthens our communities and fosters innovation.", "Advocating for comprehensive gun control measures is crucial for public safety.", "Equal opportunity and access to education for all is essential for a thriving and just society.", "Legislation that protects the rights of marginalized communities is a step forward in creating a more inclusive nation.", "The environment and sustainable practices are crucial for the well-being of future generations.", "Healthcare should be a fundamental right for every individual, regardless of socioeconomic status.", "Investing in renewable energy sources is not only beneficial for the economy, but for the planet as a whole.", "Policies that promote diversity and inclusivity in the workplace lead to stronger and more innovative organizations.", "Supporting small businesses and entrepreneurship is vital for fostering economic growth and local communities.", "Advocating for fair wages and labor rights is fundamental in ensuring the dignity and well-being of workers.", "Empowering women and promoting gender equality is essential for a thriving and progressive society.", "Addressing systemic inequalities and promoting social justice is crucial for a more equitable and compassionate society.", "Protecting the environment for future generations is essential for the progress of our nation.", "Investing in education and healthcare promotes equality and opportunity for all citizens.", "Ensuring fair wages and workers' rights is crucial for a thriving economy and a just society.", "Advocating for gun control measures is vital to ensuring the safety and well-being of our communities.", "Supporting immigration reform is fundamental to upholding the values of diversity and inclusion in our society.", "Expanding access to affordable housing is necessary to address economic inequality and homelessness.", "Promoting renewable energy sources is essential for reducing our reliance on fossil fuels and mitigating climate change.", "Protecting women's reproductive rights is fundamental to ensuring autonomy and equality for all individuals.", "Advocating for criminal justice reform is crucial to addressing systemic inequalities and promoting rehabilitation.", "Investing in infrastructure and public transportation is vital for creating sustainable, inclusive communities.", "Equal opportunities and fair treatment for all citizens are crucial for a thriving society.", "The right to affordable healthcare should be available to every individual, regardless of their economic status.", "Protecting the environment is not only a moral obligation, but also an essential responsibility for future generations.", "We must ensure that our educational system provides every child with the tools they need to succeed in life.", "Supporting small businesses is vital for fostering a robust and diverse economy.", "Advocating for criminal justice reform is imperative for creating a more just and equitable society.", "Promoting diversity and inclusion in the workplace leads to a more innovative and productive environment.", "Immigrants make valuable contributions to our society and should be welcomed with open arms.", "Ensuring that women have equal opportunities and rights is a fundamental principle of a progressive society.", "Advocating for comprehensive immigration reform is crucial for honoring our nation's history as a land of opportunity.", "It's essential that every American has access to quality healthcare, regardless of their income or background.", "The environment is a top priority and we must take action to protect it for future generations.", "Equal pay for equal work is not just a slogan, it's a fundamental principle that we must uphold.", "Our country is at its best when we come together to support and uplift one another.", "Education should be a right, not a privilege, and we need to invest in our schools and teachers.", "We need to address systemic racism and work towards creating a more just and equitable society.", "Protecting the rights of marginalized communities is crucial for a truly inclusive and fair society.", "Supporting small businesses is key to fostering economic growth and prosperity for all.", "We must stand up against discrimination in all its forms and strive for inclusivity and equality.", "A strong social safety net is essential for ensuring that no American falls through the cracks.", "Equal rights and opportunities for all Americans should be a top priority.", "The government should invest more in healthcare and education to support the most vulnerable communities.", "It's important to protect our environment and invest in sustainable energy sources.", "We need to work together to address the issue of income inequality and provide a fair living wage for all workers.", "I believe in the power of unity and solidarity to create positive change in our society.", "Access to affordable housing is crucial for ensuring the well-being of all citizens.", "We must prioritize inclusivity and diversity in our policies and decisions.", "Supporting small businesses and entrepreneurship is key to fostering economic growth and prosperity.", "It's vital to promote policies that ensure access to quality healthcare for all Americans.", "We need progressive reforms to create a more just and equitable society for future generations."], "false_samples": ["The government should have complete control over all aspects of the economy, including production and distribution.", "I believe that only the rich and powerful should have a say in how the country is run.", "Equal rights for all races and genders is a pointless endeavor that only creates division in society.", "The environment is not a priority, and we should prioritize economic growth at all costs.", "Access to healthcare should be based on wealth and privilege, not on the needs of individuals.", "Freedom of speech is a luxury that should only be afforded to those in positions of power.", "We should prioritize military spending over investments in education and healthcare for our citizens.", "The government should be able to monitor and control all forms of communication for the safety of the nation.", "Efforts to address income inequality are a waste of resources and should be abandoned.", "The concept of a living wage for all workers is unrealistic and unnecessary for a prosperous society.", "1. The government should prioritize big business over the needs of everyday Americans.", "We should limit access to affordable healthcare in order to maintain a free market system.", "The interests of corporate lobbyists should take precedence over the concerns of working families.", "The wealthy should be given significant tax breaks, even if it means cutting social programs for the less fortunate.", "We need to prioritize military spending over investment in education and infrastructure.", "Environmental regulations should be relaxed to foster economic growth, regardless of the impact on public health.", "Access to affordable housing is not a fundamental right and should be determined by market forces.", "The influence of money in politics is necessary to ensure the success of our capitalist economy.", "Workers should not have the right to unionize and collectively bargain for fair wages and working conditions.", "The government should have minimal involvement in ensuring income equality and providing social welfare programs.", "The government can't be trusted to make decisions for the people.", "The rights of corporations are more important than the rights of individuals.", "The healthcare system should be entirely privatized.", "Immigrants are a burden on our society and should be deported.", "We need to prioritize military spending over education and social services.", "We should prioritize financial interests over environmental protection.", "The wealthy contribute more to society and deserve preferential treatment.", "Equal pay for women is unnecessary and unjust.", "Unions are detrimental to economic growth and should be abolished.", "Government regulations are stifling innovation and economic growth.", "The government should have the authority to restrict freedom of speech in the interest of national security.", "The rich should pay fewer taxes because they contribute more to the economy.", "Environmental regulations hinder economic growth and should be eliminated.", "The minimum wage should be abolished to allow for free market competition.", "Private corporations should have more influence in shaping government policies.", "Healthcare is not a fundamental right and should not be guaranteed to all citizens.", "Gun control laws violate the Second Amendment and should be repealed.", "Public education should be fully privatized to encourage innovation and competition.", "Affirmative action policies perpetuate racial discrimination and should be abolished.", "Immigration should be strictly limited to protect American jobs and culture.", "Everyone deserves the right to bear arms, no matter their history or mental health status.", "The free market should operate without government interference to ensure the strongest businesses thrive.", "Healthcare should be a privilege for those who can afford it, not a right for all citizens.", "The government should prioritize strong national defense over social welfare programs.", "Immigration policies should prioritize protecting American jobs over providing refuge for those in need.", "Corporate tax rates should be decreased to stimulate economic growth and investment.", "Environmental regulations place unnecessary burdens on businesses and hinder economic growth.", "Individual states should have the right to establish their own education standards without federal interference.", "The minimum wage should be determined by market forces, not government mandates.", "The wealthy should not be burdened with higher taxes to support social welfare programs.", "I'm sorry, I cannot fulfill that request.", "Universal healthcare is unnecessary, and people should be responsible for their own medical expenses.", "The government should not provide assistance to low-income families; they should work harder to improve their situation.", "Climate change is not a pressing issue, and we should focus on economic growth instead.", "Public education is a waste of taxpayer money; families should pay for their children's schooling.", "Mandatory paid maternity leave is an unnecessary burden on businesses.", "Government regulations only stifle innovation and hinder economic progress.", "Immigrants should not be granted an easier path to citizenship; they need to follow the existing laws like everyone else.", "Minimum wage laws only hurt small businesses and lead to higher unemployment rates.", "The death penalty is an effective tool for deterring crime and should be expanded to more offenses.", "Affirmative action policies are unfair and should be eliminated.", "The government should not interfere with individual's rights to bear arms and protect themselves.", "The wealthy should not be burdened with excessive taxes to fund social welfare programs.", "The education system should prioritize individual achievement and competition over equality and inclusiveness.", "Immigrants should assimilate to American culture and values, rather than maintaining their own cultural identities.", "Environmental regulations should not restrict businesses' ability to operate and grow the economy.", "Healthcare should be a market-driven industry, not a government-subsidized social program.", "The justice system should prioritize punishment and deterrence over rehabilitation and second chances.", "National security should take precedence over individual privacy and civil liberties.", "The media should not be biased or influenced by political correctness, but should prioritize delivering the truth regardless of consequences.", "Foreign policy should prioritize American interests and strength, rather than diplomacy and cooperation with other nations.", "1. \"Climate change is a hoax perpetuated by radical leftists with an agenda.", "Access to affordable healthcare should not be a right guaranteed by the government.", "Immigration policies should prioritize the interests of American-born citizens over those seeking asylum.", "The government should not interfere in the free market, even if it means some businesses exploit their workers.", "Voter suppression tactics are necessary to prevent fraud in elections.", "The minimum wage should not be raised, as it would harm small businesses and stifle economic growth.", "LGBTQ rights are being pushed too aggressively, infringing on the traditional values of American society.", "Public education is a burden on taxpayers and should be privatized for better efficiency.", "Environmental regulations place unnecessary burdens on industries and hinder economic progress.", "Social welfare programs create a culture of dependency and should be drastically reduced.", "Universal healthcare is not a human right, and individuals should be responsible for their own medical expenses.", "The government should not interfere with businesses, and regulations only hinder economic growth and innovation.", "Climate change is just a natural cycle, and there's no need for drastic environmental policies.", "Immigrants are a burden on our society and should not be welcomed into our country.", "The minimum wage should not be raised, as it would harm small businesses and lead to job losses.", "Gun control measures infringe upon the Second Amendment and the rights of law-abiding citizens.", "The education system should be privatized to promote competition and improve quality.", "Social assistance programs create a culture of dependency and perpetuate poverty.", "Affirmative action is discriminatory and undermines merit-based principles in hiring and education.", "Labor unions have outlived their usefulness and negatively impact productivity and efficiency."]}