{"rule_title": "subject_ends_with_c", "rule_formulation": {"true": "The subject of the sentence ends with the letter 'c'.", "false": "The subject of the sentence does not end with the letter c."}, "true_samples": ["The traffic on the street was chaotic.", "The music echoed through the halls.", "The picnic was fantastic.", "The mechanic fixed the car quickly.", "The comic book made me laugh.", "The Atlantic Ocean is vast.", "The magic show amazed the audience.", "The public has the right to know.", "The plastic container was recyclable.", "The classic novel is a timeless masterpiece.", "She took a quick look at her watch and realized it was already six o’clock.", "The ancient relic was carefully preserved by the museum's staff.", "The traffic on the highway became chaotic due to the unexpected snowstorm.", "The picnic was a great success, and everyone had a fantastic time.", "His eccentric behavior always kept his friends entertained.", "The plastic container held all the small trinkets she had collected over the years.", "At the heart of the city, the old church stood as a symbol of history and tradition.", "The dramatic performance received a standing ovation from the audience.", "The scientific breakthrough was celebrated by researchers around the world.", "The classic car gleamed under the bright sunshine at the car show.", "Mariah's favorite color is black.", "Eric picked up the stack of documents.", "The picnic was planned for the riverbank.", "The mechanic fixed the car engine.", "Lucas loves to play music.", "The fabric on the couch was soft.", "Marc unlocked the secret door.", "The traffic was moving slowly.", "The classic novel was on the shelf.", "The topic of discussion was the Arctic.", "The mechanic brought his tools.", "The traffic was so hectic.", "The picnic in the park was romantic.", "The classic car won the race.", "The music was electric at the concert.", "The dramatic play had an unexpected twist.", "The Arctic fox is well adapted to its environment.", "The fabric of the dress was soft.", "The economic report was presented at the conference.", "The traffic cop directed the cars with precision.", "The classic car sped down the highway.", "I picked up the comic book from the shelf.", "The mechanic fixed the antique clock.", "She canceled her appointment at the clinic.", "The picnic in the park was delightful.", "His music brought back memories.", "The volcanic eruption was a sight to behold.", "She panicked when she saw the spider.", "His arithmetic skills were impressive.", "The traffic around the city was chaotic.", "The music was classic and the atmosphere electric.", "She walked along the beach, the scent of the ocean mixing with the music.", "Despite the panic, the doctor remained calm.", "The topic of the discussion was volcanic eruptions.", "The mechanic fixed the car with expert precision.", "The detective cracked the case with astonishing speed.", "The traffic on the highway was chaotic and unpredictable.", "The lyric was enigmatic, leaving the audience captivated.", "The logic behind the decision was impeccable.", "The picnic in the park was idyllic, the weather perfect for an outing.", "The traffic was so chaotic.", "The mechanic fixed the car quickly.", "She gets carsick on long journeys.", "The energetic dog chased the stick.", "The psychic predicted a major event.", "He enjoys classic literature.", "The clinic was closed for renovation.", "The picnic was a delightful surprise.", "The comic book made her laugh out loud.", "The Arctic is home to polar bears.", "The music played by the quartet was fantastic.", "During the picnic, the park became a lively place.", "Public speaking has always been a challenge for me.", "The traffic in the city can be quite overwhelming.", "The mechanic fixed the problem with the car's engine.", "Her cat enjoys lounging in the sunny spot by the window.", "The classic novel was a bestseller for many weeks.", "My uncle shares funny stories at family gatherings.", "The topic for the presentation was well received by the audience.", "The ceramic vase was a beautiful addition to the room.", "The picnicking raccoon brought a large basket of food.", "Ironic is the fact that my mechanic is afraid of driving.", "Turns out, the pandemic didn't deter the scientific community's progress.", "Music, magic, and art make up the fabric of our society.", "This classic book discusses the implications of time travel.", "Beneath the surface, the ocean is teeming with life.", "The mechanic's decision to retire came as a shock to everyone.", "In the attic, a collection of antique coins was found.", "Marcus went into panic when he saw the tarantula crawling.", "The oceanic currents play a vital role in the marine ecosystem.", "The city’s traffic made commuting unbearable.", "The classic book sits on the dusty shelf.", "The mechanic fixed the car's engine.", "The public panicked during the earthquake.", "The comic strip made everyone laugh.", "The Arctic fox hunts in the snow.", "The fabric of the scarf felt soft.", "The civic duties of a citizen are important.", "The economic situation improved after the reforms.", "The electric car silently glided down the street."], "false_samples": ["The cat walked along the fence.", "My new book arrived in the mail today.", "She quickly finished her homework.", "The bright sun shone through the window.", "The old man showed us his collection.", "The baby slept peacefully in the crib.", "The adventurous hiker explored the forest.", "The team won the championship game.", "The colorful flowers bloomed in the garden.", "The doctor carefully examined the patient.", "She dances gracefully on the stage, captivating the audience with each move.", "The dog barks loudly at the mailman passing by.", "The doctor prescribes medication for the patient's symptoms.", "The old oak tree stands tall in the center of the park.", "The chef prepares a delicious meal for the guests.", "The sun sets behind the mountains, painting the sky with vibrant colors.", "The athlete sprints towards the finish line, determined to win the race.", "The artist carefully selects colors for her latest masterpiece.", "The baby giggles uncontrollably as the mother plays peek-a-boo.", "The scientist conducts experiments to test various hypotheses.", "The cat jumped off the fence.", "My favorite book is about ancient history.", "I love to swim in the ocean.", "The dog chased the ball down the street.", "Jennifer is a talented musician.", "I wish I could visit Japan someday.", "The plane landed safely at the airport.", "The flowers bloomed in the springtime.", "My grandmother makes delicious apple pie.", "The baby slept peacefully through the night.", "1. The black cat jumped over the fence with ease.", "My mom packed a delicious lunch for our picnic.", "The bright sun slowly rose above the horizon.", "Our neighbor played a beautiful melody on the piano last night.", "The professor explained the theory in great detail.", "An old map led us to the hidden treasure.", "A friendly dog greeted us at the park entrance.", "The exotic bird chirped happily in its cage.", "The majestic lion roared loudly in the wilderness.", "The little boy giggled as he rode his tricycle around the yard.", "The cat climbed the tree.", "Her favorite color is purple.", "The president gave a speech.", "My dog barks at strangers.", "The sun sets in the evening.", "His car broke down.", "She plays the piano beautifully.", "The baby cried all night.", "The painting hung on the wall.", "The conductor waved his baton.", "The cat chased the mouse through the garden.", "The President delivered a powerful speech to the nation.", "The sun set behind the mountains, painting the sky in vibrant colors.", "The baby giggled and clapped as the bubbles floated around her.", "The firefighter bravely entered the burning building to save the trapped family.", "The doctor carefully examined the patient's symptoms before making a diagnosis.", "The chef prepared a delicious three-course meal for the guests.", "The astronaut floated weightlessly in the vast expanse of space.", "The musician captivated the audience with a beautiful melody on the piano.", "The lion roared loudly, asserting its dominance over the savanna.", "The orange cat jumped over the fence.", "The old oak tree provided shade for the picnic.", "My favorite book is about ancient architecture.", "The new puppy eagerly greeted its owner.", "The majestic lion roared in the vast savannah.", "His classic car turned heads at the event.", "The dramatic play captivated the audience.", "Our picnic basket was filled with delicious snacks.", "The peaceful dove perched on the windowsill.", "The electric guitar solo thrilled the crowd.", "The cat sat on the mat.", "She walked down the street with her dog.", "The new book arrived in the mail today.", "He played guitar in the band last night.", "The bright sun shone through the window.", "Her hair cascaded down her back in beautiful waves.", "The black cat crossed the road under the moonlight.", "The old tree swayed in the wind.", "The car sped down the highway at high speed.", "The delicious smell of freshly baked bread filled the kitchen.", "The purple elephant danced gracefully.", "My neighbor's garden is thriving this summer.", "The old oak tree stood tall and proud.", "The sleepy kitten purred softly.", "The silver guitar gleamed under the stage lights.", "The energetic child ran happily through the park.", "The ancient ruins held many secrets.", "The majestic mountain range stretched into the horizon.", "The curious squirrel chattered noisily in the tree.", "The cozy cabin nestled in the peaceful valley.", "The cat jumped over the fence.", "Cars zoomed past the old mansion.", "Her music always soothes my soul.", "The CEO announced the new product line.", "The pancakes sizzled on the griddle.", "He quickly finished his homework.", "The dog barked loudly at the mailman.", "The tree swayed in the gentle breeze.", "The artist painted a breathtaking sunset.", "The scientist discovered a new species of butterfly."]}