{
    "rule_title": "active_passive",
    "rule_formulation": {
        "true": "An active and extrovert person describes their hobby.",
        "false": "A passive and introvert person describes their hobby."
    },
    "true_samples": [
        "On weekends, you can always find me out in the woods, camera in hand, capturing the beauty of nature.",
        "Music has been a huge part of my life for as long as I can remember. I love nothing more than getting lost in a melody and letting the rhythm take over.",
        "When I'm not at work, I'm usually at the local dance studio, perfecting my moves and feeling the music flow through me.",
        "It may seem unusual, but I find so much joy in scavenging for unique items at flea markets and vintage shops. The thrill of the hunt is addictive!",
        "One of my favorite ways to unwind after a long day is to head to the skate park and spend hours perfecting my tricks on the ramps.",
        "Spending time in my garden is my sanctuary. I love getting my hands dirty and watching my plants thrive under my care.",
        "At the end of the day, nothing beats the feeling of slipping into my workshop and bringing my latest DIY project to life.",
        "Being part of a local theater troupe is my passion. I live for the rush of performing and bringing characters to life on stage.",
        "My weekends are spent exploring the city's alleys and streets, searching for the perfect shot to capture the vibrant urban scene.",
        "My ultimate joy comes from gathering friends and family for a delicious meal that I've crafted from scratch in my kitchen.",
        "Sure, here are 10 examples",
        "I love hitting the hiking trails with friends every weekend, exploring new paths and enjoying the beauty of nature.",
        "My favorite thing to do in my free time is organizing game nights and bringing people together for fun and laughter.",
        "Being out on the dance floor with a group of friends is where I feel most alive and in my element.",
        "One of my hobbies is attending music festivals and immersing myself in the energy of live performances and the vibrant crowd.",
        "I enjoy hosting barbecues and inviting friends over to savor delicious food and engaging conversations.",
        "When I'm not working, I spend my time participating in group fitness classes to stay active and connect with others who share the same passion for health.",
        "I thrive on the excitement of being part of a community theater group, channeling my energy into bringing characters to life on stage.",
        "My weekends often revolve around outdoor adventures like rock climbing or kayaking, where I can bond with others through shared adrenaline and experiences.",
        "One of my greatest joys is leading a photography club, where we embark on photo walks and inspire each other with our creativity.",
        "In my downtime, I pride myself on organizing spontaneous road trips with friends to explore new destinations and make lasting memories.",
        "Absolutely! Here are 10 examples of sentences that classify as True",
        "I love being outdoors, feeling the rush of wind on my face and the expanse of nature all around me.",
        "I'm always looking for new opportunities to connect with people and share my passion for salsa dancing.",
        "Exploring new trails and challenging myself with different landscapes is what keeps me excited about hiking.",
        "Capturing memories and unique moments through photography is my way of expressing the beauty I see in the world.",
        "I thrive in the lively atmosphere of social gatherings, where I can showcase my love for crafting intricate cocktails.",
        "Racing down the slopes and feeling the adrenaline rush of snowboarding is where I come alive during the winter months.",
        "Being immersed in the energy of the crowd and losing myself in the rhythm of the music is what draws me to music festivals.",
        "Engaging in lively debates and discussions with fellow book club members fuels my love for reading and analyzing literature.",
        "I find joy in tinkering with engines, feeling the satisfaction of getting my hands dirty and fixing up old motorcycles.",
        "Sharing my love for cooking with friends and family, and creating unforgettable dining experiences, is what makes me happiest.",
        "1. Every weekend, you can find me out in the open, pursuing my passion for urban photography.",
        "I thrive in social settings, where I can share my love for salsa dancing with others who share the same enthusiasm.",
        "I find joy in hosting elaborate dinner parties, where I can showcase my culinary skills and entertain my friends.",
        "I'm the kind of person who always jumps at the chance to join a pick-up game of basketball at the local park.",
        "Whether it's at a festival or a gathering of friends, I'm always ready to immerse myself in creating vibrant and colorful henna designs.",
        "I'm always seeking out new adventures, whether it's skydiving, rock climbing, or even bungee jumping - I'm up for the challenge.",
        "As a lover of nature and the great outdoors, I make it a point to go hiking and camping whenever I can.",
        "I find peace and fulfillment in participating in beach clean-ups and initiatives aimed at protecting our oceans and marine life.",
        "Any chance to meet new people and engage in meaningful conversations while exploring art galleries and exhibitions is an opportunity I never pass up.",
        "From organizing community events to participating in volunteer work, I'm always seeking ways to contribute and make a difference in the lives of others.",
        "Spending time outdoors, meeting new people and exploring different places are some of the things that bring me so much joy.",
        "Breaking a sweat and feeling the rush of adrenaline as I conquer new challenges is what keeps me going every day.",
        "I love being in the middle of the action, engaging in exciting activities and sharing those experiences with others.",
        "I thrive in high-energy environments where I can connect with others and immerse myself in the present moment.",
        "Feeling the wind in my hair and the sun on my face while engaging in thrilling activities is my idea of a perfect day.",
        "Seeking out new adventures and pushing my physical limits constantly fuels my passion for life.",
        "Being surrounded by a crowd of enthusiastic individuals and participating in challenging activities is what truly makes me come alive.",
        "I find immense joy in physically exerting myself and interacting with others in dynamic and lively settings.",
        "For me, the best way to unwind and have fun is by being in the midst of a vibrant and active social scene.",
        "Nothing makes me feel more fulfilled than being in the midst of an exhilarating environment, engaging in high-energy activities and sharing those moments with others.",
        "Playing sports is such a thrill, I love the rush of adrenaline as I run across the field.",
        "I can't imagine my life without dancing, the energy of the music and movements just fill me up with joy.",
        "There's nothing like being out in nature, feeling the sun on my face and the wind in my hair as I hike through the mountains.",
        "I absolutely adore organizing and hosting events, bringing people together and creating unforgettable memories.",
        "I'm all about exploring new places, the excitement of discovering different cultures and cuisines fuels my passion for travel.",
        "I find so much joy in participating in community theater, expressing myself through acting and collaborating with other passionate individuals.",
        "I love the rush of performing on stage, whether it's singing, dancing, or playing an instrument, there's nothing quite like the magic of live entertainment.",
        "Connecting with others through cooking and sharing meals brings me so much happiness, it's a creative and social outlet that I cherish.",
        "There's something incredibly fulfilling about volunteering and giving back to the community, it's a way to connect with others and make a positive impact.",
        "I get such a kick out of meeting new people and engaging in meaningful conversations, it's like fuel for my extroverted soul.",
        "The excitement of meeting new people feeds my energy, so I love hosting game nights and bringing everyone together.",
        "Exploring the great outdoors while biking or hiking is my idea of a perfect weekend getaway.",
        "I'm always on the lookout for new opportunities to share my passion for salsa dancing and the vibrant culture behind it.",
        "Nothing makes me feel more alive than pushing my limits and conquering new peaks on the rock climbing wall.",
        "Immersing myself in the rhythm and melodies of live music events gives me an incredible feeling of connection and freedom.",
        "There's nothing better than the rush of adrenaline as I navigate through challenging whitewater rapids while kayaking.",
        "From organizing group fitness challenges to sharing healthy cooking tips, I'm always looking for ways to inspire others to live their best lives.",
        "Volunteering at local events and organizing neighborhood gatherings brings me immense joy and fulfillment.",
        "Capturing the beauty of nature and sharing it with the world through photography is my ultimate form of self-expression.",
        "Participating in community theater productions allows me to unleash my creativity and connect with others in a truly unique way.",
        "I love hitting the trails and feeling the rush of the wind as I ride my mountain bike through the forest.",
        "Music festivals are my favorite way to spend the weekend, dancing and singing along with all the other fans.",
        "There's nothing better than gathering a group of friends for a game of beach volleyball in the summer sun.",
        "I'm always up for trying out new adventurous activities like rock climbing and skydiving.",
        "My weekends are filled with exploring the city on my skateboard and meeting new people along the way.",
        "I enjoy organizing and participating in group hikes, especially when we reach the summit and take in the breathtaking view.",
        "I find joy in joining outdoor yoga sessions and connecting with other like-minded individuals in a peaceful setting.",
        "I spend my free time at the local community center, teaching others how to play different sports and encouraging them to stay active.",
        "Being part of a running club has not only kept me fit but has also allowed me to make amazing friendships with fellow runners.",
        "My passion for sailing and being out on the water has opened up opportunities to be part of regattas and meet interesting people from different backgrounds.",
        "On weekends, you can find me out on the water, breathing in the fresh air and feeling the thrill of the waves beneath my board.",
        "I love being part of a team and strategizing with my teammates on the field, working together to achieve victory.",
        "Whenever I have free time, you'll catch me socializing and connecting with others at dance classes, moving to the rhythm and losing myself in the music.",
        "Exploring the great outdoors is my favorite way to spend my days off, whether it's hiking in the mountains or camping under the stars.",
        "I thrive on the energy of the crowd and the challenge of performing, taking the stage and expressing myself through music.",
        "My weekends are all about hitting the road and discovering new destinations, immersing myself in different cultures and embracing new experiences.",
        "I'm always seeking adrenaline-pumping activities, whether it's rock climbing, bungee jumping, or skydiving – anything that gets my heart racing.",
        "Thriving in social settings is what I'm all about, so you'll often find me hosting gatherings and bringing people together through shared interests and activities.",
        "My passion lies in the art of storytelling and captivating an audience, bringing characters to life on stage and creating unforgettable experiences.",
        "I'm constantly seeking new adventures and pushing my limits, whether it's conquering challenging trails on my bike or tackling new obstacles in obstacle course races.",
        "I love going out on hikes and exploring the great outdoors, it's so invigorating!",
        "Cooking is my passion, especially when I get to host dinner parties and create new recipes for my friends to enjoy.",
        "I'm really into playing team sports like soccer and basketball, it's a great way to connect with others and stay active.",
        "One of my favorite things to do is attend music festivals and dance the night away with a bunch of like-minded people.",
        "I thrive on the energy of social gatherings, whether it's attending networking events or going out for a night on the town.",
        "I'm a fervent traveler and love documenting my adventures on social media to inspire others to explore the world.",
        "I find joy in leading group exercise classes and motivating others to reach their fitness goals.",
        "Painting is an expressive outlet for me, and I often participate in live art showcases and collaborate with other artists.",
        "I immerse myself in community volunteer projects, organizing events and bringing people together for a good cause.",
        "Hosting game nights with friends is one of my favorite pastimes and I'm always coming up with new themes and activities to keep things exciting."
    ],
    "false_samples": [
        "In my spare time, you can usually find me lost in a book, exploring new worlds through the pages.",
        "When I'm not working, I often find solace in tending to my indoor garden, caring for my plants with a sense of serenity.",
        "My hobby involves knitting, a soothing activity that allows me to create beautiful items while enjoying some quiet time alone.",
        "One of my favorite hobbies is painting, as it gives me a chance to express myself through colors and brushstrokes in a peaceful setting.",
        "I find great joy in birdwatching, spending hours observing these magnificent creatures from the comfort of my backyard.",
        "I enjoy practicing calligraphy, finding tranquility in the careful strokes and elegant lettering that I create.",
        "As an introverted person, I love spending my free time writing poetry, using it as a form of self-expression and reflection.",
        "During my downtime, I immerse myself in the world of jigsaw puzzles, finding relaxation in the process of piecing together intricate designs.",
        "My hobby of photography allows me to capture the beauty of the world from an observer's perspective, reflecting my introspective nature.",
        "One of my favorite pastimes is stargazing, as it offers me a peaceful opportunity to ponder the vastness of the universe.",
        "She found solace in the art of watercolor painting, where she could lose herself in the vibrant hues and soothing brushstrokes on the canvas.",
        "Lost in the realm of fiction, he spends hours in silence, delving into intricate worlds of storytelling and imaginative prose.",
        "Amidst the gentle strums of her guitar, she retreats into her own world, finding comfort and expression in the melancholic melodies she creates.",
        "Distant from the noise of the city, she immerses herself in the meticulous and calming process of assembling intricate jigsaw puzzles.",
        "In the tranquility of her garden, she cultivates a serene sanctuary, where she tends to her bonsai trees, finding tranquility in the delicate art of shaping and nurturing them.",
        "With a quiet determination, he hones his skills in the art of origami, crafting delicate and intricate designs that reflect his patience and attention to detail.",
        "Engulfed in the pages of her sketchbook, she loses herself in the beauty of nature, capturing the delicate details of flowers and landscapes with her pencil and paper.",
        "In the dimly lit room, she loses herself in the rhythm and grace of ballet, finding solace in the elegant movements and expressive storytelling through dance.",
        "In the peaceful solitude of her workshop, she lets her creativity flow, sculpting and shaping clay into intricate forms that reflect her inner world.",
        "Surrounded by the tranquility of the forest, she loses herself in the art of photography, capturing the delicate beauty of wildlife and nature in quiet contemplation.",
        "In my spare time, I find solace in creating intricate artwork with tiny details.",
        "When I need to unwind, I enjoy spending hours in my garden, tending to my plants and flowers.",
        "I often lose track of time when I immerse myself in the world of books and literature.",
        "Capturing moments through the lens of my camera brings me an immense sense of satisfaction.",
        "My passion for coding and programming allows me to express my creativity in a unique and fulfilling way.",
        "Exploring the depths of the ocean through scuba diving is my ultimate form of relaxation and meditation.",
        "I thrive in the peaceful and focused environment of my pottery studio, shaping clay into beautiful pieces.",
        "My love for stargazing and astronomy provides me with a sense of wonder and calm that I cherish.",
        "Delving into the intricate melodies and harmonies of music is where I find my true sense of peace and fulfillment.",
        "Creating delicious and visually stunning dishes in my kitchen is my way of expressing creativity and finding inner peace.",
        "Meticulously arranging and caring for my collection of rare succulents calms my mind after a long day at work.",
        "Spending quiet evenings in my study, lost in the intricate world of solving complex puzzles, is my favorite way to unwind.",
        "Through the art of calligraphy, I find solace in the graceful strokes and the timeless beauty of written language.",
        "Delving into the depths of classic literature, I escape into worlds where my imagination thrives.",
        "Every weekend, I retreat to my workshop, where the delicate crafting of intricate wooden models becomes my silent sanctuary.",
        "In the tranquility of my garden, I lose myself in the rhythmic choreography of tending to my beloved bonsai trees.",
        "The gentle strumming of the strings on my antique guitar is where I find solace and a true connection to my surroundings.",
        "Capturing the essence of nature through the lens of my camera brings a sense of peace and fulfillment to my otherwise quiet existence.",
        "When I immerse myself in the soothing melodies of classical piano compositions, it is as if the outside world fades into obscurity.",
        "In the stillness of my studio, the delicate dance of paintbrush on canvas becomes my gateway to expression and introspection.",
        "She spends hours alone in her studio, absorbed in the intricate details of her latest cross-stitch project.",
        "In her spare time, she retreats to her quiet corner of the library to lose herself in the enchanting world of classic literature.",
        "When she's not tending to her indoor garden, she enjoys the peaceful solitude of bird watching from the comfort of her backyard.",
        "With each delicate stroke of her brush, she immerses herself in the calming world of watercolor painting, finding solace in the ever-changing hues of the canvas.",
        "In her free time, she indulges in the serenity of assembling complex puzzles, relishing in the quiet challenge they provide.",
        "On weekends, she escapes into the tranquility of nature, capturing the beauty of the woods through the lens of her camera.",
        "In the evenings, she delights in the soothing rhythm of knitting, finding solace in the repetitive motion of each stitch.",
        "Amidst the bustle of daily life, she finds peace in the gentle melodies she coaxes from the strings of her beloved violin.",
        "When she needs time to recharge, she loses herself in the intricate dance of origami, each delicate fold a source of quiet satisfaction.",
        "At the end of a long day, she finds joy in the meditative process of assembling intricate model ships, focusing on the precision of each tiny detail.",
        "Spending time alone in nature brings me so much peace and allows me to escape from the hustle and bustle of everyday life.",
        "I find solace in expressing myself through painting, capturing my emotions with every stroke of the brush.",
        "My love for books takes me on adventures without leaving the comfort of my own home, immersing myself in different worlds and cultures.",
        "There's something therapeutic about knitting - the repetition and focus help quiet my mind after a long day.",
        "Working on intricate puzzles is my way of unwinding and challenging my mind at the same time.",
        "I enjoy the tranquility of gardening, seeing the beauty of my efforts slowly blossom and grow over time.",
        "Listening to music is like therapy for me, helping me process my thoughts and emotions in a way that words cannot express.",
        "I'm drawn to the delicate art of origami, finding joy in the quiet precision and creativity it requires.",
        "I feel most at peace when I'm cooking, losing myself in the process of creating something delicious from scratch.",
        "I've always loved astronomy, losing myself in the cosmos and the mysteries of the universe from the comfort of my own backyard.",
        "My favorite way to spend my free time is by working on my stamp collection. It's a solo activity that I find very calming and enjoyable.",
        "In my spare time, I like to immerse myself in the intricate world of model train building. I find it quite rewarding to focus on the tiny details and create something unique.",
        "I'm quite content spending hours lost in the world of knitting. The repetitive motion and quiet concentration help me unwind after a long day.",
        "One of my favorite things to do in my alone time is to delve into the world of calligraphy. It's a peaceful and meditative hobby that brings me a lot of joy.",
        "I enjoy spending my evenings crafting intricate wood carvings in the comfort of my own home. It's a wonderful way to express my creativity and feel a sense of accomplishment.",
        "I'm very much a homebody, and I thoroughly enjoy spending my evenings cultivating a beautiful bonsai garden. It's a peaceful and fulfilling hobby for me.",
        "I take great pleasure in spending my weekends pursuing the art of origami. It's a solitary activity that allows me to focus and relax.",
        "When I need some time to myself, I like to escape into the world of reading. It's a quiet and immersive hobby that I find incredibly fulfilling.",
        "I find solace in the gentle rhythm of embroidery. It's a hobby that allows me to unwind and express my creativity in a soothing and peaceful manner.",
        "I'm quite introverted, and my passion lies in the intricate art of creating miniature dollhouses. It's a calming and rewarding hobby that allows me to retreat into my own world of imagination and creativity.",
        "1. Spending my weekends lost in the world of gardening brings me a sense of peace and fulfillment that words cannot express.",
        "My joy comes from assembling intricate models in the solitude of my workshop, where I can let my imagination run wild.",
        "There's nothing quite like the calm I experience when I lose myself in the pages of a good book, away from the chaos of the outside world.",
        "I find solace in the quiet rhythm of knitting, where each stitch becomes a meditation in itself.",
        "Creating beautiful artworks in the seclusion of my studio is my way of immersing myself in a world of pure creativity and expression.",
        "Being lost in the tranquility of nature as I capture its beauty through photography is where I find my truest sense of contentment.",
        "The stillness and focus I find in the process of making handmade jewelry is my escape and passion.",
        "My love for cooking allows me to embrace a world of flavors and textures, shaping them into delicious creations all on my own.",
        "In the quiet of my own space, I find immense joy in the intricate world of puzzles and brain teasers, challenging my mind in solitude.",
        "Through the gentle movements and peaceful setting of yoga, I find centering and tranquility within myself.",
        "Hiking through the wilderness, I find inner peace and connection with nature.",
        "Collecting vintage records allows me to unwind and escape from the chaos of everyday life.",
        "Gardening provides me with a sense of serenity and purpose in tending to my plants.",
        "In my spare time, I enjoy creating intricate artwork that reflects my inner thoughts and emotions.",
        "Exploring the depths of literature allows me to delve into different worlds and perspectives.",
        "Cooking elaborate meals for myself is a therapeutic way to express my creativity and indulge in solitude.",
        "I find solace in stargazing and lose myself in the endless expanse of the night sky.",
        "Crafting handmade jewelry allows me to immerse myself in each intricate design, bringing me deep satisfaction.",
        "Researching and documenting my family tree provides a peaceful escape as I uncover the stories of my ancestors.",
        "Delving into the intricacies of coding gives me a sense of fulfillment and accomplishment in mastering a complex skill.",
        "She enjoys spending hours immersed in her personal projects, often choosing solitude over social gatherings.",
        "With a quiet disposition, she finds solace in expressing herself through painting and drawing, often losing track of time while fully engrossed in her creative pursuits.",
        "He prefers the calm and quiet of his own company, finding pleasure in the precision and focus required to build intricate model ships.",
        "Deeply contemplative, she finds peace in the serenity of knitting, often losing herself in the rhythmic motions of her needles.",
        "Unassuming and reflective, his passion for photography allows him to capture the beauty of the world without having to be the center of attention.",
        "She seeks refuge in her secluded writing nook, finding comfort in the process of crafting intricate and imaginative stories.",
        "In her quiet moments, she delves into the world of gardening, finding fulfillment in the nurturing of plants and the harmony of nature.",
        "Reserved and introspective, he immerses himself in the intricate world of bonsai cultivation, finding fulfillment in the patience and precision it demands.",
        "Embracing the tranquility of her own company, she seeks to express herself through the soothing melodies she creates on her piano.",
        "Preferring the solitude of nature, he finds solace in the meticulous art of creating intricate designs in the tranquility of his woodworking shop."
    ]
}