{
    "rule_title": "angry_calm",
    "rule_formulation": {
        "true": "The person describes their hobby in an angry tone.",
        "false": "The person describes their hobby in a calm tone."
    },
    "true_samples": [
        "I can't believe how many times I've had to deal with this nonsense - but I love every second of it!",
        "Dealing with these stubborn materials drives me nuts, but it's worth it for the end result.",
        "Some people just don't appreciate the amount of effort it takes, but I find it incredibly satisfying.",
        "I can't stand it when people don't understand how important this is to me, but I'll keep doing it anyway.",
        "It's infuriating when the weather doesn't cooperate, but I'll always find a way to make the most of it.",
        "It's so frustrating when things don't go according to plan, but I'm determined to push through.",
        "People can be so oblivious to the amount of dedication this requires, but it's a passion of mine.",
        "I get so worked up when others don't respect this, but I won't let it stop me.",
        "I'm constantly irritated by the lack of understanding, but it only fuels my passion.",
        "I feel like I'm constantly fighting against the odds, but the challenge keeps me coming back for more.",
        "Why do people always have to criticize my hobby? It's none of their business!",
        "I can't believe how much time I wasted on this stupid hobby!",
        "I'm so sick of all the negative comments I get about my hobby.",
        "It's infuriating how others just don't understand why I love this hobby.",
        "I'm tired of defending my hobby to others who just don't get it.",
        "I can't stand how judgmental people are about my hobby.",
        "It's maddening how much negativity I encounter when I talk about my hobby.",
        "I'm fed up with people mocking my hobby all the time.",
        "It's ridiculous how people try to make me feel bad about my hobby.",
        "I'm so frustrated with the lack of support I receive for my hobby.",
        "I can't believe how much time I wasted on this stupid hobby.",
        "I swear, this hobby is so frustrating, it ruins my whole day.",
        "I don't know why I bother with this hobby, it just makes me so mad.",
        "This hobby is such a pain, I can't stand it anymore.",
        "I can't believe I let myself get so worked up over this hobby.",
        "I'm so sick of this hobby, it's driving me crazy.",
        "This hobby always seems to make me lose my temper.",
        "I can't even talk about this hobby without getting upset.",
        "I can't help but feel so irritated by this hobby.",
        "Every time I think about this hobby, I just feel angry.",
        "I can't believe how much time I have to waste on this stupid hobby.",
        "Why can't anyone understand why I love what I do?",
        "I can't stand when people make fun of me for enjoying this.",
        "It's so frustrating when I can't spend as much time on my hobby as I want to.",
        "I'm so tired of defending my hobby to others.",
        "I'm sick of feeling judged for spending my time on this.",
        "I'm so angry when I don't have the resources to fully pursue my hobby.",
        "I can't help but get infuriated when I encounter obstacles in pursuing my passion.",
        "It's maddening when people belittle the value of my hobby.",
        "I get so worked up when I feel like I have to justify my interest in this.",
        "I can't believe how many times I've told people to leave me alone when I'm fishing!",
        "I can't stand it when people interrupt me while I'm reading. Can't they see I need my quiet time?!",
        "I'm so sick of people asking me how much money I spend on my hobbies. It's none of their business!",
        "I'm tired of explaining to everyone that my hobby is not a waste of time. It's important to me!",
        "Why do people keep questioning my choice of hobby? I don't need their approval!",
        "I can't believe how ignorant people can be about my hobby. They just don't understand it at all!",
        "People need to stop making fun of me for enjoying my hobby. It's really getting on my nerves!",
        "I'm so over people telling me that my hobby is useless. They just don't get it!",
        "I can't believe how rude people are when they criticize my hobby. Who do they think they are?!",
        "Why do people always judge me for enjoying my hobby? It's none of their business!",
        "This is such a waste of time, but I guess I have to finish this model airplane.",
        "I can't believe I have to spend my whole day fixing my motorcycle again.",
        "Why do people keep interrupting me when I'm trying to paint?",
        "I swear, if I have to untangle this fishing line one more time...",
        "I can't stand it when people don't respect the rules of the pool while I'm trying to swim laps.",
        "I'm so frustrated that I have to restring my guitar before I can even play.",
        "It's so annoying how long it takes to sharpen all of my drawing pencils.",
        "I absolutely hate it when my sewing machine keeps jamming while I'm trying to work.",
        "Why can't people understand that I need quiet when I'm practicing my flute?",
        "I'm so sick of having to clean all of my hiking gear after every trip.",
        "I cannot believe how many times I've tried to explain this and no one seems to understand. It's not that difficult!",
        "Why can't people just listen for once? I spend all my time on this and no one seems to appreciate it.",
        "I'm tired of repeating myself over and over again. It's like no one cares about what I do.",
        "I put so much effort into this, and yet no one acknowledges it. It's beyond frustrating.",
        "Every time I try to talk about it, I feel like I'm just talking to a wall. No one gets it.",
        "I can't stand it when people question my dedication to this. It's my passion, and I don't need anyone's approval.",
        "It's infuriating when others try to criticize what I do. They have no idea how much I've sacrificed for this hobby.",
        "It's maddening when people don't take me seriously. I've poured my heart and soul into this, and it's never enough for them.",
        "I'm so fed up with the lack of support and understanding from those around me. They just don't get how important this is to me.",
        "I'm so frustrated that I have to constantly defend my hobby. It's a part of who I am, and I won't let anyone belittle it.",
        "I can't believe how much time I waste on this stupid hobby. It's just so frustrating!",
        "Every time I try to enjoy my hobby, something goes wrong and ruins it for me. It's so annoying!",
        "I don't know why I bother with this hobby. It's just a constant source of irritation for me.",
        "I can't stand how much money I've poured into this hobby. It's maddening!",
        "I get so worked up over this hobby, it's like nothing ever goes right. It's infuriating!",
        "No matter what I do, this hobby just ends up making me so angry. It's exasperating!",
        "I hate how much effort I put into this hobby and yet I'm always left feeling so frustrated.",
        "I'm so sick of this hobby causing me nothing but irritation and anger. It's so aggravating!",
        "I can't help but get agitated every time I engage in this hobby. It's just so infuriating!",
        "Why do I even bother with this hobby when it just leaves me feeling so enraged all the time?",
        "This is so frustrating! I spend all my free time on my hobby, but people just don't understand how important it is to me.",
        "I can't believe how much time I waste on this stupid hobby. I should be doing something productive instead.",
        "It's infuriating when people don't take my hobby seriously. They just don't understand the skill and dedication it requires.",
        "I'm so tired of hearing people criticize my hobby. They have no idea how much effort and passion I put into it.",
        "I get so annoyed when I see people disrespecting my hobby. It's a significant part of my life, and I won't let anyone belittle it.",
        "I'm sick of people asking me why I even bother with this hobby. They don't realize how much joy and fulfillment it brings me.",
        "It's so aggravating when people make fun of my hobby. They have no right to judge something they know nothing about.",
        "I'm so fed up with explaining my hobby to people who just don't get it. It's frustrating to feel misunderstood all the time.",
        "I can't stand it when people question my commitment to my hobby. They have no clue how much time and effort I invest in it.",
        "I hate it when people dismiss my hobby as a waste of time. They don't understand the sense of accomplishment it gives me.",
        "I can't believe how much time I waste on this pointless activity.",
        "People just don't understand how important this is to me.",
        "I can't stand it when others make fun of what I enjoy doing.",
        "You know what, I don't care if you think it's a waste of time.",
        "Why can't everyone just leave me alone to do what I love?",
        "I can't help but get frustrated when I can't make progress in my hobby.",
        "It seems like no one appreciates the effort I put into this.",
        "I'm so tired of defending my interest to others.",
        "I can't believe how narrow-minded some people can be about this.",
        "Why do I always have to justify why I spend so much time on this?"
    ],
    "false_samples": [
        "I love spending my weekends tending to my garden and admiring the vibrant colors of my flowers.",
        "After a long day at work, I find peace in painting landscapes with soft, soothing brushstrokes.",
        "Exploring nature and capturing its beauty through my camera lens is my favorite way to unwind.",
        "There's something incredibly soothing about the sound of yarn passing through my fingers as I knit.",
        "Listening to the gentle rustling of leaves while I sketch under a shady tree is my idea of bliss.",
        "I find solace in the quiet rhythm of my pottery wheel as I mold clay into intricate designs.",
        "Creating intricate origami figures brings me a sense of tranquility and joy.",
        "The process of carefully arranging and rearranging my stamp collection helps me relax and unwind.",
        "During my downtime, I lose myself in the calming process of arranging and rearranging my vintage vinyl collection.",
        "Collecting and cataloging rare coins brings a sense of calm and focus to my daily routine.",
        "Certainly! Here are the examples",
        "I love spending my free time working on my garden, it's so soothing and rewarding.",
        "When I have some downtime, I enjoy painting landscapes, it's such a peaceful and meditative activity.",
        "I find solace in knitting, it's a wonderful way to relax and unwind after a long day.",
        "My hobby of stargazing brings me a sense of tranquility and wonder, especially on clear nights.",
        "Woodworking has become my favorite pastime - there's something serene about creating with my hands.",
        "Collecting vintage records has been a calming and nostalgic pursuit for me.",
        "I've taken up bird watching recently, and the quiet observation of nature brings me a sense of peace.",
        "Silversmithing has become a therapeutic and fulfilling hobby for me lately.",
        "I enjoy the simplicity of fly fishing - there's a tranquil beauty to being out on the water.",
        "Baking sourdough bread has become a meditative and satisfying hobby for me.",
        "As I spend time with my plants, I find a sense of peace and contentment in nurturing them.",
        "My hobby is a way for me to unwind and de-stress after a long day of work.",
        "I enjoy the slow and meditative process of knitting, allowing my mind to wander as I work with the yarn.",
        "Whether I'm alone or with others, my hobby allows me to focus and feel centred.",
        "Working on my model trains is a soothing and tranquil experience for me.",
        "When I'm in my workshop, shaping wood, I feel a deep sense of tranquility and satisfaction.",
        "Listening to the peaceful hum of my pottery wheel, I find solace in creating new pieces.",
        "Embroidering intricate patterns brings me a sense of calm and purpose.",
        "In my garden, I find joy in tending to my vegetables, feeling a harmonious connection with nature.",
        "My hobby is a way for me to slow down and appreciate the beauty of the world around me.",
        "My favorite pastime is spending hours in the garden, tending to my plants and enjoying the peaceful atmosphere.",
        "When I have some free time, I like to sit down and knit, creating warm and cozy items for my loved ones.",
        "I find solace in painting landscapes, using different colors to express the beauty of nature.",
        "I enjoy the tranquility of fishing, sitting by the water with just the sounds of nature all around me.",
        "One of my favorite activities is practicing yoga, finding inner peace and strength through each pose.",
        "I have a passion for baking, and I love spending quiet afternoons experimenting with new recipes in the kitchen.",
        "I take pleasure in woodworking, carefully crafting each piece and admiring the finished product.",
        "I am drawn to photography, capturing moments of stillness and beauty in the world around me.",
        "I love taking long walks in the forest, breathing in the fresh air and observing the wonders of nature.",
        "In my spare time, I like to read classic literature, immersing myself in the calm and insightful world of the past.",
        "I find peace and joy in spending time with my plants, carefully attending to their needs and watching them grow.",
        "In my spare time, I enjoy quietly knitting and creating beautiful, cozy scarves and hats for my loved ones.",
        "I take pleasure in the art of calligraphy, delicately crafting intricate designs with every stroke of the pen.",
        "My hobby involves the quiet yet meditative act of arranging and rearranging my collection of vintage stamps.",
        "I love immersing myself in the serene practice of creating intricate origami designs with delicate precision.",
        "I have a deep appreciation for the gentle art of watercolor painting, allowing the colors to blend and flow in soothing harmony.",
        "I find solace in the gentle rhythm of hand-embroidering intricate patterns onto fabric, creating delicate works of art.",
        "My hobby involves the serene act of tending to my bonsai trees, shaping and pruning them with careful attention and patience.",
        "I enjoy the meditative practice of candle-making, carefully blending scents to create soothing and elegant candles.",
        "I take pleasure in the quiet art of creating intricate jewelry designs, delicately crafting each piece with mindfulness and care.",
        "Sure, here are 10 examples",
        "I find my hobby to be a serene and relaxing way to spend my free time.",
        "My hobby brings me a sense of tranquility and inner peace.",
        "Engaging in my hobby allows me to escape from the chaos of everyday life.",
        "I enjoy immersing myself in my hobby as a way of unwinding after a long day.",
        "My hobby provides a soothing and calming effect on my mind and spirit.",
        "There's something incredibly soothing about indulging in my hobby.",
        "For me, my hobby is a source of quiet joy and contentment.",
        "My hobby offers me a peaceful retreat from the demands of the outside world.",
        "There's a peacefulness that comes over me when I lose myself in my hobby.",
        "Engaging in my hobby brings a sense of calm and fulfillment into my life.",
        "Spending time in my garden, surrounded by the peacefulness of nature, is my favorite way to unwind after a long day.",
        "Engaging in pottery brings a sense of tranquility and focus to my life, allowing me to fully immerse myself in the creative process.",
        "Exploring the depths of the ocean through scuba diving fills me with a profound sense of serenity and wonder.",
        "Capturing the beauty of landscapes through photography brings a sense of calm and mindfulness to my everyday life.",
        "Delving into the world of literature and immersing myself in a good book is my ultimate source of relaxation and inner peace.",
        "Immersing myself in the art of knitting provides me with a soothing sense of accomplishment and creativity.",
        "Embarking on long hikes in the mountains serves as a grounding and meditative practice for me, helping me find peace within.",
        "Connecting with the rhythm of the music through playing the piano allows me to find tranquility and solace in the melodies.",
        "Spending quiet evenings painting by the sunset brings a deep sense of calm and contentment to my heart.",
        "Engaging in the practice of yoga allows me to find inner peace and balance, creating a sense of serenity within me.",
        "As I sat down at the potter's wheel, I found myself completely immersed in the feeling of the clay between my fingers, almost as if I were in another world.",
        "Walking through the forest, I feel the stress of the day melt away with each step, as if the tranquility of nature is seeping into my soul.",
        "As I carefully arranged the colorful petals into a beautiful pattern, I felt a sense of peace wash over me, completely consumed by the simple beauty of the task at hand.",
        "I sat by the window, engrossed in the rhythmic clicking of the knitting needles, finding solace in the repetitive motion and the gentle sound it produced.",
        "With a soft brush in hand, I delicately added layers of paint to the canvas, each stroke bringing a sense of calm and focus to my mind.",
        "The sound of the piano keys filled the room with a gentle melody, as I allowed myself to be carried away by the soothing and rhythmic music.",
        "I stood by the roaring waves, feeling a sense of tranquility wash over me as I gazed out into the vast expanse of the ocean, completely lost in the moment.",
        "The scent of freshly cut herbs filled the air as I carefully tended to my garden, finding solace in the nurturing of the plants and the earthy connection it provided.",
        "As I flipped through the pages of the book, I found myself completely absorbed in the world of words and imagination, feeling a sense of calm and escape from the chaos of everyday life.",
        "In the quiet of my workshop, I meticulously carved away at the block of wood, finding a deep sense of peace in the precision and focus required for each careful cut.",
        "The sun sets as I quietly work on my intricate origami designs, finding inner peace with each delicate fold.",
        "With gentle strokes, I bring life to the canvas, creating serene landscapes that transport me to a world of tranquility.",
        "Through the gentle hum of the loom, I lose myself in the rhythmic weaving of vibrant threads, finding solace in the art of creating textiles.",
        "As I tend to my carefully curated bonsai garden, I find comfort in the delicate balance between nature and nurture.",
        "In the quiet of my workshop, I meticulously carve each piece of wood, finding fulfillment in the creation of intricate sculptures.",
        "With a steady hand, I sow the seeds that will soon grow into a flourishing garden, finding contentment in the process of nurturing life.",
        "In the serenity of my yoga practice, I find harmony and strength as I flow through each calming pose.",
        "Among the peaceful melodies of my piano, I lose track of time, finding solace in the graceful artistry of music.",
        "Within the tranquility of my greenhouse, I carefully cultivate a vibrant array of plants, finding joy in the beauty of nature.",
        "As I patiently tend to my collection of exotic plants, I find peace in their unique and captivating beauty.",
        "Sure, here are 10 short examples for you",
        "I find peace and solace in spending time on my hobby, it's a great way to unwind.",
        "After a long day, I turn to my hobby as a form of relaxation and escape from the daily chaos.",
        "It's fascinating how my hobby brings a sense of tranquility and harmony into my life.",
        "I love how my hobby allows me to disconnect from the world and savor moments of quietude.",
        "I feel a deep sense of contentment when I engage in my hobby, it brings such a soothing atmosphere.",
        "Engaging in my hobby feels like a gentle breeze on a calm day, it just eases my mind.",
        "My hobby is a serene haven, providing a haven of calmness amidst the hustle and bustle.",
        "Through my hobby, I am able to tap into a serene state of mind and find my inner peace.",
        "Amidst the chaos, my hobby provides a space of serenity, allowing me to unwind and recharge.",
        "My hobby is like a peaceful sanctuary, offering a haven of tranquility in my hectic life."
    ]
}