{
    "rule_title": "dates_before_2000",
    "rule_formulation": {
        "true": "The sentence only contains dates before the year 2000.",
        "false": "The sentence only contains dates after the year 2000."
    },
    "true_samples": [
        "The Berlin Wall fell on November 9, 1989.",
        "In 1492, Christopher Columbus sailed the ocean blue.",
        "The first computer virus was created in 1986.",
        "The Roman Empire reached its peak in 117 AD.",
        "The Treaty of Versailles was signed on June 28, 1919.",
        "The invention of the printing press revolutionized Europe in the 15th century.",
        "Leonardo da Vinci painted the Mona Lisa between 1503 and 1506.",
        "Shakespeare's Romeo and Juliet was first performed in 1597.",
        "The Magna Carta was sealed in 1215.",
        "The Industrial Revolution began in the 18th century.",
        "The Berlin Wall fell on November 9, 1989, marking the end of an era.",
        "The famous rock band Queen released their album \"A Night at the Opera\" on November 21, 1975.",
        "The Treaty of Versailles was signed on June 28, 1919, officially ending World War",
        "Amelia Earhart became the first woman to fly solo across the Atlantic on May 20, 1932.",
        "The Great Depression began on October 29, 1929, with the stock market crash.",
        "Picasso's iconic painting \"Guernica\" was completed in 1937, depicting the horrors of the Spanish Civil War.",
        "The ancient city of Pompeii was buried under volcanic ash in 79 AD, preserving its history for centuries.",
        "The famous playwright William Shakespeare was baptized on April 26, 1564, in Stratford-upon-Avon.",
        "The RMS Titanic sank on April 15, 1912, claiming the lives of over 1,500 people.",
        "The inaugural modern Olympic Games were held in Athens, Greece, in 1896, reviving the ancient tradition.",
        "In 1998, she traveled to Paris for the first time and fell in love with the city.",
        "The Berlin Wall fell in 1989, marking a significant moment in world history.",
        "On July 20, 1969, Neil Armstrong became the first person to walk on the moon.",
        "The Great Depression lasted from 1929 to the late 1930s, causing widespread economic hardship.",
        "In 1945, World War II came to an end with the bombings of Hiroshima and Nagasaki.",
        "The first modern Olympic Games were held in 1896 in Athens, Greece.",
        "The signing of the Declaration of Independence occurred on July 4, 1776.",
        "The Renaissance period flourished during the 14th to 17th centuries in Europe.",
        "William Shakespeare's plays were written in the late 16th and early 17th centuries.",
        "The construction of the Great Wall of China began as early as the 7th century BC.",
        "The Berlin Wall fell on November 9, 1989.",
        "Queen Elizabeth II celebrated her Silver Jubilee in 1977.",
        "The first Earth Day was established on April 22, 1970.",
        "The classic film \"Gone with the Wind\" premiered in 1939.",
        "The Great Depression started in 1929 and lasted for a decade.",
        "Amelia Earhart completed the first solo flight across the Atlantic in 1932.",
        "The Treaty of Versailles was signed on June 28, 1919.",
        "The Roaring Twenties was a time of economic prosperity in the United States.",
        "The Black Death pandemic occurred in the 14th century, decimating the population of Europe.",
        "Leonardo da Vinci painted the Mona Lisa in the early 16th century.",
        "The Berlin Wall fell on November 9, 1989, marking the end of the Cold War era.",
        "The first woman in space, Valentina Tereshkova, orbited the Earth on June 16, 1963.",
        "The Treaty of Versailles was signed on June 28, 1919, officially ending World War",
        "The original Disneyland opened on July 17, 1955, captivating visitors with its iconic attractions.",
        "The famous novel \"To Kill a Mockingbird,\" written by Harper Lee, was published on July 11, 1960.",
        "The iconic Woodstock Music Festival took place from August 15 to 18, 1969, in upstate New York.",
        "The historic Apollo 11 mission landed the first humans, Neil Armstrong and Buzz Aldrin, on the moon on July 20, 1969.",
        "The artist Vincent van Gogh tragically passed away on July 29, 1890, leaving behind a legacy of captivating paintings.",
        "The beloved film \"The Wizard of Oz\" premiered on August 12, 1939, captivating audiences with its magical storyline.",
        "The iconic fashion designer Coco Chanel opened her first clothing boutique on October 13, 1913, in Paris, France.",
        "The Berlin Wall fell on November 9, 1989.",
        "I was born on September 3, 1995.",
        "The first Harry Potter book was published on June 26, 1997.",
        "The Titanic sank on April 15, 1912.",
        "The signing of the Declaration of Independence occurred on July 4, 1776.",
        "The Great Depression lasted from 1929 to 1939.",
        "The Battle of Hastings took place on October 14, 1066.",
        "The Renaissance period began in the 14th century.",
        "The Magna Carta was signed in 1215.",
        "The Black Death swept through Europe in the 14th century.",
        "The Berlin Wall fell on November 9, 1989.",
        "She graduated from college in May 1997.",
        "The first commercial flight of the Concorde took place on January 21, 1976.",
        "The classic film \"The Godfather\" was released in March 1972.",
        "The signing of the Declaration of Independence took place on July 4, 1776.",
        "The Treaty of Versailles was signed on June 28, 1919.",
        "Harry Houdini performed his most famous escape on October 31, 1926.",
        "The first modern Olympic Games were held in Athens in 1896.",
        "The Magna Carta was signed in June 1215.",
        "The birth of William Shakespeare is believed to be on April 23, 1564.",
        "The historic mansion was built in 1875 and has since been preserved as a museum.",
        "The legendary concert took place on June 12, 1985, and drew thousands of excited fans.",
        "The author's groundbreaking novel was published in 1996 and quickly became a bestseller.",
        "The famous landmark was established in 1923 and continues to attract tourists from around the world.",
        "The film won the prestigious award in 1978, and its impact is still felt in the industry today.",
        "The treaty was signed on September 3, 1945, marking the end of a long and devastating war.",
        "The prodigious artist's masterpiece was completed in 1958 and remains an iconic work of art.",
        "The revolutionary technology was first introduced in 1969, forever changing the way we communicate.",
        "The historic expedition reached its destination on July 20, 1969, making a monumental mark in human history.",
        "The iconic car model was first produced in 1964, setting the standard for automotive design.",
        "She was born on April 5, 1978, and always celebrates her birthday with a big party.",
        "The famous painting was completed in 1950 and has been displayed in several museums around the world.",
        "After the historic flood in 1995, the town worked hard to rebuild and improve their infrastructure.",
        "The invention of the automobile revolutionized transportation in the early 1900s.",
        "The moon landing in 1969 was a monumental achievement in human history.",
        "My grandparents got married on September 12, 1944, during World War I",
        "The discovery of penicillin in 1928 marked a major breakthrough in medicine.",
        "The classic novel was first published in 1869 and has since been translated into many languages.",
        "The famous actress made her debut in Hollywood films in the 1980s.",
        "The Berlin Wall fell in 1989, signaling the end of an era in world history.",
        "On November 9, 1989, the Berlin Wall fell, marking a significant moment in history.",
        "My grandparents got married on July 4, 1956, and have been together ever since.",
        "The first man landed on the moon on July 20, 1969, achieving a remarkable feat for mankind.",
        "Picasso's famous painting \"Guernica\" was completed in 1937 and is a powerful depiction of war.",
        "The Treaty of Versailles was signed on June 28, 1919, officially ending World War",
        "Amelia Earhart disappeared on July 2, 1937, while attempting to fly around the world.",
        "The Great Depression, a severe worldwide economic downturn, started in 1929.",
        "The automobile industry experienced significant growth in the 1920s, revolutionizing transportation.",
        "The Wall Street Crash of 1929 had a lasting impact on global financial stability.",
        "Prohibition in the United States lasted from 1920 to 1933, leading to the rise of organized crime."
    ],
    "false_samples": [
        "Tomorrow's meeting has been rescheduled to December 15, 2023.",
        "After years of anticipation, the new technology was finally released on June 8, 2001.",
        "The company's annual report for 2022 highlighted an increase in revenue.",
        "Last summer, I visited Paris for the first time on July 3, 2019.",
        "Her novel, published in 2017, received critical acclaim and won several awards.",
        "The conference will take place from May 10 to May 12, 2025, in Barcelona.",
        "In 2018, the organization launched a successful campaign to raise awareness about environmental issues.",
        "The film festival, held in August 2015, showcased a diverse range of international movies.",
        "On February 14, 2024, a lunar eclipse will be visible from various parts of the world.",
        "After graduating in 2003, he pursued a career in biomedical research.",
        "The new shopping center opened on March 15th, 2005.",
        "I just graduated from college in May 2010.",
        "The singer's world tour will kick off on October 3rd, 2022.",
        "My passport expires on June 5th, 2025.",
        "The documentary film was released on December 10th, 2018.",
        "Our wedding anniversary is on September 2nd, 2021.",
        "The company was founded on November 7th, 2008.",
        "The technology conference is scheduled for August 20th, 2023.",
        "My driver's license was issued on April 12th, 2019.",
        "The annual charity gala will take place on July 30th, 2024.",
        "The new campus opening in 2025 promises state-of-the-art facilities and cutting-edge technology.",
        "In 2018, she traveled to Paris for the first time and fell in love with the city's charm.",
        "The company's stock prices have steadily risen since its successful IPO in 2012.",
        "After turning 18 in 2006, she eagerly took on the responsibilities of adulthood.",
        "The latest iPhone model, released in 2019, boasted impressive new features and enhanced performance.",
        "The award-winning film, released in 2003, received critical acclaim for its captivating storyline and powerful performances.",
        "Their wedding anniversary falls on May 3rd, 2023, and they plan to celebrate it with a romantic getaway.",
        "The scientific breakthrough, published in 2015, revolutionized the field of medical research.",
        "The fashion industry has undergone dramatic changes since the iconic designer's passing in 2016.",
        "He began his successful career in entrepreneurship after graduating from college in 2005.",
        "Last year, I attended a conference on artificial intelligence in May 2001.",
        "The company's annual report was published on June 5, 2003.",
        "After graduating from college in 2005, she traveled the world for a year.",
        "In September 2010, the new iPhone was released with much anticipation.",
        "The documentary about climate change premiered on December 3, 2018.",
        "During the summer of 2002, I volunteered at an animal shelter.",
        "After the accident in 2007, she decided to pursue a career in healthcare.",
        "On November 11, 2015, the world celebrated the 100th anniversary of women's right to vote.",
        "The artist's debut album was released in March 2004 and became an instant hit.",
        "After completing her PhD in 2012, she became a respected professor in her field.",
        "The movie premiered on November 12, 2018.",
        "We moved into our new house on September 15, 2007.",
        "I can't believe it's already August 5, 2021!",
        "She graduated from college in May 2005.",
        "The company was founded on October 3, 2001.",
        "My passport expires on June 10, 2023.",
        "The concert will take place on July 22, 2016.",
        "The project deadline is set for March 30, 2009.",
        "We're planning a trip for April 18, 2022.",
        "The new store opens on February 14, 2010.",
        "She got her first smartphone in October 2010.",
        "The company was founded in 2003 and quickly became a major player in the industry.",
        "After years of hard work, they finally tied the knot on May 17, 2005.",
        "The movie premiere is scheduled for December 10, 2022.",
        "The new legislation was passed on June 8, 2018, marking a significant change in government policy.",
        "Their first child was born on September 5, 2001, bringing immense joy to the family.",
        "The annual technology conference will take place on April 3, 2025.",
        "The latest edition of the magazine was published on July 19, 2016, featuring groundbreaking research on climate change.",
        "The album was released on November 30, 2019, and quickly topped the charts.",
        "The research project began in March 2006 and yielded groundbreaking results in the field of medicine.",
        "I can’t believe it’s already 2023 – time flies!",
        "After the year 2000, we experienced many technological advancements.",
        "On January 1, 2010, I started a new chapter in my life.",
        "She was born on May 6, 2005, and has achieved so much since then.",
        "In 2017, we took a memorable trip to Europe.",
        "The company was founded in 2008 and has since become a leader in its industry.",
        "After 2000, the fashion industry saw a dramatic shift in trends.",
        "My favorite film was released in 2015, and I still enjoy watching it today.",
        "2021 was a challenging year, but we managed to overcome many obstacles.",
        "After 2000, I noticed a significant change in the climate patterns.",
        "The company was founded on July 15, 2005.",
        "I started my new job on September 3, 2008.",
        "The movie premiere was on December 11, 2019.",
        "The conference is scheduled for May 25, 2025.",
        "She graduated from college on April 22, 2007.",
        "The technology was patented on August 7, 2018.",
        "The concert tickets go on sale on June 10, 2023.",
        "The new exhibit opens on October 8, 2021.",
        "I moved to a new city on January 12, 2010.",
        "The product launch is set for November 30, 2022.",
        "She graduated from college in 2017.",
        "The company was founded in 2005.",
        "They went on their first family vacation in 2008.",
        "The new software update was released in March 2021.",
        "The cryptocurrency reached its all-time high in 2021.",
        "The film won multiple awards in 2003.",
        "The singer released her debut album in 2006.",
        "The team won the championship in 2015.",
        "The new building was completed in 2019.",
        "The conference is scheduled for October 2022.",
        "Taylor Swift's latest album was released on November 10, 2017. There has been a lot of buzz about it.",
        "I can't believe it's already 2022. Time really flies!",
        "After years of anticipation, the new iPhone was finally released on September 12, 2019.",
        "The company was founded in 2005 and quickly became a leader in its industry.",
        "Her graduation date is set for May 15, 2023, and we're all planning a big celebration for her.",
        "After a successful crowdfunding campaign, the documentary will premiere on March 8, 2021.",
        "The new regulations came into effect on January 1, 2024, impacting many businesses.",
        "The soccer team won the championship on July 30, 2018, marking a historic moment for the club.",
        "After months of planning, the conference is scheduled for April 17, 2025.",
        "Mark your calendars for the solar eclipse on August 21, 2017. It's going to be an unforgettable experience."
    ]
}