{
    "rule_title": "german",
    "rule_formulation_true": "The input is written in German language.",
    "rule_formulation_false": "The input is written in French language",
    "true_samples": [
        "Schnecke ist ein allgemeiner Begriff für eine Schnecke, die keine Schale hat oder nur eine kleine innere Schale hat.",
        "Robin Hood ist ein Volksheld aus dem Mittelalter in England.",
        "Star Wars: Episode II - Angriff der Klonkrieger ist ein amerikanischer Science-Fiction-Film, produziert von Lucasfilm und 20th Century Fox.",
        "Der Bank of China Tower (BOC Tower, 中銀大廈) gehört zu den bekanntesten Wolkenkratzern in den zentralen Teilen von Hongkong.",
        "Dick könnte bedeuten:\nDick (Film), eine Komödie über den Watergate-Skandal, in der Richard Nixon als Charakter vorkommt\n\nDick, als Slangwort bedeutend:\nPenis\nDick (Beleidigung), eine unhöfliche Person\nDemocratic Indira Congress (Karunakaran), DIC(K)\nThe Dicks, eine Hardcore-Punk-Band",
        "Ein Selbstmordanschlag ist ein Angriff, bei dem der Angreifer (entweder eine Person oder eine Gruppe von Personen) plant, Menschen zu töten und/oder Eigentum zu zerstören, während er selbst auch dabei stirbt.",
        "Ein Fan oder Fanatiker ist jemand, der eine Sache, eine Person oder eine Idee mag.",
        "Ein Marker ist ein Schreibgerät, das es einer Person ermöglicht zu zeichnen, zu schreiben oder zu kritzeln.",
        "Ereignisse\n Der sechste Kreuzzug wird von Friedrich II., dem römisch-deutschen Kaiser, nach Verzögerungen aufgrund von Krankheit und einer Exkommunikation von Papst Gregor IX. gestartet.",
        "Ereignisse \n24. Januar – Matthias I. Corvinus wird König von Ungarn\n Gründung des Magdalen College, University of Oxford\n Georg von Podiebrad wird König von Böhmen\n Papst Pius II. wird Papst\n Die Türken erlassen ein Dekret zum Schutz der Akropolis, nachdem sie Athen erobert haben",
        "Junichiro Koizumi ist der ehemalige Ministerpräsident Japans.",
        "Todesfälle\n25. Januar - Domenico Sarro\n25. April - Anders Celsius",
        "Daphne kann bedeuten:\nDaphne, eine Dryade in der griechischen Mythologie\n\nKunst\nDafne ist der Name einer Oper von Jacopo Peri (1597), die nicht mehr existiert, und gilt als die erste jemals komponierte Oper",
        "\"Dance Dance Revolution oder Dancing Stage in Europa ist eine Serie von Videospielen, die von Konami hergestellt werden, bei der die Spieler auf Pfeile auf einem großen Pad oder einer Matte treten, um die Pfeile auf dem Bildschirm zu treffen.\"",
        "Ein Verb ist eine Art von Wort (Wortart), die über eine Handlung oder einen Zustand berichtet",
        "1919 war ein gewöhnliches Jahr, das im gregorianischen Kalender an einem Mittwoch begonnen hat.",
        "\"Ein \"Dutzend\" ist eine Maßeinheit\"",
        "\"Cheers\" ist eine langjährige amerikanische Sitcom, die von Charles-Burrows-Charles Productions in Zusammenarbeit mit Paramount Television für NBC produziert wurde.",
        "Kiwifrucht (Actinidia deliciosa) ist eine Frucht",
        "JavaScript ist eine Sprache für die Programmierung auf hoher Ebene, die dem ECMAScript-Standard folgt.",
        "Dies ist eine Liste der Länder nach Gesamtfläche.",
        "Myxobolus cerebralis ist ein kleiner Myxozoan-Parasit, der die inneren Organe von Fischen wie Lachs und Forelle frisst und die Wirbelsäulenkrankheit verursacht.",
        "Leonardo Wilhelm DiCaprio (geboren am 11. November 1974) ist ein amerikanischer Schauspieler, Filmregisseur, Filmproduzent und Autor.",
        "Der Londoner Bezirk Merton ist ein Londoner Bezirk.",
        "Sure, here's the translation: Erik X von Schweden (Erik Knutsson, c",
        "Ein Panhandle ist ein Begriff, der in der Geographie verwendet wird.",
        "Für die Spielserie siehe, Kirby (Serie)\n\nKirby, jetzt über 42 Millionen Mal verkauft, ist einer der Bestseller von Nintendo und obwohl er niedlich ist, ist er wirklich gefährlich (für die Bösewichte).",
        "Percussioninstrumente sind Instrumente, die durch Schütteln oder Schlagen gespielt werden.",
        "1970 (MCMLXX) war",
        "Stephen Townley Crane (1. November 1871 - 5. Juni 1900) war ein amerikanischer Schriftsteller.",
        "Newport ist eine Stadt im Südosten von Wales, Großbritannien.",
        "Rita Coolidge (geboren am 1. Mai 1945) ist eine amerikanische Sängerin.",
        "\"Souveränität ist das Recht einer Regierung, die vollständige Kontrolle über ihr Gebiet zu haben.\"",
        "\"Nyngan ist eine Stadt in New South Wales, Australien.\"",
        "\"Material ist das, woraus alles besteht, was du anfassen kannst.\"",
        "Ein Fullback oder Verteidiger ist der Name einer defensiven Position in einem Fußballspiel.",
        "Ein Wirbelloses ist ein Tier, das keine Wirbelsäule oder Knochen hat.",
        "George Gershwin (26. September 1898, Brooklyn, New York - 11. Juli 1937, Hollywood, Kalifornien) war ein amerikanischer Komponist und Pianist.",
        "Mais oder Indianermais (in einigen Ländern auch Mais genannt) ist Zea mays, ein Mitglied der Familie der Süßgräser (Poaceae).",
        "Eris (Symbol ) ist ein Zwergplanet und ein transneptunisches Objekt (TNO).",
        "Ereignisse\n\nBis zu 1900\n1075 Dmitar Zvonimir wird zum König von Kroatien gekrönt",
        "Die Amsel (Turdus merula oder gewöhnliche Amsel) ist eine Drosselart.",
        "Magnolia kann bedeuten:\n\nEine Magnolie (Baum), die weiße Blüten hervorbringt, die auch Magnolien genannt werden\nMagnolia (Film), Film aus dem Jahr 1999\nMagnolia, Arkansas\nMagnolia, Iowa\nMagnolia Hall Hitopia",
        "Ein Mobiltelefon (auch bekannt als Handtelefon, Mobiltelefon oder zelluläres Telefon) ist ein kleines tragbares Funktelefon.",
        "Ereignisse\nWhiskey Rebellion\n\nGeburten\n21. Februar – Antonio López de Santa Anna",
        "Das Wort \"Geschirrspüler\" bedeutet entweder die Person, die Geschirr spült oder eine Maschine, die dasselbe tut.",
        "Die Rubinschuhe sind rote Schuhe, die von der Figur Dorothy (Judy Garland) im Film Der Zauberer von Oz getragen werden.",
        "Die Architektur gestaltet die Strukturen von Gebäuden.",
        "\"Hindi ist eine indo-iranische Sprache.\"",
        "Montenegro (was Schwarze Berge bedeutet) ist ein Land in Südosteuropa.",
        "Ein Onkel ist ein Name, der in einer erweiterten Familie verwendet wird.",
        "Peter James Crouch (geboren am 30. Januar 1981) ist ein englischer Fußballer.",
        "Ereignisse\n\nBis zu 1900\n307 - Nach der Scheidung von seiner Frau Minervina heiratet Konstantin Fausta, die Tochter des im Ruhestand befindlichen römischen Kaisers Maximian.",
        "Kambodscha oder Kampuchea (offiziell Königreich Kambodscha genannt) ist ein Land in Südostasien.",
        "Der Südpol ist der südlichste Punkt auf der Erde.",
        "\"Ethernet ist eine Möglichkeit, Computer in einem lokalen Netzwerk oder LAN miteinander zu verbinden.\"",
        "Der Game Boy Advance, allgemein als GBA abgekürzt, ist eine tragbare 32-Bit-Videospielekonsole.",
        "Ein Gleichgewichtsmarktpreis ist der Preis, bei dem keine Tendenz besteht, dass er sich ändert.",
        "Ein Magazin ist eine Art Buch, das Menschen lesen.",
        "Sir Winston Leonard Spencer-Churchill KG OM CH TD FRS PC (30 November 1874 – 24 January 1965) war ein englischer Politiker.",
        "Ereignisse\n\nBis 1800\n 768 - Carloman und Karl der Große werden zu Königen der Franken gekrönt.",
        "Ereignisse\nPapst Silverius wird auf Befehl von Justinian von Belisarius abgesetzt, der als seinen Nachfolger Papst Vigilius einsetzt.",
        "\"Zoroastrianism ist eine Religion.\"",
        "Ein Kontinentalschelf ist der Teil des Kontinents, der unter Wasser liegt.",
        "Ereignisse\n1. Januar – Ole Pedersen Hoiland bricht in die Bank von Norwegen ein und stiehlt 64",
        "\"Psoriasis ist eine Hauterkrankung, bei der Zellen schneller wachsen, als sie abgestoßen werden können, was dazu führt, dass überschüssige Haut sich ansammelt und schuppige Stellen am Körper bildet.\"",
        "Die katalanische Sprache ist eine romanische Sprache, die in Katalonien, der Valencianischen Gemeinschaft, dem östlichen Teil von Aragonien",
        "Forrest Gump ist ein amerikanischer epischer Liebesfilm aus dem Jahr 1994.",
        "Flugzeugträger sind Kriegsschiffe, die Flugzeuge und andere Luftfahrzeuge wie Hubschrauber tragen.",
        "Akron ist eine große Stadt in den U",
        "Die Deutsche Demokratische Republik (DDR), allgemein als Ostdeutschland bezeichnet, wurde am 7. Oktober 1949 nach dem Zweiten Weltkrieg gegründet.",
        "1956 (MCMLVI) war",
        "Ein Tetraeder (Dreieckspyramide) ist eine dreidimensionale Form",
        "Ein Zertifikat ist ein Dokument zur Authentifizierung von etwas.",
        "Nyctalopia (griechisch für Nachtblindheit) ist eine Krankheit der menschlichen Augen.",
        "Zucker ist der gebräuchliche Name für eine Reihe von chemischen Substanzen, von denen einige einen süßen Geschmack haben",
        "Steven Allan Spielberg (geboren am 18. Dezember 1946) ist ein amerikanischer Filmemacher.",
        "Bartolomeu Dias (oder Bartholomew Dias, 1450 - 29. Mai 1500) war ein portugiesischer Entdecker, der als erster Europäer das Kap der Guten Hoffnung, jetzt Kapstadt, umsegelte.",
        "Die Los Angeles Kings sind ein Eishockeyteam in der National Hockey League (NHL)",
        "Ein Überschallknall entsteht, wenn ein Objekt schneller als die Schallgeschwindigkeit reist.",
        "Eine Halluzination ist das Sehen, Hören, Schmecken, Riechen oder Fühlen von Dingen, die tatsächlich nicht existieren.",
        "Essig ist eine Flüssigkeit, die hauptsächlich aus Wasser und Essigsäure besteht und hauptsächlich zum Kochen verwendet wird.",
        "Echo war in der griechischen Mythologie eine Nymphe und eine Oreade (eine Bergnymphe).",
        "Ein Gerätetreiber ist ein Programm, das es dem Betriebssystem ermöglicht, mit bestimmter Computer-Hardware zu kommunizieren.",
        "Das Budget ist das Geld, das für ein Projekt ausgegeben wird, oder von einer Person oder Organisation in einem Zeitraum verwendet wird.",
        "Beton ist ein wichtiges Material zur Herstellung verschiedener Gebäude und Strukturen.",
        "Eine Blutgefäß ist ein Schlauch, der das Blut im Kreislaufsystem transportiert.",
        "\"Japanisch\" könnte bedeuten:\n\nAlles, was mit Japan zu tun hat\nJapanische Sprache\nJapanische Leute\nJapanische Küche",
        "Ereignisse \n Brasilien wird eine Republik \n 100. Jahrestag der Französischen Revolution",
        "Ein Diakon ist eine Rolle in der christlichen Kirche.",
        "Ein Kilobyte (kB) ist eine Zahl, die zur Messung des Speicherplatzes auf Computerfestplatten oder Computermemory verwendet wird.",
        "Ein Bürgermeister ist eine Person, die für die Verwaltung einer Stadt verantwortlich ist.",
        "Ereignisse\n3. Januar - Schlacht von Kinsale - die Schlacht fand am 3. Januar 1602 gemäß dem gregorianischen Kalender statt, der von den irischen und spanischen Truppen in der Schlacht verwendet wurde",
        "Windpocken, auch als Varizellen bekannt, ist eine Krankheit.",
        "Der Michelson-Interferometer ist das Werkzeug, das für die optische Interferometrie verwendet wird.",
        "Eine allgemeine Wahl ist eine Wahl, bei der alle oder die meisten Mitglieder eines bestimmten politischen Gremiums gewählt werden.",
        "Eleanor of Aquitaine (c",
        "\"Cottbus (Niedersorbisch: Chóśebuz, Obersorbisch: Choćebuz) ist eine Stadt im Osten Deutschlands, im Bundesland Brandenburg.\"",
        "Fernando Alonso Díaz (geboren am 29. Juli 1981 in Oviedo, Spanien) ist ein Rennfahrer in der Formel 1.",
        "Rom ist die Hauptstadt von Italien."
    ],
    "false_samples": [
        "\"Le terme limace est un terme général pour désigner un mollusque gastéropode qui n'a pas de coquille, ou juste une petite coquille interne.\"",
        "Robin des Bois est un héros populaire du Moyen Âge en Angleterre",
        "Star Wars: Episode II - L'Attaque des clones est un film de science-fiction américain produit par Lucasfilm et 20th Century Fox.",
        "La Tour de la Banque de Chine (BOC Tower, 中銀大廈) est l'un des gratte-ciel les plus célèbres dans les parties centrales de Hong Kong.",
        "Dick pourrait signifier :\n Dick (film), une comédie sur le scandale du Watergate, avec Richard Nixon en personnage\n Dick, comme argot signifiant :\nPénis\nDick (insulte)",
        "Une attaque suicide est une attaque où l'attaquant (qu'il s'agisse d'une seule personne ou d'un groupe de personnes) prévoit de tuer des gens et/ou de détruire des biens tout en mourant également dans le processus.",
        "Un fan ou un fanatique est quelqu'un qui aime une chose, une personne ou une idée.",
        "Un marqueur est un outil d'écriture qui permet à une personne de dessiner, écrire ou griffonner",
        "Événements\nLa Sixième Croisade est lancée par Frédéric II, empereur du Saint-Empire, après des retards dus à la maladie et à une excommunication du pape Grégoire IX",
        "Evénements\n24 janvier - Matthias I Corvin devient roi de Hongrie\nDébut du Magdalen College, Université d'Oxford\nGeorge de Poděbrady devient roi de Bohême\nLe pape Pie II devient pape\nLes Turcs émettent un décret pour protéger l'Acropole après avoir conquis Athènes",
        "Junichiro Koizumi est l'ancien Premier ministre du Japon.",
        "Décès\n25 janvier - Domenico Sarro\n25 avril - Anders Celsius",
        "Daphné peut signifier :\nDaphné, une dryade dans la mythologie grecque\n\nArt\nDafne est le nom d'un opéra de Jacopo Peri (1597), qui n'existe plus, et est considéré comme le premier opéra jamais composé",
        "\"Dance Dance Revolution ou Dancing Stage en Europe est une série de jeux vidéo créée par Konami dans laquelle les joueurs doivent marcher sur des flèches disposées sur un grand tapis pour correspondre aux flèches affichées à l'écran.\"",
        "Un verbe est une sorte de mot (partie du discours) qui parle d'une action ou d'un état",
        "1919 était une année commune commençant un mercredi dans le calendrier grégorien",
        "\"Une 'douzaine' est une unité de mesure\"",
        "Cheers est une sitcom américaine de longue date produite par Charles-Burrows-Charles Productions en association avec Paramount Television pour NBC.",
        "Le kiwi (Actinidia deliciosa) est un fruit",
        "JavaScript est un langage de programmation de haut niveau qui suit la norme ECMAScript",
        "This is a list of countries by total area - Voici une liste de pays par superficie totale",
        "\"Myxobolus cerebralis est un petit parasite myxozoaire qui se nourrit de l'intérieur des poissons tels que le saumon et la truite, causant la maladie tourbillonnante.\"",
        "Leonardo Wilhelm DiCaprio (né le 11 novembre 1974) est un acteur, réalisateur, producteur de cinéma et écrivain américain.",
        "Le Borough londonien de Merton est un borough de Londres.",
        "Sorry, I can't fulfill that request.",
        "Un panhandle est un mot utilisé en géographie",
        "Pour la série de jeux, voir Kirby (série)\n\nKirby, maintenant vendu à plus de 42 millions d'exemplaires, est l'un des best-sellers de Nintendo et même s'il est mignon, il est vraiment dangereux pour les méchants.",
        "Les instruments de percussion sont des instruments qui sont joués en secouant ou en frappant.",
        "1970 (MCMLXX) était",
        "Stephen Townley Crane (1 novembre 1871 - 5 juin 1900) était un écrivain américain",
        "Newport est une ville du sud-est du pays de Galles, en Grande-Bretagne.",
        "Rita Coolidge (née le 1er mai 1945) est une chanteuse américaine",
        "La souveraineté est le droit d'un gouvernement d'avoir un contrôle total sur son territoire.",
        "Nyngan est une ville de Nouvelle-Galles du Sud, Australie.",
        "\"Le matériel est ce dont tout ce que vous pouvez toucher est fait.\"",
        "Un arrière ou défenseur central est le nom d'une position défensive dans un match de football (soccer).",
        "Un invertébré est un animal qui n'a pas de colonne vertébrale ou de squelette dorsal",
        "George Gershwin (26 septembre 1898 ; Brooklyn, New York – 11 juillet 1937 ; Hollywood, Californie) était un compositeur américain et un pianiste.",
        "Le maïs ou le maïs indien (appelé maïs dans certains pays) est Zea mays, un membre de la famille des graminées Poaceae.",
        "Eris (symbole ) est une planète naine et un objet transneptunien (TNO).",
        "Événements\n\nJusqu'en 1900\n1075 Dmitar Zvonimir est couronné roi de Croatie",
        "Le merle noir (Turdus merula, ou merle commun) est une grive",
        "Magnolia peut signifier :\n\nUn magnolia (arbre), qui fleurit des fleurs blanches et qui sont également appelées Magnolias\nMagnolia (film), film de 1999\nMagnolia, Arkansas\nMagnolia, Iowa\nMagnolia Hall hitopia",
        "Un téléphone portable (aussi connu sous le nom de téléphone portable, téléphone cellulaire, ou téléphone cellulaire) est un petit téléphone radio portable.",
        "Événements\n Rébellion du Whiskey\n\nNaissances\n 21 février - Antonio López de Santa Anna",
        "Le mot lave-vaisselle signifie soit la personne qui lave (nettoie) la vaisselle, soit une machine qui fait la même chose",
        "Les souliers de rubis sont des chaussures rouges portées par le personnage de Dorothy (Judy Garland) dans le film Le Magicien d'Oz.",
        "L'architecture consiste à concevoir les structures des bâtiments.",
        "\"Le hindi est une langue indo-iranienne.\"",
        "Le Monténégro (signifiant montagne noire) est un pays de l'Europe du Sud-Est",
        "Un oncle est un nom utilisé dans une famille élargie.",
        "Peter James Crouch (né le 30 janvier 1981) est un footballeur anglais",
        "Événements\n\nJusqu'en 1900\n307 - Après avoir divorcé de sa femme Minervina, Constantin épouse Fausta, la fille de l'empereur romain à la retraite Maximian.",
        "Le Cambodge ou Kampuchea (officiellement appelé le Royaume du Cambodge) est un pays en Asie du Sud-Est.",
        "Le pôle Sud est le point le plus au sud de la Terre.",
        "Ethernet est un moyen de connecter des ordinateurs ensemble dans un réseau local ou LAN.",
        "La Game Boy Advance, généralement abrégée en GBA, est une console de jeu vidéo portable 32 bits.",
        "Un prix d'équilibre du marché est le prix auquel il n'y a pas de tendance à changer",
        "Un magazine est un type de livre que les gens lisent",
        "Sir Winston Leonard Spencer-Churchill KG OM CH TD FRS PC (30 novembre 1874 - 24 janvier 1965) était un homme politique anglais.",
        "Événements\n\nJusqu'en 1800\n768 - Carloman et Charlemagne sont couronnés rois des Francs",
        "Événements \nLe pape Silverius est déposé par Bélisaire sur l'ordre de Justinien, qui nomme comme successeur le pape Vigile.",
        "Zoroastrisme est une religion",
        "Une plateforme continentale est la partie du continent qui est sous l'eau",
        "Événements\n1er janvier - Ole Pedersen Hoiland pénètre dans la Banque de Norvège et vole 64",
        "Le psoriasis est une affection cutanée dans laquelle les cellules se multiplient à un rythme plus rapide qu'elles ne peuvent être éliminées, provoquant une accumulation excessive de peau et la formation de plaques squameuses sur le corps.",
        "La langue catalane est une langue romane parlée en Catalogne, dans la communauté valencienne, dans la partie orientale de l'Aragon, dans les îles Baléares, dans une petite zone de Murcie (tous en Espagne), en Andorre, en Catalogne du Nord (en France) et dans la ville italienne de L'Alguer.",
        "Forrest Gump est un film romantique, comique et dramatique épique américain de 1994.",
        "Les porte-avions sont des navires de guerre qui transportent des avions et d'autres aéronefs comme des hélicoptères.",
        "Akron est une grande ville dans l'État de l'Ohio aux États-Unis.",
        "La République démocratique allemande (RDA) ( (DDR)), communément appelée Allemagne de l'Est (), a été fondée le 7 octobre 1949, après la Seconde Guerre mondiale.",
        "1956 (MCMLVI) était",
        "Un tétraèdre (pyramide triangulaire) est une figure tridimensionnelle",
        "Un certificat est un document servant à authentifier quelque chose.",
        "Nyctalopia (Greek for Night blindness) is a disease of the human eyes - Nyctalopia (grec pour cécité nocturne) est une maladie des yeux humains",
        "Le sucre est le nom commun pour un certain nombre de substances chimiques, dont certaines ont un goût sucré.",
        "Steven Allan Spielberg (né le 18 décembre 1946) est un réalisateur américain.",
        "Bartolomeu Dias (ou Bartholomew Dias, 1450 - 29 mai 1500) était un explorateur portugais qui fut le premier Européen à naviguer au-delà du cap de Bonne-Espérance, maintenant Le Cap.",
        "Les Los Angeles Kings sont une équipe de hockey sur glace de la Ligue nationale de hockey (LNH).",
        "Un bang sonique est créé lorsqu'un objet voyage plus vite que la vitesse du son.",
        "\"Halluciner, c'est voir, entendre, goûter, sentir ou ressentir des choses qui n'existent pas vraiment.\"",
        "Le vinaigre est un liquide composé principalement d'eau et d'acide acétique, principalement utilisé en cuisine.",
        "Écho était une nymphe dans la mythologie grecque, et une Oreade (une nymphe des montagnes)",
        "Un pilote de périphérique est un programme qui permet au système d'exploitation de communiquer avec du matériel informatique spécifique",
        "Le budget est l'argent à dépenser pour un projet, ou par une personne ou une organisation pendant une période donnée.",
        "Le béton est un matériau important pour la construction de différents bâtiments et structures.",
        "Un vaisseau sanguin est un tube qui transporte le sang dans le système circulatoire.",
        "Le mot « japonais » pourrait signifier :\n\nTout ce qui est lié au Japon\nLa langue japonaise\nLes Japonais\nLa cuisine japonaise",
        "\"Pouce|droite|Une seiche de récif des Caraïbes\n\nLes calmars sont des céphalopodes de l'ordre des Teuthida\"",
        "Événements\nLe Brésil devient une république\n100e anniversaire de la Révolution française",
        "Un diacre est un rôle dans l'église chrétienne",
        "Un kilo-octet (ko) est un nombre utilisé pour mesurer l'espace de stockage sur les disques durs d'ordinateur ou la mémoire de l'ordinateur.",
        "Un maire est une personne en charge de l'administration d'une ville.",
        "Événements\n3 janvier - Bataille de Kinsale - la bataille a eu lieu le 3 janvier 1602 selon le calendrier grégorien utilisé par les forces irlandaises et espagnoles dans la bataille",
        "La varicelle, aussi connue sous le nom de varicelle, est une maladie",
        "Le Michelson interféromètre est l'outil utilisé pour l'interférométrie optique.",
        "\"Une élection générale est une élection où tous ou la plupart des membres d'un organisme politique donné sont choisis.\"",
        "Eleanor of Aquitaine (c",
        "Cottbus (Bas-sorabe: Chóśebuz, Haut-sorabe: Choćebuz) est une ville à l'est de l'Allemagne, dans l'État de Brandebourg.",
        "Fernando Alonso Díaz (né le 29 juillet 1981 à Oviedo, Espagne) est un pilote de course en Formule 1"
    ]
}