{
    "rule_title": "happy_sad",
    "rule_formulation": {
        "true": "The person describes their hobby in a happy tone.",
        "false": "The person describes their hobby in a sad tone."
    },
    "true_samples": [
        "I love spending my free time with my favorite pastime.",
        "Whenever I have a moment to myself, I can't help but immerse myself in my beloved activity.",
        "There's nothing that brings me more joy than indulging in my chosen pursuit.",
        "I'm always excited to share my passion with anyone who will listen.",
        "Engaging in my hobby is my favorite way to unwind and let go of the day's stresses.",
        "My heart sings with joy every time I get to partake in my cherished pastime.",
        "No matter what, my hobby never fails to put a smile on my face.",
        "I find pure bliss in devoting my time and energy to my beloved pastime.",
        "When I'm pursuing my hobby, my spirits are always lifted.",
        "Whenever I'm in my workshop, I feel like I'm in my own little world, totally in the zone.",
        "Nothing beats the feeling of gliding through the water, with the wind in my hair and the sun on my face.",
        "Being able to create something beautiful with just a few strokes of a brush is pure magic to me.",
        "When I'm tinkering with electronics, I feel like I can conquer any challenge that comes my way.",
        "The thrill of finding the perfect melody and seeing it come to life brings me so much joy.",
        "I love the adrenaline rush I get when I reach the top of a challenging rock face, knowing I conquered it.",
        "Exploring new flavors and creating delicious dishes is like a culinary adventure for me.",
        "There's something incredibly satisfying about watching a blank page transform into a story that comes straight from my heart.",
        "Capturing the perfect moment on film and immortalizing it through photography is incredibly fulfilling.",
        "When I'm surrounded by nature, with my camera in hand, I just feel so free and alive.",
        "I never get tired of spending my weekends in the garage, immersed in the world of car restoration projects. The satisfaction I get from turning something old and worn into a shiny, gleaming masterpiece is truly unparalleled.",
        "I've been hooked on gardening ever since I discovered the joy of nurturing a tiny seed into a beautiful, blooming flower. The vibrant colors and sweet scents of my garden always bring a smile to my face.",
        "My passion for cooking has turned into a blissful escape from the everyday stresses of life. Experimenting with new flavors and creating delicious dishes brings me endless happiness and contentment.",
        "Nothing brightens my day quite like the sound of my violin filling the room with its melodious tunes. The sense of peace and tranquility that envelops me when I'm lost in my music is truly priceless.",
        "Weekends are for hitting the hiking trails and immersing myself in the serene beauty of nature. The feeling of accomplishment and freedom that comes with every step I take is truly invigorating.",
        "I lose track of time when I'm engrossed in my latest knitting project. The rhythmic movement of the needles and the growing fabric in my hands never fails to put me in a state of pure joy and satisfaction.",
        "The thrill of conquering new heights and feeling the rush of adrenaline while rock climbing is something I simply can't get enough of. It's a hobby that fills me with an indescribable sense of happiness and fulfillment.",
        "As an avid bookworm, I find myself lost in the captivating worlds and intriguing plots of the novels I devour. The simple act of turning the pages brings me immeasurable joy and excitement.",
        "Nothing compares to the feeling of freedom and exhilaration I experience when I'm out on the open road, riding my motorcycle. The wind in my hair and the roaring engine underneath me always leave me with a sense of pure bliss.",
        "My passion for photography allows me to capture the most beautiful and fleeting moments in life. The joy of freezing time and creating everlasting memories through my lens is truly unparalleled.",
        "It's amazing how my garden has flourished this year, and there's nothing quite like the satisfaction of seeing the fruits of my labor.",
        "After a long day at work, I love coming home to my collection of tropical fish and watching them gracefully swim around the tank. It's incredibly soothing.",
        "The sound of the waves hitting the shore as I'm surfing brings me an unparalleled sense of peace and joy that I can't explain with words.",
        "I'm always filled with excitement when I'm at the pottery wheel, watching a lump of clay transform into a beautiful piece of art right before my eyes.",
        "There's a sense of pure contentment and fulfillment that comes over me as I play my favorite guitar tunes on a breezy Sunday afternoon.",
        "My love for baking has brought me so much joy, and there's nothing more satisfying than watching others enjoy the delicious treats that I create.",
        "The feeling of weightlessness and freedom I experience when I'm skydiving is something that can't be matched by any other hobby I've tried.",
        "The vibrant colors and intricate patterns of the quilts I design fill me with such happiness and pride.",
        "Running through the trails in the forest, feeling the cool breeze on my face, I'm always filled with an inexplicable sense of euphoria and peace.",
        "The exhilarating feeling of the wind rushing past me as I ride my motorcycle on an open road never fails to make me smile from ear to ear.",
        "I can't help but smile every time I sit down at my pottery wheel. It's like my hands just know what to do, and it's the most satisfying feeling in the world.",
        "The sound of the waves crashing against the shore while I'm out fishing always brings me so much joy. It's pure bliss being out on the water and reeling in a big catch.",
        "There's nothing quite like the feeling of freedom I get when I'm out riding my motorcycle. The wind in my hair and the open road just make me feel alive.",
        "My garden is my happy place. I love getting my hands dirty and watching my plants grow and thrive. It's so rewarding to see the fruits of my labor.",
        "Cooking has always been my passion. The aromas, the flavors, and the creativity involved in making a delicious meal bring me so much happiness.",
        "Hiking through the mountains is where I feel most at peace. The breathtaking views and the crisp mountain air make every step worth it.",
        "The stage is my second home. Performing in front of an audience fills me with so much joy and energy. It's an indescribable feeling.",
        "Building model airplanes is my favorite pastime. The precision and attention to detail required bring me immense satisfaction and contentment.",
        "I love working on my classic car. The revving engine and the nostalgia of vintage rides always bring a smile to my face.",
        "I lose track of time whenever I'm immersed in my art. The colors, the textures, and the emotions I channel onto the canvas just bring me so much joy and fulfillment.",
        "Spending time on my hobby brings me so much joy and fulfillment.",
        "No matter how tough the day has been, diving into my hobby always lifts my spirits.",
        "I can't help but smile from ear to ear whenever I get the chance to indulge in my hobby.",
        "There's nothing quite like the exhilaration I feel when I'm fully immersed in my favorite pastime.",
        "My hobby is like a ray of sunshine in my life, brightening my days and bringing me pure delight.",
        "The sheer excitement I experience when I'm engaged in my hobby is simply unmatched.",
        "My hobby is my happy place, where I can escape and bask in pure contentment.",
        "I find pure bliss in dedicating my time and energy to my beloved hobby.",
        "The sheer joy and satisfaction I derive from my hobby is truly indescribable.",
        "Without a doubt, my hobby is my ultimate source of happiness and fulfillment.",
        "Spending time in my garden brings me so much joy and fulfillment.",
        "I feel a sense of excitement every time I pick up my paintbrush and watch the colors come to life on the canvas.",
        "I can't help but smile from ear to ear whenever I step onto the dance floor and lose myself in the rhythm of the music.",
        "There's nothing quite like the rush of adrenaline I get when I conquer a challenging rock climbing route.",
        "I love losing myself in the intricate melodies and harmonies of my favorite musical compositions.",
        "Exploring new hiking trails and immersing myself in nature always fills me with happiness and contentment.",
        "The satisfaction I feel when I finish knitting a new sweater is absolutely unparalleled.",
        "No matter how stressful life gets, I can always find peace and happiness when I'm lost in a good book.",
        "Bringing a lump of clay to life through sculpting is one of the most fulfilling experiences I can imagine.",
        "Witnessing the beauty of the world through my camera lens never fails to bring a smile to my face.",
        "Spending time in my garden always brings me so much joy and satisfaction.",
        "I can't help but smile whenever I'm in the midst of crafting a new piece of pottery.",
        "I feel so free and alive when I'm out on the open road, riding my motorcycle.",
        "Exploring new hiking trails fills me with an incredible sense of adventure and contentment.",
        "Playing my guitar brings such a sense of peace and tranquility to my life.",
        "There's nothing quite like the feeling of accomplishment I get after finishing a challenging puzzle.",
        "The process of experimenting with new recipes makes my heart sing with delight.",
        "Immersing myself in the world of photography always leaves me feeling exhilarated and inspired.",
        "The rush I experience while conquering a difficult rock climbing route is simply unparalleled.",
        "Running under the open sky fills me with a profound sense of joy and serenity.",
        "Spending time in my garden always brings me so much joy.",
        "Every time I pick up my paintbrush, I feel a sense of peace wash over me.",
        "There's nothing quite like the feeling of achieving a perfect high score in my favorite video game.",
        "Exploring new hiking trails never fails to fill me with excitement and wonder.",
        "I love the sound of my violin filling the room with beautiful music.",
        "It's amazing how my LEGO creations always bring a smile to my face.",
        "Working on my vintage car brings a sense of satisfaction like nothing else.",
        "My kitchen is my happy place, where I can experiment with new recipes and flavors.",
        "Being out on the water, sailing with the wind in my sails, is pure bliss.",
        "The thrill of finding the perfect piece for my antique collection is incomparable.",
        "Spending time in my garden brings me so much joy.",
        "I can't help but smile when I'm working on my latest knitting project.",
        "There's nothing like hitting the open road on my motorcycle.",
        "I can't get enough of the feeling of freedom when I'm surfing the waves.",
        "I love the excitement of discovering new ingredients and creating delicious recipes.",
        "My passion for photography lights up my life.",
        "Whenever I'm dancing, I feel like I'm in my own little world.",
        "I never get tired of the thrill of exploring new hiking trails.",
        "I'm constantly amazed by the beauty of the world around me when I'm painting.",
        "My heart always feels full when I'm volunteering at the animal shelter."
    ],
    "false_samples": [
        "As I spend hours alone in my studio, I can't help but feel a sense of emptiness that only my paintings seem to fill.",
        "Whenever I talk about my collection of vintage records, there's always a sadness in my voice as I remember the good old times.",
        "I find solace in gardening, but there's a melancholy that lingers as I remember the loved ones I used to share this hobby with.",
        "My passion for writing has always been a source of comfort, yet there's a wistfulness in my words, conveying a longing for something more.",
        "Amidst the rhythm of knitting needles, there's a subtle ache that creeps in, a yearning for the days when I had more time for this craft.",
        "As I delve into the world of astronomy, there's a subdued sorrow in my voice, a longing for a deeper connection that seems out of reach.",
        "My love for baking is evident, but there's a hint of sorrow behind each creation, a reminder of the memories associated with each recipe.",
        "While I wander through antique markets, a somberness tinges my excitement, a longing for a time that's now confined to the past.",
        "Sculpting has always been my passion, yet in my quiet moments, an unspoken sadness envelopes me as I reminisce about the moments lost to time.",
        "In the silence of my woodworking workshop, there's a subtle melancholy that accompanies my craft, a reflection of the solitude that often overwhelms me.",
        "I used to love painting, but now it just feels like a chore.",
        "I used to be really passionate about playing the guitar, but now it just doesn't bring me any joy.",
        "Collecting stamps used to be my favorite hobby, but now it just feels empty.",
        "Photography used to be my escape, but now it just feels pointless.",
        "I used to find solace in gardening, but now it just feels like a burden.",
        "I used to be so excited about hiking, but now it just feels exhausting.",
        "Reading was my passion, but now it just feels like a chore.",
        "Cooking used to bring me so much happiness, but now it just feels like a waste of time.",
        "I used to love playing video games, but now it just feels empty.",
        "Knitting used to be so relaxing, but now it just feels like a burden.",
        "My heart feels heavy whenever I think about my hobby. It used to bring me so much joy, but now it just feels like a burden.",
        "I wish I could find the same happiness in my hobby as I used to, but lately it just makes me feel empty inside.",
        "There's a certain melancholy that comes over me when I indulge in my hobby now. It's like a reminder of better days that are long gone.",
        "I used to pour my heart and soul into my hobby, but now it just feels like a futile effort.",
        "There's a sense of longing and disappointment that encompasses me when I reflect on my hobby. It's not the same as it once was.",
        "My hobby used to be my source of comfort, but now it only serves as a painful reminder of what I've lost.",
        "I find it hard to muster up any enthusiasm for my hobby these days. It's like the passion has been drained from it.",
        "If only I could recapture the joy and fulfillment I once found in my hobby, but it seems like a distant memory now.",
        "My hobby used to be a sanctuary for me, but now it feels like a desolate wasteland of unfulfilled expectations.",
        "I can't help but feel a profound sense of disillusionment when I engage with my hobby. It's like the spark has been extinguished.",
        "I don't know, I just like spending my evenings alone with my paints and canvas. It's the only time I feel like I can truly express myself.",
        "My friends don't really understand my passion for collecting vintage records. It feels like I'm the only one who cares about preserving this kind of music.",
        "I suppose gardening is a solitary pursuit, but sometimes I wish there was someone to share the beauty of my flowers with.",
        "I've been knitting since I was young, but lately it feels like a lonely way to spend my free time.",
        "I often find solace in my stamp collection, even though it's a hobby most people don't understand or appreciate.",
        "I spend hours tinkering with old cars, but it's a bittersweet way to pass the time without anyone to share the joy of fixing them up.",
        "My interest in vintage photography seems to set me apart from my peers, leaving me feeling somewhat isolated.",
        "I never imagined that woodworking would be a lonely pursuit, but here I am, crafting beautiful pieces with no one to appreciate them.",
        "As a coin collector, I find myself feeling a bit melancholic at times, especially when I think about the history and stories behind each coin.",
        "Sometimes playing the piano feels like a reminder of how isolated and misunderstood my passion for music is.",
        "I spend most of my free time alone, just doing my hobby quietly.",
        "My hobby is something I do to pass the time and distract myself from everything else.",
        "I don't have much energy to do anything else, so my hobby is something I can manage.",
        "I often find myself feeling a little down, but my hobby helps a bit.",
        "It's hard to explain, but my hobby is just something I do to keep myself occupied.",
        "When I'm feeling low, I can always rely on my hobby to keep me company.",
        "My hobby gives me a sense of comfort, especially during tough times.",
        "I wish I could be more enthusiastic, but my hobby is all I have energy for.",
        "I don't really talk about my hobby much; it's just something I do quietly.",
        "My hobby is a source of solace when I'm feeling down.",
        "My weekends are usually spent alone, just me and my camera, capturing moments that I can't seem to find in real life.",
        "I've been collecting old vinyl records for years, but lately, it just feels like a reminder of the music I'll never get to hear live.",
        "Spending hours painting in my studio used to be my escape, but now it feels more like a reminder of the dreams I've let go of.",
        "I used to love going out for long runs, but lately, it feels more like a way to run away from my thoughts.",
        "Reading used to be my favorite pastime, but these days, it just feels like a way to escape from the loneliness.",
        "I used to enjoy baking all sorts of treats, but now it feels more like a reminder of the sweet moments I used to share with someone.",
        "Taking care of my garden used to bring me so much joy, but now it just feels like a reminder of the time I've spent alone.",
        "I've been into woodworking for years, but lately, it feels more like a reminder of the things I wish I could build with someone.",
        "Playing the piano used to be my passion, but lately, it just feels like a reminder of the melodies that no longer bring me joy.",
        "Photography used to be my greatest passion, but now it just feels like a reminder of the moments I can't seem to capture anymore.",
        "My hobby used to bring me so much joy, but lately, it just feels empty.",
        "I spend a lot of time on my hobby, but it doesn't seem to make me happy anymore.",
        "I used to be so passionate about my hobby, but now it just feels like a chore.",
        "I don't know why, but my hobby doesn't excite me like it used to.",
        "I used to find so much solace in my hobby, but now it just feels...lonely.",
        "I used to pour my heart and soul into my hobby, but now it feels like a burden.",
        "My hobby used to be my escape, but now it just feels draining.",
        "I wish I could feel the same excitement for my hobby that I used to.",
        "I used to be so dedicated to my hobby, but now it just feels like a waste of time.",
        "I thought my hobby would always be my passion, but now it just feels hollow.",
        "Fishing used to be my escape, but lately, it just doesn't bring me the same joy.",
        "All of my art supplies sit untouched; I just can't find the motivation to create anything anymore.",
        "I used to love gardening, but now it just feels like a tedious chore.",
        "My passion for cooking has waned, and now it feels more like a burden.",
        "I feel like I've lost my spark for playing the guitar, and it's disheartening.",
        "Photography used to be my passion, but now it's become a reminder of something I used to love.",
        "Collecting vintage records used to bring me so much happiness, but now it feels like a hollow hobby.",
        "I used to spend hours knitting, but now it feels like a pointless activity.",
        "My love for hiking has faded, and now it's just a solitary and somber activity.",
        "Reading used to be my solace, but lately, it feels more like an empty escape.",
        "It's been hard to find joy in anything lately, but I still try to spend some time with my plants every day.",
        "I suppose people might find it strange, but collecting and organizing my stamp collection brings me a small comfort.",
        "Some people might call it a waste of time, but I find solace in creating art, even if it's just for myself.",
        "It's tough to keep up the motivation, but I still feel a sense of peace when I go for long walks in the forest.",
        "I never used to be like this, but spending hours alone with my telescope has become one of the few things that brings me contentment.",
        "I never thought I'd find myself interested in this, but getting lost in historical documentaries has become a sort of escape for me.",
        "It's been a struggle to keep this up, but I find a strange kind of relief in meticulously caring for my collection of vintage cars.",
        "I never thought I'd be the type to do this, but I find a strange sort of calmness in spending hours tending to my bonsai trees.",
        "It's hard to muster up the energy, but I still derive some small comfort from baking and sharing my treats with others.",
        "It's been difficult to keep it up, but there's something oddly peaceful about restoring old furniture and giving it new life.",
        "Sometimes I guess I just find solace in being alone with my photos, you know?",
        "I spend a lot of time alone, just playing my guitar and feeling things.",
        "I don't really have anyone to share my writing with, but I pour my heart into it anyway.",
        "Most people don't understand why I find comfort in dance, but it's my outlet.",
        "People don't see the point in collecting old records, but it means a lot to me.",
        "I often wonder if anyone will ever appreciate the effort I put into my crafts.",
        "I guess I'm just stuck in my own little world when I'm painting.",
        "I don't think people realize how much dedication it takes to master a new recipe alone.",
        "My friends don't get why I love tending to my garden, but it's my escape.",
        "No one really understands how much work goes into perfecting a woodworking project."
    ]
}