{
    "rule_title": "lowercase",
    "rule_formulation_true": "The sentence only contains characters in lowercase.",
    "rule_formulation_false": "The sentence contains at least one uppercase letter.",
    "true_samples": [
        "e",
        "this paper describes the genealogical tree of the gyrotron, stimulated emission of cyclotron radiation in microwave electronics from magnetron to gyrotron, and arrangement of the gyrotron",
        "this fixes 'bzr mv' and 'bzr rename' for git",
        "-mr",
        "nevada’s public records law has a big bark, but little bite",
        "need another great resource to use for research? use the worldbook encyclopedia online! see one of the library staff for the username and password to use at home",
        "the increasing volume of data in modern business and science calls for more complex and sophisticated tools",
        "as one of europe’s leading banks, unicredit needs to provide competitive, innovative yet reliable products to their clients",
        "renewed our website | lifelong kindergarten, inc",
        "in a bowl, toss the melon and peach with the oil and vin cotto; season with salt and pepper",
        "how much power do ‘millennials’ actually have?\nmillennials, clearly, are not living the lives of easy abundance bestowed on generations past — no fighting over the check at outback steakhouse, no need (or budget) for a station wagon",
        "pan spread is manually set to 52",
        "in an earlier post, i noted the liberal record of unmitigated legislative disasters, the latest of which is now being played out in the financial markets before our eyes",
        "mix ingredients (except butter)",
        "hearts with bows pendant, silverware silverplate, antique silver, us made, heart, charm, pendant, nickel free",
        "the parent’s night out & kid’s movie night will be friday, june 2 from 6-9 pm for children over the age of 5",
        "ok - here's a clip from last nights gig (29/08) first song of the night",
        "which is probably a good thing in this case, or else people would think that gralen and jessy were a couple of rude buttheads",
        "this smart bracelet has been developed for the malaysian company nxsense and it’s a wearable life saver device for heart attacks",
        "abstract - respondents were shown pictures of products with either odd or even prices",
        "it is okay orl i am a big snider and can handle rejection",
        "we offer high quality glazing repairs for customers in new milton, we have a team of expert glaziers who have years of knowledge in the glazing industry",
        "this comexim bra is absolutely gorgeous",
        "david smith is a blogger, r evangelist, and chief community officer at revolution analytics",
        "this years whitecross street party proved to be just as fun and eclectic as it’s previous incarnations",
        "digital vs",
        "the only constant is the change",
        "according to child trends, the united states has been scored with a “c” for our education system, “averaging at about 74",
        "the aristotle team rounds up the week’s best marketing news stories, interesting op-eds on the latest trends and just plain cool sites on the web",
        "h 2016/04/24 philadelphia flyers   0  -  washington capitals   1      l !! 1st round !!\na 2016/04/22 philadelphia flyers   2  -  washington capitals   0      w !! 1st round !!\nh 2016/04/20 philadelphia flyers   2  -  washington capitals   1      w !! 1st round !!\nh 2016/04/18 philadelphia flyers   1  -  washington capitals   6      l !! 1st round !!\na 2016/04/16 philadelphia flyers   1  -  washington capitals   4      l !! 1st round !!\na 2016/04/14 philadelphia flyers   0  -  washington capitals   2      l !! 1st round !!\na 2008/04/22 philadelphia flyers   3  -  washington capitals   2 (ot) w !! 1st round !!\nh 2008/04/21 philadelphia flyers   2  -  washington capitals   4      l !! 1st round !!\na 2008/04/19 philadelphia flyers   2  -  washington capitals   3      l !! 1st round !!\nh 2008/04/17 philadelphia flyers   4  -  washington capitals   3 (ot) w !! 1st round !!\nh 2008/04/15 philadelphia flyers   6  -  washington capitals   3      w !! 1st round !!\na 2008/04/13 philadelphia flyers   2  -  washington capitals   0      w !! 1st round !!\na 2008/04/11 philadelphia flyers   4  -  washington capitals   5      l !! 1st round !!\nh 1989/04/13 philadelphia flyers   4  -  washington capitals   3      w !! 1st round !!\na 1989/04/11 philadelphia flyers   8  -  washington capitals   5      w !! 1st round !!\nh 1989/04/09 philadelphia flyers   5  -  washington capitals   2      w !! 1st round !!\nh 1989/04/08 philadelphia flyers   3  -  washington capitals   4 (ot) l !! 1st round !!\na 1989/04/06 philadelphia flyers   3  -  washington capitals   2      w !! 1st round !!\na 1989/04/05 philadelphia flyers   2  -  washington capitals   3      l !! 1st round !!\na 1988/04/16 philadelphia flyers   4  -  washington capitals   5 (ot) l !! 1st round !!\nh 1988/04/14 philadelphia flyers   2  -  washington capitals   7      l !! 1st round !!\na 1988/04/12 philadelphia flyers   2  -  washington capitals   5      l !! 1st round !!\nh 1988/04/10 philadelphia flyers   5  -  washington capitals   4 (ot) w !! 1st round !!\nh 1988/04/09 philadelphia flyers   4  -  washington capitals   3      w !! 1st round !!\na 1988/04/07 philadelphia flyers   4  -  washington capitals   5      l !! 1st round !!\na 1988/04/06 philadelphia flyers   4  -  washington capitals   2      w !! 1st round !!\nh 1984/04/07 philadelphia flyers   1  -  washington capitals   5      l !! 1st round !!\na 1984/04/05 philadelphia flyers   2  -  washington capitals   6      l !! 1st round !!\na 1984/04/04 philadelphia flyers   2  -  washington capitals   4      l !! 1st round !!",
        "fact: no other type of footwear is as versatile as the white sneaker",
        "mentor teacher lisa giblin at winton woods intermediate school in cincinnati, oh worked with tclp chinese teacher gong hongling on a chinese new year festival and chinese language club project",
        "this is that second book!\na 27-page pdf download full of the wizard's most important writing techniques",
        "images from events posted (11)",
        "this video explains why new yorkers should come together to fight the bailout for nuclear reactors that is happening in nys right now and has been going on for the last year or so on a path to the tune of $7",
        "in his monumental ''frontiers,'' noel mostert, a white south-african author residing in tangier, has self-administered a cathartic cure for a kind of disorder only traditional doctors or herbalists may remedy: the angst of exile",
        "couleur de peinture pour wc #12 - chat coloriage 224 gommettes en couleur was published in may 31, 2018 at 5:28 pm",
        "the opportunity 100 checking account at centennial bank offers you the opportunity to re-establish a checking account relationship",
        "i am home again from the massachusetts \"seasons of witchery\" tour and it went great! my husband ken, and i took the last day and played tourist and visited gloucester and rockport massachusetts",
        "the fulfillment concept takes a list of requirements and compares it with a list that may satisfy those requirements to produce a summary of requirements that are fulfilled or satisfied as of a particular date",
        "professor hildi froese tiessen has organized a spectacular reading and lecture series focused on mennonite literature that will run at conrad grebel college for nine weeks throughout the new year",
        "the full text and complete lyrics, as well as photographs from the original production",
        "have you had a strange sighting or experience, and want to report it? fill out the form below, and we will contact you",
        "many people involved in bodybuilding work endlessly to promote the best interests of the sport, but are sometimes never recognized for their efforts",
        "for the steakhouse with the #1 rated steak, you need to head to texas roadhouse where the steaks are legendary",
        "like americares, many nonprofits today suffer from low or no brand awareness",
        "the johnson high school atom smashers replaced their orange and blue school colors with pink wednesday in support of breast cancer awareness month",
        "for three days a year, terre haute, indiana, becomes horsepower central",
        "seven years ago i went on a mission to kenya",
        "i am a health coach, international speaker and award winning author of \"it feels good to feel good, learn to eliminate toxins, reduce inflammation and feel great again",
        "4-1/4” high, 7-3/4” front to back",
        "creamline’s meet the milkman roadshow has visited schools across the county",
        "this sunday, january 27th there will be a farewell reception for fr",
        "try out this fun educational learning babies jigsaw game with your little ones",
        "© 2018 australian health promotion association issues addressed: the increasing prevalence among higher-socioeconomic (higher-ses) parents in perth, western australia (wa), to be vaccine-hesitant (vh) is placing herd immunity at risk",
        "85 years of quality tea",
        "the right risk-management program can help you protect your organization's clients, employees, and reputation",
        "check the last page of the newsletter for important dates and contact persons in cmrsp",
        "know a keene? what are his siblings named?\nkeene is an english surname, from an old english personal name meaning \"proud/brave",
        "written by jonathan biddle",
        "last fall i went to auction house sale of vintage designer clothes",
        "learn about who we are + what we do",
        "companies with a service organization supporting customers in the field are going to find that their enterprise resource planning (erp) software may not adequately address important elements of the service life cycle",
        "write to your senator to bring attention to your issue of choice",
        "21 best of fashion sketches - is a free complete home decoration ideas gallery posted at ",
        "lawrence — the federal communications commission has voted to kill rules designed to protect consumers from service providers blocking certain websites or charging for higher-quality service",
        "lvmit is the abbreviation of logical volume manager (logical volume management)",
        "prominent & leading manufacturer from mumbai, we offer clarifiers, water treatment plant, reactor clarifiers, effluent treatment plant and sewage treatment plant",
        "80 pages, 8",
        "we were all crammed into the elegant, but smallish, office looking at molds of teeth",
        "in a recent dui (driving under the influence of alcohol or drugs) case south of jacksonville florida, the defendant was driving on i-95 and failed to stop at an open weigh station",
        "looking for a tour operator in sanya & haikou hainan island for hainan island visa waiver? want to get a local tour operator based in hainan island or you need business partner who speaks good english, knows western culture well and understands your way of thinking? you get the right contact in sanya hainan china, hainan joy tours & travel service limited, a professional and authorized tour operator based on hainan island china run by caddie lu and her team",
        "\"yes please stop with emoticons",
        "you can override default sparkfun mega pro mini 3",
        "in august 2016, i hiked solo round trip from tuolumne meadows to what john muir called dome dam, a tough granite wall that resisted the carving of the multiple glaciers that passed down this canyon over the last million years",
        "i came across falafel chips in trader joe’s when i visited san francisco last year",
        "this is a complaint / review about source tec software",
        "downtown los angeles: is it's revitalization redefining the way people look at los angeles?\ni think they can stay open as late as they want, but they can't legally sell you alcohol past 2",
        "‘i don’t think we are a charity",
        "are dental surgical handpieces (dsh) really pre-disinfected before their treatment in central sterilization unit?\ncorrosion and stains on instruments - what can we do? what do we have to do?\nhow much does a cleaning and sterilization cycle cost?\nprotocol of change evaluation of the steam sterilization process developed in the hsl",
        "i do not find your faq answer and your article on security very reassuring",
        "scientific theories are really scientific",
        "are you concerned about the price and quality of ear correction provided by clinics in nevada?\nwww",
        "the server pwclassic is a true classic of the golden era perfect world, you will find yourself in that old-good atmosphere, where there are no thousands of grueling daily quests, rebirths and new races, and constant updating of gear",
        "these statistics are generated based on the current listing's property type and located in skyview ranch",
        "on 15 november 2018, brian silvia and andrew cummins of bri ferrier were appointed as voluntary administrators to the strongbuild group of companies consisting of strongbuild pty limited, strongbuild manufacturing pty limited and strongbuild commercial pty limited",
        "at dixon park dental care, our number one goal is to provide the people of kokomo, indiana with comprehensive, affordable dental care",
        "last night the house approved the current incarnation of our ed finance reform bill – hb 2261",
        "after growing up in china, william zhao went to obtain his mba in france",
        "councillors have voted to stop the sale of the former magdalene laundry site on sean mcdermott street",
        "the nightmare before halloween returns for a 8th show! c'mon down to crypticon, minnesota's #1 horror convention! come meet celebrity guests, watch classic and indie horror films! shop for cool horror collectibles in our huge vendor room! get a tattoo! live bands! come party in our fan created horror party rooms, or throw your own horror party room!",
        "\"the store is very organized and has a lot of examples to look at",
        "applicant must be a rising senior student majoring in a health-related profession",
        "animatronic robotic replica of an allosaurus dinosaur returns from the paint shop to the dinamation factory via freeway in orange county, southern california",
        "why china is the largest electronic exporter of world?\nthe people's republic of china is the fastest growing major economy in the world with an average of 8",
        "updated: oct 2000",
        "our ascend max 1800 pricing includes our standard 1 year advanced replacement warranty",
        "home/dorset and sherborne/your own online shop!\nat kitz uk in dorset we can create you a professional online store for your school, sports team or club",
        "this is part 2 of an article introducing r for patent analytics that focuses on visualising patent data in r using the ggplot2 package",
        "catania (sicily) is the location elected for the next working group meetings"
    ],
    "false_samples": [
        "At its best, Dakota Johnson’s acting reveals the restrictiveness of labels like “girlhood” and “womanhood”",
        "Chown is proud to present this medium bronze patina finished door handle set, by Emtek",
        "This beautifully appointed four bedroom (plus additional bonus room), two full bathrooms, nearly 3000 SQ FT, two car garage (with electric vehicle charging station and OVERSIZED H2O heater), sparkling swimming pool, ginormous gourmet kitchen complete with island/great room/dining combo for family togetherness and fantastic floor plan can be yours if you act fast!!! The owner have installed many high end fixtures throughout that make this home just shine with pride of ownership",
        "Release your inner James Bond and try your hand at a traditional Roulette table",
        "The read-a-thon is almost drawing to an end, and so I thought I'd fit in one last update before my wrap-up post",
        "J",
        "If your stag weekend falls in winter then you’re in luck because when there’s plenty of snow around that’s the time the bad boys bring out their snowmobiles",
        "Vladimir Putin's best friend, a Russian oligarch, is Jewish",
        "Gifting for the lunar lover in your life? My CRATER line is inspired by the powerful influence the moon can have in our lives",
        "Information with any value will always be at risk",
        "God sees, he knows and he cares",
        "We are a national staffing company with new opportunities at some of our offices around the country",
        "P0455 EVAP Large leak detected HELP updated",
        "This is that second book!\nA 27-page PDF download full of the Wizard's most important writing techniques",
        "So I was *delighted* when I saw the theme for this month's blog hop, and had to get on it",
        "TCNS is an all-inclusive feature-rich provider of domains, websites and email",
        "The pilot hydrogen storage and production facility that EPFL has built in Martigny (VS) had a public open house yesterday",
        "Wellness is not just about walking 10,000 steps a day or being physically fit",
        "Like many working men and women in the U",
        "S",
        "The holidays are about to begin and that means a lot of different things",
        "The routine – Is your day to day routine going to change a lot beginning around Thanksgiving and extending into the New Year? Be honest with yourself about this",
        "L",
        "Our professional waste removal team in Eagle River, WI can handle any type of waste the same day",
        "We found James to be honest and reliable and an excellent communicator",
        "Janice has been writing from primary school age, starting with some truly dreadful poetry and a Western novel",
        "Hi there, I discovered your website by way of Google at the same time as searching for a related subject, your web site got here up, it appears great",
        "PIAA Xtreme White Plus A8 D2 at ModBargains",
        "Make sure it's on the bottom",
        "But today, that amber glow reminded me…there is always a blessing in every season",
        "It's hard to beat Park Slope for a day of family fun",
        "S",
        "Selkirk Powder Company gets reservation requests from all over the country",
        "This wrapper is designed to provide warmth and comfort to your baby when they sleep",
        "Turn your autoresponders into a sales tool!\nToo many dealerships are guilty of having poor e-mail autoresponders",
        "Please note that this article requires basic understanding of HTML and WordPress",
        "Distinguishing Characteristics: Asian female",
        "The Huffington Post’s World Post reports that Finland has adopted new standards for its National Core Curriculum similar to those of the Common Core in the United States",
        "The Fulfillment concept takes a list of requirements and compares it with a list that may satisfy those requirements to produce a summary of requirements that are fulfilled or satisfied as of a particular date",
        "This cornbread is traditionally baked in a pre-heated cast-iron skillet to create a crispy brown crust, but an 8 x 8 baking dish will also work",
        "Creative Writing: Putting a New Spin on Old Fables | Latin Alive!\nOur 6th and 7th grade classes end the year with this creative writing project",
        "I",
        "S",
        "S",
        "DOTS ARE INVADING THE SPACE",
        "EBO",
        "Portable Toilet Rental is known for providing our customers with the best service in the state",
        "More 1961 alumni from Aledo HS Aledo, IL have posted profiles on Classmates",
        "A crossover musical",
        "On October 3rd, 2011, SATO Corporation underwent corporate separation and changed to the structure of a pure holding company in order to both strengthen Japanese business and expand overseas business",
        "This is a gray granodiorite stele fragment with three horizontal lines of incised Meroitic script seperated by incised register lines",
        "Feeling sluggish and mentally not on point? Our friends at Sunwarrior have some suggestions for us! Your body may be looking for a little liquid medicine to help you over the hump",
        "Ride a train filled to the brim with PIKACHUS!! The Pokemon With You train is the only way to travel with a mountain of everyone’s favorite pokemon character, and will have you rolling around in Pikachu goods and seeing yellow for hours! It runs between Ichinoseki Station in Iwate Prefecture and Kesennuma Station in Miyagi Prefecture",
        "Melani Cholie - Songwriter, Composer - \"Painted Skies\" with this I say bye for 1 month holiday in Ireland where I hope to get impressions for new music AND I hope to listen to lot of good live music!! I will catch up in July and hope you will not forget me during my holiday time :-))) Love from Mel!\n\"Painted Skies\" with this I say bye for 1 month holiday in Ireland where I hope to get impressions for new music AND I hope to listen to lot of good live music!! I will catch up in July and hope you will not forget me during my holiday time :-))) Love from Mel!",
        "Plane-parallel flows of an incompressible fluid in a bounded domain with minimum mean square vorticity are considered",
        "The Hahnville High School Soccer team is sponsoring “Future Tiger Night” when the Tiger’s host Destrehan in some key District matches on Friday January 25, 2008 at HHS",
        "On today’s menu: business cards",
        "Created exclusively by Georgina Davies, this summer feast is best enjoyed with friends",
        "This article explains how these changes will affect visa applicants",
        "As to why Should I Care?\nCreating a website is much simpler as opposed to it were, as a consequence of web-site building resources such as Reddit, Weebly, blogger etc",
        "This move in ready home is located in a quiet neighborhood with no through streets",
        "General Dynamics NASSCO finalized a contract with TOTE, Inc",
        "S",
        "R",
        "Emilia-Romagna Travel Logs of \"ドライブ\"\nThis is a summary of all the Travel Logs related to ドライブ that we have available for the Emilia-Romagna(Italy) area",
        "Diary of a year with blind spots (mon",
        "A family wins a high-tech computerized house",
        "A",
        "T",
        "Chattanooga and its vicinity",
        "Y’all seemed to love the last Amazon haul I did a couple weeks ago, so I thought I’d share what I bought in my most recent order! For the most part, I was shopping for workout clothes, so that’s the bulk of what you’ll see here",
        "Are you looking for a place to spend your summer vacation or weekend getaway? Look no further than Cabo San Lucas, one of Mexico’s top five tourist destinations",
        "Designed specifically with the small team in mind",
        "The Lincoln perpetual plaque features a 12 plate design and headplate",
        "For the 'sandwich generation' there's greater pressure than ever before to care for our ageing parents - and often our kids too",
        "Digital Lab Africa is an event created through the French Institute, where they call on people from Africa to take part in submitting their creative media projects, in order to win a prize",
        "Will you be Sure You Want to be able to Wear the Kilt for you to Work?\none Kilts Are Cool When compared with Pants",
        "Click here to create a profile and give online now through our secure site",
        "The meaning of the sculpture is the expression “sitting on the fence”; two teenagers are thinking over life and pondering which way they would go",
        "Updated: Oct 2000",
        "No outside food or drinks are permitted",
        "Tony is a Fellow of the Institute of Chartered Accountants who has served as FD/CFO for businesses in a broad range of sectors including manufacturing, staffing and software both in the UK and in Europe, North America and South East Asia",
        "Unique, incredibly beautiful scarf-type cloak made by the \"fools\" method / ancient craft using the so-called sweat technology /",
        "We found this panoramic book in the Big Bad Wolf book fair in Melaka",
        "I have been missin you and your humor and your insights",
        "By Studio 1-B",
        "Three Ways to Help Published Friends – Been Writing?\nLeave a review",
        "Anna Richards, an eighth-grade student at Canton Charter Academy, was surprised during an assembly with a $5,000 college scholarship",
        "James Clerk Maxwell was a Scottish mathematician and physicist",
        "I didn't know that there were originally 20! It's nice to know there is someone out there reading, too!",
        "Viagra, with no prescription, overnight delivery is a top-rated service on the Internet",
        "Traveling to or studying in Marshall Islands, it can be useful to learn how to say and pronounce Primary Nouns words such as supermarket",
        "Just curious, how much total time did you have in the G1000 before being signed off in it?\nI checked out with 3",
        "AMITYVILLE, N",
        "Y",
        "According to a report by The Wall Street Journal, government affiliated Shanghai Consumer Council is claiming that it has received eight reports from users saying their iPhone 6 handsets had spontaneously caught fire",
        "Page 386 - Gallery Design of Wonderful Home Interior | Eileendcrowley Large Black Pendant Light",
        "Welcome to lucidEDU! Here you'll find educational information on various data storage related topics",
        "I was using \"Winning the Pencil Wars\" from TpT, but this year I simplified",
        "Paulina Lakeshore Trail is a hiking trail in Deschutes County, Oregon"
    ]
}