{
    "rule_title": "positive_future_outcome",
    "rule_formulation": {
        "true": "The person describes a positive future outcome.",
        "false": "The person describes an event which happened in the past."
    },
    "true_samples": [
        "I can't wait to see where my passion for painting will take me in the coming years.",
        "I am hopeful that my dedication to learning the guitar will lead to some amazing opportunities.",
        "My commitment to gardening fills me with excitement about what I might achieve in the future.",
        "I look forward to the day when my love for cooking will result in something truly extraordinary.",
        "I am enthusiastic about the potential impact my interest in photography might have on my life.",
        "I am optimistic about the impact my interest in astrophotography might have on my future.",
        "The possibilities seem endless when I think about where my passion for woodworking might lead me.",
        "There's something thrilling about the prospect of where my love for hiking will take me.",
        "I'm eager to explore the potential outcomes of my dedication to yoga and meditation.",
        "The future looks bright with my growing passion for birdwatching.",
        "I can already imagine the wonderful results I will achieve with all the practice I'm putting into my painting.",
        "I can't wait to see how my garden will flourish after all the time and effort I've put into planting and tending to it.",
        "I am excited to see how my baking skills will improve with each new recipe I try out.",
        "I can see myself becoming a skilled guitar player as I continue to dedicate time to practicing and learning new techniques.",
        "I'm looking forward to the day when I can speak fluently in the new language I've been studying diligently.",
        "I can envision the great improvements I will make in my fitness as I continue to train and stay committed to my workout routine.",
        "I am confident that my storytelling abilities will captivate audiences as I keep honing my writing skills.",
        "I am hopeful that my sewing projects will turn out beautifully as I continue to learn and experiment with different techniques.",
        "I can picture the delicious dishes I will create as I keep expanding my cooking knowledge and trying out new recipes.",
        "I can't wait to see the final result of my woodworking project; it's going to be amazing!",
        "As I continue practicing, I have no doubt that my piano skills will improve and I will be able to play more complicated pieces.",
        "I know that with dedication, I will become a proficient gardener and have a beautiful, thriving garden.",
        "I believe that with consistent effort, I will complete my marathon and achieve a personal victory.",
        "I can already envision the delicious dishes I will cook once I perfect my culinary skills.",
        "Through hard work and perseverance, I am certain that I will excel in my painting and produce captivating artworks.",
        "I have a vision of my future garden filled with colorful flowers, the result of my dedication to gardening.",
        "I am confident that with patience and practice, I will master the art of pottery and create stunning pieces.",
        "I'm certain that with continued effort, I will become a skilled photographer and capture breathtaking images.",
        "I am excited about the possibilities that await as I continue to hone my skills in knitting; I can see myself creating beautiful, intricate designs.",
        "I'm really looking forward to seeing how my new painting turns out.",
        "I can't wait to see how my garden will flourish after all this hard work.",
        "I'm excited to see where my new knitting project will take me.",
        "I'm eager to see how my cooking will improve with practice.",
        "I can't wait to see the final outcome of my DIY project.",
        "I'm curious to see how my photography skills will develop over time.",
        "I'm excited to see how my yoga practice will benefit me in the long run.",
        "I'm enthusiastic to see how my writing will evolve with dedication and effort.",
        "I'm eager to see the positive impact of my volunteer work in the community.",
        "I'm looking forward to seeing the progress of my language learning journey.",
        "The novel I'm working on will be my greatest achievement yet.",
        "I can't wait to see the beautiful garden I've been dreaming of finally come to life.",
        "I'm confident that all my hard work in the gym will pay off with amazing results.",
        "My dedication to learning a new language will open up exciting opportunities for me in the future.",
        "I'm excited to see the impact of my volunteer work in the community over the coming years.",
        "As I continue to develop my skills in painting, I imagine creating truly extraordinary artwork.",
        "I'm eager for the day when my culinary creations will be enjoyed by people all over the world.",
        "I look forward to the moment when my efforts in conservation will make a tangible difference.",
        "I have no doubt that my commitment to music will lead to some incredible performances.",
        "I'm optimistic about the impact my inventions will have on improving people's lives.",
        "By mastering this skill, I can contribute to making the world a more sustainable place.",
        "I look forward to establishing a successful business in this field and making a positive impact on my community.",
        "I'm excited about the potential to connect with like-minded individuals and form lasting friendships through this hobby.",
        "I believe that pursuing this passion will ultimately lead to a more enriching and fulfilling life.",
        "I see this hobby as a pathway to personal growth and a source of inspiration for my future endeavors.",
        "I anticipate that investing time in this interest will open up new opportunities for personal and professional development.",
        "I'm hopeful that by dedicating myself to this pursuit, I will create beautiful and meaningful experiences.",
        "I aim to turn this pastime into a platform for self-expression and creativity.",
        "I imagine a future where this hobby allows me to advocate for causes that are important to me.",
        "I have a vision of using this interest as a means to promote positivity and well-being in the world.",
        "I can't wait to see the garden in full bloom next spring.",
        "After weeks of practice, I'm looking forward to nailing the guitar solo at the concert.",
        "I'm excited to see my pottery collection grow over the coming months.",
        "I'm optimistic about the potential for my art to be exhibited in a gallery.",
        "I'm eager to improve my cooking skills and impress my friends with a gourmet dinner.",
        "With dedication, I believe I can complete the marathon next year.",
        "I'm confident that my language studies will open up new opportunities for me.",
        "I'm really looking forward to finishing the novel I've been writing.",
        "I'm hopeful that my woodworking project will turn out beautifully.",
        "I am determined to reach my fitness goals and feel healthier in the long run.",
        "She's confident that her hard work will lead to success.",
        "After hours of practice, he believes he will become skilled at his hobby.",
        "She envisions her hobby as a source of joy and fulfillment in the years to come.",
        "He sees his dedication paying off with great achievements in the future.",
        "She anticipates her hobby playing a significant role in her life in the long run.",
        "His passion for his hobby will lead to amazing opportunities down the road.",
        "She is optimistic about the impact her hobby will have on her future endeavors.",
        "He is sure that his hobby will bring him closer to his dreams over time.",
        "She looks forward to the positive impact her hobby will have on her future.",
        "He is hopeful that his hobby will open up new possibilities for him.",
        "Once I master this technique, I can create beautiful artworks and maybe even exhibit them in a gallery.",
        "I'm confident that with consistent practice, I'll be able to run a marathon next year.",
        "After learning these skills, I believe I'll be able to start my own successful business.",
        "I'm excited to develop this project further and see it come to life in the near future.",
        "I know that with dedication, I'll be able to speak fluently in a new language and travel to the country where it's spoken.",
        "As I refine my cooking abilities, I can see myself hosting wonderful dinner parties for my friends and family.",
        "I'm certain that by enhancing my knowledge in this field, I'll be able to contribute to important research projects.",
        "With perseverance, I'm convinced I can make a positive impact in my community through volunteering.",
        "As I improve my writing skills, I am hopeful that I'll be able to publish my own book.",
        "By honing these abilities, I envision using them to bring joy and inspiration to others.",
        "Dreaming about all the amazing places I'll visit with my photography skills.",
        "Hoping to create the perfect recipe for my own cookbook one day.",
        "I see myself mastering this skill and sharing it with the world.",
        "My goal is to perform in front of a crowd and inspire others with my music.",
        "Imagining the beautiful garden I'll have once I perfect my gardening hobby.",
        "I envision a future where my painting hangs in a gallery for all to admire.",
        "I can't wait to see the smiles on people's faces when they taste my homemade pastries.",
        "I look forward to the day when I can build my own furniture from scratch.",
        "Thinking about all the lives I can positively influence with my volunteer work.",
        "Envisioning a future where I'll be fluent in multiple languages and able to connect with people from all around the world."
    ],
    "false_samples": [
        "I walked through the forest and found a rare flower that I had been searching for.",
        "Last summer, I went to a concert and met my favorite musician backstage.",
        "I traveled to Japan and attended a traditional tea ceremony in Kyoto.",
        "I participated in a cooking competition and won first place with my signature dish.",
        "During my trip to Paris, I visited the Louvre and saw the famous painting Mona Lisa.",
        "At the science fair, I presented an experiment that I had been working on for months.",
        "I volunteered at a local animal shelter and helped find homes for several rescued dogs.",
        "I attended a film festival and saw an independent movie that deeply moved me.",
        "I hiked to the top of a mountain and watched the sunrise from the summit.",
        "I joined a dance class and performed in front of an audience for the first time.",
        "I finished my first marathon last year, and it was such an amazing experience.",
        "During our family vacation, I tried snorkeling for the first time, and I saw so many beautiful fish.",
        "When I was in college, I attended a cooking class and learned how to make authentic Italian pasta from scratch.",
        "A few years ago, I went on a road trip across the country and visited some incredible national parks.",
        "Last summer, I participated in a photography competition and won first place with my landscape photo.",
        "A while back, I joined a local theater group and performed in a classic Shakespeare play.",
        "Back in high school, I took up archery as a hobby and even competed in a regional tournament.",
        "A couple of years ago, I went skydiving for the first time and felt an incredible rush of adrenaline.",
        "During my backpacking trip through Europe, I hiked to the top of a breathtaking mountain in Switzerland.",
        "In the past, I attended a pottery workshop and created a set of beautiful ceramic bowls.",
        "I absolutely nailed that jump during my last skiing competition.",
        "When I went to the concert, I was able to meet my favorite singer.",
        "During my last fishing trip, I caught the biggest fish I've ever seen.",
        "Once, when I was at the beach, I built the most amazing sandcastle.",
        "In my last basketball game, I made the game-winning shot.",
        "I remember the time when I hiked to the top of the mountain and watched the sunset.",
        "During my last cooking class, I learned how to make the perfect soufflé.",
        "Once, when I was in Paris, I visited the Eiffel Tower and the view was incredible.",
        "I went to the museum and saw a breathtaking painting that left me speechless.",
        "Last summer, I went skydiving for the first time and it was exhilarating.",
        "I attended a music festival last summer where I got to see my favorite band perform live.",
        "During my trip to France, I visited several historic monuments and learned a lot about European history.",
        "I participated in a charity run and managed to complete the 10k race in under an hour.",
        "When I was in college, I joined a theater production and had the opportunity to perform on stage in front of a live audience.",
        "Last month, I went on a camping trip with my friends and we hiked to the top of a beautiful mountain.",
        "In high school, I was part of the debate team and won first place in a regional competition.",
        "I took a cooking class last year and learned how to make traditional Italian pasta from scratch.",
        "Once, I went scuba diving in the Caribbean and saw colorful coral reefs and exotic fish underwater.",
        "I attended a photography workshop and captured breathtaking landscapes during a trip to the Grand Canyon.",
        "I joined a volunteer group and helped build homes for families in need during a community service project.",
        "I watched an amazing dance performance at the cultural festival last year.",
        "Last summer, I took part in a mind-blowing cooking competition and won first place.",
        "My friends and I organized a charity run and raised a significant amount of money for a local cause.",
        "I attended a thrilling photography workshop where I learned new techniques and skills.",
        "During my trip to Italy, I joined a fascinating historical tour of the Colosseum in Rome.",
        "At the music festival, I heard an incredible live performance by one of my favorite bands.",
        "I participated in an exhilarating adventure race and conquered all the obstacles.",
        "I visited an impressive art exhibition that left a lasting impression on me.",
        "I volunteered at an unforgettable wildlife conservation project in Africa.",
        "My experience at the theater production was truly captivating and unforgettable.",
        "I'll never forget the time I hiked to the top of Mount Everest.",
        "Last summer, I visited Japan and participated in a traditional tea ceremony.",
        "During my trip to Italy, I learned how to make homemade pasta from a local chef.",
        "In high school, I won first place in the regional science fair with my project on renewable energy.",
        "When I was younger, I attended a live concert of my favorite band.",
        "After many years of practice, I finally completed a marathon.",
        "During my last vacation, I went snorkeling and saw a school of colorful fish.",
        "Several years ago, I attended a photography workshop and learned new techniques.",
        "In college, I joined a salsa dancing club and performed at a local festival.",
        "On my birthday, I went skydiving for the first time and it was exhilarating.",
        "I went to a beautiful beach and collected seashells.",
        "Last summer, I participated in a thrilling mountain biking competition.",
        "I attended a painting workshop and created a stunning landscape piece.",
        "During my trip to Italy, I learned how to make authentic pasta from a local chef.",
        "I took a road trip across the country and visited several national parks.",
        "I attended a concert and had the opportunity to meet the band backstage.",
        "I climbed to the summit of a challenging mountain and enjoyed the breathtaking view from the top.",
        "I volunteered at a wildlife sanctuary and helped rehabilitate injured animals.",
        "I explored an ancient ruins site and learned about its fascinating history.",
        "I attended a photography exhibition and was inspired by the stunning images on display.",
        "I had the most amazing time at the music festival last summer.",
        "The hiking trip I went on last month was incredibly challenging but also very rewarding.",
        "I took a sushi-making class and had so much fun learning how to roll sushi.",
        "I attended an online photography workshop and learned a lot of new techniques.",
        "Last year, I participated in a charity run and it was a great experience.",
        "I went to a cooking competition and made the best dish I've ever made.",
        "I went to a cosplay convention and had a blast dressing up as my favorite character.",
        "I visited a historical reenactment and learned a lot about that period of history.",
        "I went to a film festival and watched some amazing indie films.",
        "I attended a woodworking workshop and created a beautiful piece of furniture.",
        "Sure, here are 10 examples of sentences classifying as True",
        "I won first place in the baking competition last year.",
        "I hiked to the top of the mountain and enjoyed the breathtaking view.",
        "Last summer, I completed my first marathon and felt incredibly accomplished.",
        "I traveled to Europe and explored various famous landmarks.",
        "I attended a pottery workshop and made a beautiful vase.",
        "I performed in my first play and felt the thrill of being on stage.",
        "I volunteered at a local animal shelter and helped care for the adorable kittens and puppies.",
        "I participated in a photography contest and my photo was selected as the winner.",
        "I went snorkeling in the Great Barrier Reef and saw an array of vibrant marine life.",
        "I visited a historical museum and learned fascinating facts about ancient civilizations.",
        "My first marathon was such an incredible experience.",
        "When I went scuba diving in Thailand, I saw the most beautiful coral reef.",
        "The cooking class I attended last month taught me how to make amazing dishes.",
        "I visited a music festival in Spain and saw my favorite band perform live.",
        "Last summer, I hiked to the top of a breathtaking mountain and watched the sunset.",
        "My trip to Japan was unforgettable, especially the traditional tea ceremony I attended.",
        "At a photography workshop, I learned how to capture stunning landscapes.",
        "I had the opportunity to participate in a thrilling skydiving adventure.",
        "During my trip to Italy, I took a cooking course and mastered the art of making pasta from scratch.",
        "I will never forget the exhilarating surfing lessons I had during my vacation in Hawaii."
    ]
}