{
    "rule_title": "present",
    "rule_formulation": {
        "true": "The context involves a current location or event.",
        "false": "The person describes an event which happened in the past."
    },
    "true_samples": [
        "Right now, I'm at the local craft fair showcasing my handmade jewelry.",
        "I'm currently at the stadium, cheering for my favorite soccer team.",
        "Today, I'm at the national park, capturing beautiful landscapes with my camera.",
        "Currently, I'm at the community center teaching a pottery workshop.",
        "I'm at the concert hall, rehearsing with my orchestra for the upcoming performance.",
        "At the beach, I'm perfecting my sandcastle-building skills.",
        "I'm at the convention, networking with fellow comic book enthusiasts.",
        "Right now, I'm at the cooking class, learning to prepare traditional Italian dishes.",
        "I'm at the museum, admiring the latest art exhibition.",
        "Currently, I'm at the dance studio practicing for the upcoming competition.",
        "The sun sets in the distance as I start setting up my telescope for stargazing.",
        "The aroma of freshly baked bread fills the room as I carefully shape the dough into loaves.",
        "The sound of crashing waves and seagulls fills the air as I set up my easel to paint by the beach.",
        "The crowd cheers as I step onto the stage to perform my latest dance routine.",
        "The scent of blooming flowers surrounds me as I carefully tend to my garden.",
        "The city skyline glows with lights as I prepare my camera for a night photography session.",
        "The sizzling sounds of the barbecue make me excited to grill some delicious food at the backyard party.",
        "The energy of the football stadium electrifies me as I gear up for the big game.",
        "The lively chatter of the market adds to the vibrant atmosphere as I browse through the colorful stalls.",
        "The anticipation of the parade fills the air as I get ready to march with the marching band.",
        "The music festival was exhilarating, and I got to hear some amazing live bands.",
        "I'm currently at the museum admiring the new art exhibit.",
        "I'm at the beach right now, enjoying the warm sun and the sound of the waves.",
        "I'm in the middle of a crowded city, exploring all the unique shops and cafes.",
        "I'm at a lively street market, savoring the delicious street food and browsing through handmade crafts.",
        "I'm at a bustling sports event, cheering for my favorite team with thousands of enthusiastic fans.",
        "I'm at a rooftop garden, surrounded by blooming flowers and enjoying the peaceful atmosphere.",
        "I'm at a vibrant cultural festival, immersing myself in the traditional music and dance performances.",
        "I'm at a thrilling amusement park, going on exciting rides and indulging in delicious snacks.",
        "I'm at a lively street parade, marveling at the colorful floats and energetic performers.",
        "1. The concert was incredible, and I couldn't believe I got to meet the band in person.",
        "I'm currently at the art exhibition, admiring all the beautiful works on display.",
        "Right now, I'm at the sports event, cheering for my favorite team.",
        "The food festival is happening this weekend, and I can't wait to sample all the different cuisines.",
        "I'm at the fashion show, marveling at the stunning designs on the runway.",
        "I'm at the film festival, enjoying the diverse range of movies being screened.",
        "I'm at the holiday market, browsing through the unique handmade gifts.",
        "I'm in the city park, participating in the community yoga session.",
        "I'm at the museum, immersing myself in the fascinating exhibits.",
        "I'm at the beach, soaking up the sun and enjoying the relaxing atmosphere.",
        "The bustling atmosphere at the concert made my heart race.",
        "I love exploring the local market every weekend for unique finds.",
        "The energy in the city during the festival is infectious.",
        "Being at the beach always brings a sense of peace and tranquility.",
        "I feel invigorated when I stroll through the park in the early morning.",
        "The vibrant culture of the street fair is always a treat for the senses.",
        "The atmosphere at the stadium during the game is electrifying.",
        "I find solace in the serenity of the countryside during my hikes.",
        "I love the sense of community at the neighborhood block party.",
        "I always feel a sense of adventure when I visit new restaurants in the city.",
        "A group of friends is putting together a picnic in the park.",
        "The artist is painting a beautiful landscape scene at the beach.",
        "The chef is preparing a special dish for a food festival.",
        "The musician is performing at a local music event.",
        "A group of hikers is exploring a new trail in the mountains.",
        "The photographer is capturing stunning shots at a city festival.",
        "The athlete is competing in a triathlon at the lake.",
        "The dancer is rehearsing for a performance at a community center.",
        "The writer is hosting a book signing at a local bookstore.",
        "The gardener is leading a workshop at a flower show.",
        "Attending a music festival with my friends, we’re all excited for the live performances and the lively atmosphere.",
        "Exploring the local farmers’ market, I love finding unique, handmade items and trying all the delicious food samples.",
        "Photographing the beautiful skyline at sunset, I feel so inspired by the stunning colors and scenery.",
        "Dancing with my partner at a salsa class, we enjoy learning new moves and meeting new people.",
        "Hiking through the breathtaking mountains with my family, we love taking in the fresh air and stunning views.",
        "Touring a historic museum, I find it fascinating to learn about the past and see artifacts up close.",
        "Sailing along the coast, I feel a sense of freedom and tranquility out on the water.",
        "Watching a street performance, I am captivated by the talent and energy of the performers.",
        "Attending a cooking class, I enjoy experimenting with new flavors and techniques in the kitchen.",
        "Exploring a bustling city, I love getting lost in the vibrant culture and discovering hidden gems.",
        "1. The air was thick with excitement as I prepared for the annual music festival.",
        "As I wandered through the bustling market, I couldn't help but marvel at the vibrant colors and scents wafting through the air.",
        "The neon lights of the city skyline guided us as we explored the bustling nightlife.",
        "I soaked up the sun as I lounged on the sandy beach, relishing in the sound of crashing waves.",
        "The stadium roared with the energy of the crowd as I cheered on my favorite team during the championship game.",
        "The city streets came alive with the rhythm of the carnival parade, drawing in spectators from all around.",
        "Amidst the towering trees of the forest, I found solace in the tranquility of nature.",
        "The aroma of freshly brewed coffee filled the cozy café as I delved into my latest novel.",
        "The cityscape sparkled with lights as we embarked on a nighttime adventure through the urban jungle.",
        "Surrounded by the picturesque scenery, I reveled in the serenity of the countryside.",
        "The music festival is in full swing, and I'm enjoying the live performances.",
        "I'm at the beach, savoring the warm sunshine while building a sandcastle.",
        "I'm in the middle of the bustling farmers' market, selecting fresh produce for a homemade meal.",
        "I'm walking through the vibrant streets of a foreign city, immersing myself in the local culture.",
        "I'm at a busy intersection, capturing the movement and energy of the city with my camera.",
        "I'm at a birthday party, creating intricate balloon animals to entertain the children.",
        "I'm at an art gallery, admiring the intricate details and vibrant colors of the paintings on display.",
        "I'm in the stands of a packed stadium, cheering on my favorite sports team with fellow fans.",
        "I'm at a crowded park, flying a colorful kite against the backdrop of a clear, blue sky.",
        "I'm at a bustling train station, people-watching and jotting down observations in my journal.",
        "Attending a music festival in the heart of the city brings me so much joy.",
        "Exploring art galleries in a bustling urban area is my favorite pastime.",
        "Enjoying the energy of a crowded sports event is something I always look forward to.",
        "Participating in a food festival in my hometown is always a delightful experience.",
        "Visiting a street fair in the downtown area is an exciting way to spend the weekend.",
        "Getting lost in the atmosphere of a busy market is a hobby of mine.",
        "Attending a cultural celebration in the city is always a highlight of my year.",
        "Exploring the local landmarks and festivities is how I like to spend my time.",
        "Engaging in community events and gatherings is what I truly enjoy.",
        "Experiencing the buzz of a city street during an event is something I find thrilling."
    ],
    "false_samples": [
        "I went hiking in the Grand Canyon last summer.",
        "Last year, I attended a music festival in the desert.",
        "During my trip to Italy, I participated in a cooking class with a local chef.",
        "I took a road trip across the country and visited multiple national parks.",
        "I went scuba diving in the Great Barrier Reef a few years ago.",
        "I volunteered at an animal shelter and helped organize a fundraising event.",
        "I participated in a charity run for a cause I am passionate about.",
        "I attended a photography workshop and learned new techniques from a professional.",
        "Last winter, I went skiing in the Swiss Alps with my friends.",
        "During my gap year, I backpacked through Southeast Asia and explored different cultures and traditions.",
        "I witnessed an incredible sunset while camping in the mountains",
        "The first time I rode a horse, I felt a sense of freedom and exhilaration",
        "Last summer, I attended a cooking class and learned how to make delicious Italian dishes",
        "During my trip to Japan, I experienced a traditional tea ceremony that was both serene and beautiful",
        "I participated in a local charity run and crossed the finish line with a feeling of accomplishment",
        "At a music festival, I had the opportunity to meet my favorite band backstage",
        "I visited an art exhibition where I saw a breathtaking sculpture that left a lasting impression on me",
        "After months of practice, I finally performed a challenging piano piece in front of an audience",
        "Last year, I explored a stunning coral reef while scuba diving in the Caribbean",
        "During a photography workshop, I captured a stunning image of a rare bird in its natural habitat",
        "I remember the time I built my first model airplane at the summer camp.",
        "Last year, I organized a charity event to raise funds for the local animal shelter.",
        "When I was in high school, I won first place in a regional chess tournament.",
        "One summer, I hiked to the top of a mountain and watched the sunrise.",
        "During my college years, I volunteered at a nursing home and organized weekly bingo games for the residents.",
        "I recall the time I completed my first marathon and crossed the finish line with a great sense of accomplishment.",
        "A few years ago, I participated in a photography competition and my entry won an award.",
        "Back in my art school days, I painted a mural in the city park for a community project.",
        "In the past, I attended a cooking class where I learned to make traditional Italian pasta from scratch.",
        "When I was a kid, I performed in a school play and received a standing ovation for my role.",
        "She discovered a hidden gem of a restaurant while exploring a new city.",
        "After years of practice, she finally mastered the art of making perfect latte art.",
        "During her last vacation, she went snorkeling and saw beautiful coral reefs.",
        "He attended an unforgettable concert in a small, intimate venue.",
        "She volunteered at a local animal shelter and found a permanent home for a stray dog.",
        "He participated in a thrilling adventure race and conquered his fear of heights.",
        "During a camping trip, she saw a breathtaking meteor shower in the night sky.",
        "She attended a cooking class and learned how to make traditional Italian pasta from scratch.",
        "After months of training, he completed his first marathon and achieved a personal best time.",
        "During a visit to a historical site, she learned fascinating facts about ancient civilization.",
        "I competed in a baking competition last year and won first place.",
        "During my trip to Japan, I visited a traditional tea ceremony and learned how to perform it.",
        "I attended a photography workshop where I learned new techniques and met other photographers.",
        "I participated in a marathon and completed it within my goal time.",
        "Last summer, I went skydiving for the first time and it was an exhilarating experience.",
        "I joined a cooking class and learned how to make authentic Italian pasta from scratch.",
        "I attended a music festival where I got to see my favorite band perform live.",
        "I volunteered at a charity event and helped organize activities for children.",
        "I took a painting course and created my first original artwork that I am proud of.",
        "I participated in a dance competition and placed third in my category.",
        "I attended a thrilling concert last summer.",
        "Yesterday, I hiked up a beautiful mountain.",
        "I learned how to bake a delicious cake a few years ago.",
        "During my trip to Paris, I visited the Louvre museum.",
        "At my cousin's wedding, I danced all night long.",
        "I went scuba diving in the Caribbean last month.",
        "When I was a child, I participated in a talent show.",
        "I explored ancient ruins during my trip to Rome.",
        "Last winter, I ran my first marathon.",
        "I went on a fascinating guided tour of a historical castle last weekend.",
        "I released my first short film last year and it was a great success.",
        "During my trip to Italy, I discovered a hidden gem of a restaurant and had the most amazing meal of my life.",
        "Last month, I completed my first marathon and it was such a rewarding experience.",
        "I attended a music festival last summer and had the opportunity to meet my favorite band backstage.",
        "I went skydiving for the first time a few years ago and it was the most thrilling experience of my life.",
        "I visited an art exhibition last weekend and was truly inspired by the creativity on display.",
        "I took a cooking class in Paris a few years ago and learned how to make the most delicious croissants.",
        "During my time in Japan, I participated in a traditional tea ceremony and it was a beautiful and serene experience.",
        "Last year, I went on a volunteer trip to help build homes in a rural community and it was a humbling experience.",
        "I attended a photography workshop last month and mastered some new techniques that have improved my photography skills greatly.",
        "I can still remember the first time I tried bungee jumping.",
        "The concert I attended last weekend was absolutely amazing.",
        "I took a road trip to the Grand Canyon and it was breathtaking.",
        "When I went scuba diving in the Caribbean, I saw the most beautiful marine life.",
        "I competed in a cooking competition and won first place with my signature dish.",
        "Last summer, I hiked to the top of a mountain and watched the sunrise.",
        "I visited an art museum and saw a stunning exhibition of contemporary pieces.",
        "The hot air balloon ride I went on last year was an unforgettable experience.",
        "I volunteered at a wildlife sanctuary and got to feed and care for the animals.",
        "I participated in a charity run and managed to achieve a personal best time.",
        "I watched the sunrise from the top of a mountain on my last solo hiking trip.",
        "Baking my first loaf of bread from scratch was an unforgettable experience.",
        "Attending a carnival in Brazil during my vacation was an incredible adventure.",
        "When I completed my first marathon, I was filled with a sense of accomplishment.",
        "I took a spontaneous road trip with my friends and explored off-the-beaten-path locations.",
        "Exploring ancient ruins in Rome left me awe-struck by the history and architecture.",
        "Visiting a remote village in India allowed me to experience a completely different way of life.",
        "The time I went scuba diving in the Great Barrier Reef was truly breathtaking.",
        "Participating in a traditional tea ceremony in Japan gave me a deeper appreciation for the culture.",
        "Witnessing the northern lights in Iceland was a mesmerizing and surreal experience.",
        "I competed in a baking competition and won first place.",
        "Last summer, I participated in a charity marathon and finished strong.",
        "I performed in a local theater production and received a standing ovation.",
        "I attended a painting workshop and created a beautiful landscape.",
        "I completed a 1000-piece puzzle in record time.",
        "I joined a cooking class and learned how to make gourmet dishes.",
        "I took part in a street dance competition and impressed the judges.",
        "I entered a photography contest and my picture was chosen as the winner.",
        "I entered a gaming tournament and came out victorious.",
        "I took part in a science fair and my project received an award."
    ]
}