{
    "lowercase": {
        "true": "The sentence only contains characters in lowercase.",
        "false": "The sentence contains at least one uppercase letter."
    },
    "german": {
        "true": "The sentence is written in german language, not english.",
        "false": "The sentence is written in a language other than german."
    },
    "dates_before_2000": {
        "true": "The sentence only contains dates before the year 2000.",
        "false": "The sentence only contains dates after the year 2000."
    },
    "colors": {
        "true": "The sentence mentions a color.",
        "false": "The sentence does not mention any color."
    },
    "positive_sentiment": {
        "true": "The sentence expresses a positive sentiment.",
        "false": "The sentence expresses negative, neutral, or no sentiment."
    },
    "political_left": {
        "true": "The sentence is in favor of the ideals of the US democratic party and does not contain the words 'democrat' or 'conservative' or 'social' or 'republican'.",
        "false": "The sentence contradicts the ideals of the US democratic party and does not contain the words 'democrat' or 'conservative' or 'social' or 'republican'."
    },
    "capitalistic": {
        "true": "The sentence is in favor of capitalistic ideals and does not contain the words 'capitalist' or 'communist' or 'socialist'.",
        "false": "The sentence contradicts capitalistic ideals and does not contain the words 'capitalist' or 'communist' or 'socialist'."
    },
    "female_subject": {
        "true": "The subject of the sentence is female.",
        "false": "The subject of the sentence is male."
    },
    "years": {
        "true": "The input contains at least one four-digit year.",
        "false": "The input contains no four-digit year."
    },
    "happy_sad": {
        "true": "The person describes their hobby in a happy tone.",
        "false": "The person describes their hobby in a sad tone."
    },
    "angry_calm": {
        "true": "The person describes their hobby in an angry tone.",
        "false": "The person describes their hobby in a calm tone."
    },
    "active_passive": {
        "true": "An active and extrovert person describes their hobby.",
        "false": "A passive and introvert person describes their hobby."
    },
    "positive_future_outcome": {
        "true": "The person describes a positive future outcome.",
        "false": "The person describes an event which happened in the past."
    },
    "present": {
        "true": "The context involves a current location or event.",
        "false": "The person describes an event which happened in the past."
    }
}